const data = {
  '旧石器': {
    name: '旧石器时期',
    from: '前300万年',
    to: '前1万年',
    des: `   传说的蛇族双帝时代，蛇族双帝指伏羲和女娲，公元前约78到77世纪他们建立伏羲罗奉政权，成为黄河下游地区的氏族首领。`,
    persons: [
      { name: '元谋人', des: '170万年	云南元谋县' },
      { name: '蓝田人', des: '69万年	陕西省蓝田县' },
      { name: '北京猿人', des: '50万年	北京周口店' },
      { name: '金牛山文化', des: '40万年	辽宁省大石桥市' },
      { name: '大荔人', des: '20万年	陕西省大荔县' },
      { name: '马坝人', des: '13万年	广东韶关市' },
      { name: '丁村人', des: '10万年	山西省襄汾县' },
      { name: '柳江人', des: '6.7万年	广西壮族自治区' },
      { name: '河套人', des: '3.7万年	内蒙古自治区' },
      { name: '下川文化', des: '2.5万年	山西沁水县' },
      { name: '山顶洞人', des: '1.1万年	北京周口店' },
    ]
  },
  '新石器': {
    name: '新石器时期',
    from: '前1万年',
    to: '前5000年',
    des: `     中国在该阶段已经出现了国家的萌芽，该时间依据夏商周断代工程的研究成果。 这一时期对应传说中神农时期。
    `,
    persons: [
      { name: '仙人洞文化', des: '距今9000年', des1: '江西万年县大源乡' },
      { name: '大地湾文化', des: '距今4800~8000年', des1: '甘肃秦安县' },
      { name: '磁山文化', des: '距今7600~8000年', des1: '河北邯郸磁山' },
      { name: '裴李岗文化', des: '距今7000~8000年', des1: '河南裴李岗村' },
      { name: '半坡文化', des: '公元前6800~6300年', des1: '陕西半坡村' },
      { name: '庙底沟文化', des: '公元前4005~2780年', des1: '河南陕县古城' },
      { name: '大溪文化', des: '公元前4400~3300年', des1: '重庆市巫山县' },
      { name: '河姆渡文化', des: '公元前5000~3300年', des1: '浙东宁绍平原' },
      { name: '大汶口文化早期', des: '公元前4500~3000年', des1: '山东大汶口镇' },
      { name: '屈家岭文化', des: '1-2.5万年', des1: '山西南部沁水县中条山' },
    ]
  },
  '金石并用': {
    name: '金石并用期',
    from: '前5000年',
    to: '前2000年',
    des: `    中国在该阶段已经出现邦国、刻骨文等城市国家和成熟文字。这一时期对应传说中的五帝时期。
    `,
    persons: [
      { name: '仰韶文化晚期', des: '公元前3000年', des1: '南省三门峡市渑池县仰韶村' },
      { name: '大汶口文化晚期', des: '公元前2500年', des1: '山东省泰安市岱岳区大汶口镇' },
      { name: '红山文化', des: '公元前4000年~3000年', des1: '内蒙古中南部至东北部一带' },
      { name: '龙山文化', des: '公元前2500年~2000年', des1: '东省济南市历城县龙山镇' },
      { name: '良渚文化', des: '公元前9900~4600年', des1: '浙江太湖流域(钱塘江水系)' },
      { name: '马家窑文化', des: '公元前3300~2050年', des1: '甘肃临洮马家窑' },
      { name: '齐家文化', des: '公元前2000~1900年', des1: '甘肃青海省境内的黄河及凉州' },
    ]
  },
  '青铜器': {
    name: '青铜器时期',
    from: '前2000年',
    to: '春秋时期',
    des: `    我国最早的青铜器发现于河南偃师二里头遗址中，其所处年代约当公元前21世纪至前17世纪，相当于史籍所载夏王朝的时代，是为奴隶制国家建立时期。至商代，则为高度发达的青铜时代。我国的青铜时代结束于春秋时期，至战国时期始被铁器时代所取代，
    基本贯穿于奴隶制社会终。这一时代，农业、手工业有较快的发展，并出现了文字。国家政权建设逐步完善。`,
    persons: [
      { name: '三星堆文化', des: '公元前2500~1000年', des1: '四川省广汉市三星堆镇' },
      { name: '二里头文化', des: '公元前2000~1400年', des1: '山东省平度市东岳石村' },
      { name: '岳石文化', des: '公元前2000~1500年', des1: '山东省平度市东岳石村' },
      { name: '四坝文化', des: '公元前1900~1400年', des1: '甘肃省河西走廊中西部地区' },
      { name: '安阳殷墟', des: '公元前2000~1400年', des1: '河南安阳市西北殷都区小屯村' },
      { name: '周原遗址', des: '公元前1000~700年', des1: '陕西省宝鸡市扶风、岐山' },
      { name: '半镐遗址', des: '公元前1200~1000年', des1: '山西省长安县沣河两岸' },
      { name: '半镐遗址', des: '公元前2000~1500年', des1: '内蒙古自治区赤峰' },
    ]
  },
}

export default data
