export default {
  '西周': [
    {
      content: `周文王姬昌
      （前1152年～前1056年）
      周武王姬发
      （？～前1043年）
      周成王姬诵
      （?～前1021年)
      周康王姬钊
      （？～前1057年）
      周昭王姬瑕
      （？~前977年）
      周穆王姬满
      （前1054年～前949年）
      周共王姬繄扈
      （前1019～前936年）
      周懿王姬囏
      （约前937~前892年）
      周孝王姬辟方
      （前960年～前896年）
      周夷王姬燮
       （前885-前878年 ）
      周厉王姬胡
      （前904年～前829年）
      周宣王姬静
      （？～前783年）
      周幽王姬宫湦
      （前795年～前771年）
      周携王姬余臣
       (前794年～前750年)`
    }
  ],
  
  '春秋': [
    {
      content: `周平王姬宜臼
      （前768~前718年）
      周桓王姬林
      （前719年~前697年）
      周庄王姬佗
      （前696年~前682年）
      周釐王姬胡齐
      （前682年~前677年）
      周惠王姬阆
      （？~前653年）
      周襄王姬郑
      （前651年~前619年）
      周顷王姬壬臣
      （前618年~前614年）
      周匡王姬班
      （前612年~前607年）
      周定王姬瑜
      （前606年~前586年）
      周简王姬夷
      （前586年～前572年）
      周灵王姬泄心
      （前572年～前545年）
      周景王姬贵
      （前545年~前520年）
      周悼王姬猛
        (前520年～前520年)
      周敬王姬匄
        (前520年～前477年)
      周元王姬仁
      （前476～前469年）
      周贞定王姬介
      （前469年～前441年）
      周哀王姬去疾
      （前441年～前441年）
      周思王姬叔
      （前441年～前441年）
      周考王姬嵬
      （前441年～前426年）
      周威烈王姬午
        (前425年～前402年)
      周安王姬骄
      （前402年～前376年）
      周烈王姬喜
      （前376年～前369年）
      周显王姬扁
      （前369年～前321年）
      周慎靓王姬定
      （前321年～前315年）
      周赧王姬延
      （前336年～前256年）`
    }
  ],
  '战国': [
    {
      type: '齐',
      content:  `齐平公姜骜
      (前480年~前456年)
     齐宣公姜积
      (前455年~前405年)
     齐康公姜贷
      (前404年~前379年）
     齐太公田和
      (前404年~前384年) 
     齐废公田剡
      (前383年~前375年) 
     齐桓公田午
      (前374年~前357年) 
     齐威王田因齐
      (前356年~前320年)  
     齐宣王田辟强
      (前319年~前301年) 
     齐愍王田地
      (前300年~前284年) 
     齐襄王田法章
      (前283年~前265年)  
     齐废王田建
      (前264年~前221年）`
    },
    {
      type: '楚',
      content: `楚惠王熊章
      (前488年~前432年) 
     楚简王熊中
      (前431年~前408年) 
     楚声王熊当
      (前407年~前402年)
     楚悼王熊疑
      (前401年~前381年) 
     楚肃王熊臧
      (前380年~前370年) 
     楚宣王熊良夫
      (前369年~前340年) 
     楚威王熊商
      (前339年~前329年) 
     楚怀王熊槐
      (前328年~前296年) 
     楚顷襄王熊横
      (前298年~前263年) 
     楚考烈王熊元
      (前262年~前238年) 
     楚幽王熊悍
      (前237年~前229年) 
     楚哀王熊犹
      (前228年~前228年) 
     楚王负刍熊负刍
      (前228年~前223年)`
    },
    {
      type: '燕',
      content: `燕孝公　
      (前492年~前455年)
      燕成公　
      (前454年—前439年)
      燕闵公　
      (前438年—前415年)
      燕简公姬载
      (前414年—前373年)
      燕后桓公　
      (前372年—前362年)
      燕后文王　
      (前361年—前333年)
      燕易王　
      (前332年—前321年)
      燕王哙姬哙　
      (前320年—前317年)
      燕昭王姬职　
      (前311年—前279年)
      燕惠王姬乐资　
      (前278年—前272年)
      燕武成王　
      (前271年—前258年)
      燕孝王　
      (前257年—前255年)
      燕王喜姬喜　
      (前254年—前222年)`
    },
    {
      type: '韩',
      content: `韩康子韩虎
      ( ？—前425年)
     韩武子韩启章
      (前424年—前409年)
     韩景侯韩虔
      (前408年—前400年)
     韩烈侯韩取
      (前399年—前387年)
     韩文侯韩猷
      (前386年—前377年)
     韩哀侯韩屯蒙
      (前376年—前374年)
     韩共侯韩若山
      (前374年—前363年)
     韩厘侯韩武
      (前362年—前333年) 
     韩威侯韩康
      (前332年—前312年) 
     韩襄王韩仓
      (前311年—前296年)
     韩厘王韩咎
      (前295年—前273年)
     韩桓惠王韩然
      (前272年—前239年)
     韩王安韩安
      (前238年—前230年)`
    },
    {
      type: '赵',
      content: `赵襄子赵毋恤
      (前475年~前425年)
     赵桓子赵嘉
      (?~前424年)
     赵献子赵浣
      (前423年~前409年)
     赵烈侯赵籍
      (前408年~前400年)
     赵烈侯赵籍
      (前408年~前400年)
     赵武侯
      (前399年~前387年)
     赵敬侯赵章
      (前386年~前375年)
     赵成侯赵种
      (前374年~前350年)
     赵肃侯赵语
      (前349年~前326年)
     赵武灵王赵雍
      (前325年~前298年)
     赵惠文王赵何
      (前298年~前266年)
     赵孝成王赵丹
      (前265年~前245年)
     赵悼襄王赵偃
      (前244年~前236年)
     赵幽缪王赵迁
      (前235年~前228年)
     代王嘉赵嘉
      (前227年~前222年)`
    },
    {
      type: '魏',
      content: `魏文侯魏斯
      (前445年—前396年)
     魏武侯魏击
      (前395年—前370年)
     魏惠王魏罃
      (前369年—前319年)
     魏襄王魏嗣
      (前318年—前296年)
     魏昭王魏遫
      (前295年—前277年)
     魏安釐王魏圉
      (前276年—前243年)
     魏景湣王魏增
      (前242年—前228年)
     魏王假
      (前227年—前225年)`
    }
  ],
  '晋': [
    {
      type2: '东晋',
      content: `元帝司马睿
      明帝司马绍
      成帝司马衍
      康帝司马岳
      穆帝司马聃
      哀帝司马丕
      海西公司马奕
      简文帝司马昱
      孝武帝司马曜
      安帝司马德宗
      恭帝司马德文`
    },
    {
      type2: '成汉',
      content: `（成）景帝李特
      （成）秦文王李流
      （成）武帝李雄
      （成）哀帝李班
      （成）幽公李期
      （汉）昭文帝李寿
      （汉）末主李势`
    },
    {
      type2: '汉赵',
      content: `（汉）光文帝刘渊
      （汉）梁王刘和
      （汉）昭武帝刘聪
      （汉）隐帝刘粲
      （赵）秦王刘曜
      `
    },
    {
      type2: '后赵',
      content: `明帝石勒
      文帝石弘
      武帝石虎
      正帝石世
      成帝石遵
      仁武帝石鉴
      兴武帝石祗`
    },
    {
      type2: '冉魏',
      content: `武悼天王冉闵
      惠帝冉智`
    },
    {
      type2: '前凉',
      content: `武穆王张轨
      昭王张实
      成王张茂
      文王张骏
      桓王张重华
      哀王张耀灵
      威王张祚
      冲王张玄靓
      悼王张天锡
      凉王张大豫`
    },
    {
      type2: '后凉',
      content: `景昭帝吕婆楼
      懿武帝吕光
      隐王吕绍
      灵帝吕纂
      后主吕隆`
    },
    {
      type2: '西凉',
      content: `武昭王李暠
      后主李歆
      末主李恂`
    },
    {
      type2: '南凉',
      content: `武王秃发乌孤
      康王秃发利鹿孤
      景王秃发傉檀`
    },
    {
      type2: '北凉',
      content: `文王段业
      武宣王沮渠蒙逊
      哀王沮渠牧犍
      高昌王沮渠无讳
      河西王沮渠安周`
    },
    {
      type2: '前燕',
      content: `武宣帝慕容廆
      文明帝慕容皝
      景昭帝慕容俊
      幽帝慕容暐`
    },
    {
      type2: '后燕',
      content: `成武帝慕容垂
      惠愍帝慕容宝
      开封公慕容详
      赵王慕容麟
      昭武帝慕容盛
      昭文帝慕容熙`
    },
    {
      type2: '西燕',
      content: `归帝慕容泓
      威帝慕容冲
      昌平王段随
      中帝慕容觊
      文帝慕容瑶
      代帝慕容忠
      末帝慕容永`
    },
    {
      type2: '北燕',
      content: `惠懿帝高云
      文成帝冯跋
      昭成帝冯弘`
    },
    {
      type2: '南燕',
      content: `献武帝慕容德
      末主慕容超`
    },
    {
      type2: '胡夏',
      content: `桓帝刘卫辰
      武烈帝赫连勃勃
      德武帝赫连昌
      平武帝赫连定`
    },
    {
      type2: '前秦',
      content: `惠武帝苻洪
      高祖苻健
      厉王苻生
      世祖苻坚
      哀平帝苻丕
      太宗苻登
      后主苻崇`
    },
    {
      type2: '后秦',
      content: `武昭帝姚苌
      文桓帝姚兴
      末主姚泓`
    },
    {
      type2: '西秦',
      content: ` 宣烈王乞伏国仁
      武元王乞伏乾归
      文昭王乞伏炽盘
      厉武王乞伏慕末`
    },
    {
      type2: '代国',
      content: `太祖拓跋猗卢
      太宗拓跋普根
      世祖拓跋始生
      平文帝拓跋郁律
      惠帝拓跋贺傉
      炀帝拓跋纥那
      烈帝拓跋翳槐
      昭帝拓跋什翼犍`
    },
    {
      type2: '西楚',
      content: `蜀王谯纵`
    },
  ],
  '南北朝': [
    {
      type: '南朝',
      type2: '宋',
      content: `武帝刘裕
      少帝刘义符
      文帝刘义隆
      元帝刘劭
      孝武帝刘骏
      前废帝刘子业
      明帝刘彧
      后废帝刘昱
      顺帝刘准`
    },
    {
      type2: '齐',
      content: `高帝萧道成
      武帝萧赜
      郁林王萧昭业
      海陵王萧昭文
      明帝萧鸾
      东昏侯萧宝卷
      和帝萧宝融`
    },
    {
      type2: '梁',
      content: `武帝萧衍
      临贺王萧正德
      简文帝萧纲
      豫章王萧栋
      武陵王萧纪
      元帝萧绎
      闵帝萧渊明
      敬帝萧方智
      后梁
      宣帝萧詧
      明帝萧岿
      靖帝萧琮`
    },
    {
      type2: '陈',
      content: `武帝陈霸先
      文帝陈蒨
      废帝陈伯宗
      宣帝陈顼
      炀帝陈叔宝`
    },
    {
      type: '北朝',
      type2: '北魏',
      content: `道武帝拓跋珪
      明元帝拓跋嗣
      太武帝拓跋焘
      南安王拓跋余
      文成帝拓跋浚
      献文帝拓跋弘
      孝文帝元宏
      宣武帝元恪
      孝明帝元诩
      幼主元钊
      孝庄帝元子攸
      长广王元晔
      节闵帝元恭
      安定王元朗
      孝武帝元脩
      东魏
      孝静帝元善见
      西魏
      文帝元宝炬
      废帝元钦
      恭帝拓跋廓`
    },
    {
      type2: '北齐',
      content: `神武帝高欢
      文襄帝高澄
      文宣帝高洋
      废帝高殷
      孝昭帝高演
      武成帝高湛
      后主高纬
      安德王高延宗
      幼主高恒
      范阳王高绍义`
    },
    {
      type2: '北魏',
      content: `文帝宇文泰
      孝闵帝宇文觉
      明帝宇文毓
      武帝宇文邕
      宣帝宇文赟
      静帝宇文衍`
    },
  ],
  '唐': [
    {
      type2: '',
      content: `唐高祖李渊
      唐太宗李世民
      唐高宗李治
      唐中宗李显
      唐睿宗李旦
      武周
      大圣皇帝武武则天
      唐朝复辟
      唐中宗李显
      唐殇帝李重茂
      唐睿宗李旦
      唐玄宗李隆基
      唐肃宗李亨
      唐代宗李豫
      唐德宗李适
      唐顺宗李诵
      唐宪宗李纯
      唐穆宗李恒
      唐敬宗李湛
      唐文宗李昂
      唐武宗李炎
      唐宣宗李忱
      唐懿宗李漼
      唐僖宗李儇
      唐昭宗李晔
      唐哀帝李柷`
    },
    {
      type2: '渤海国',
      content: `渤海高王大祚荣
      渤海武王大武艺
      渤海文王大钦茂
      渤海前废王大元义
      渤海成王大华兴
      渤海康王大嵩璘
      渤海定王大元瑜
      渤海僖王大言义
      渤海简王大明忠
      渤海宣王大仁秀
      渤海宁王大彝震
      渤海雍王大虔晃
      渤海厉王大玄锡
      渤海赧王大玮瑎
      渤海后废王大諲撰`
    }
  ],
  '五代十国': [
    {
      type: '五代',
      type2: '后梁',
      content: `太祖朱温
      郢王朱友珪
      末帝朱瑱（朱友贞）`
    },
    {
      type2: '后唐',
      content: `太祖李克用
      庄宗李存勖
      明宗李亶
      闵帝李从厚
      末帝李从珂`
    },
    {
      type2: '后晋',
      content: `高祖石敬瑭
      出帝石重贵`
    },
    {
      type2: '后汉',
      content: `高祖刘暠
      隐皇帝刘承佑
      湘阴公刘赟
      世祖刘旻
      睿宗刘钧
      少主刘继恩
      英武帝刘继元`
    },
    {
      type2: '后周',
      content: `太祖郭威
      世宗柴荣
      恭帝柴宗训`
    },
    {
      type: '十国',
      type2: '吴越',
      content: `太祖钱鏐
      世宗钱元瓘
      成宗钱弘佐
      忠逊王钱弘倧
      忠懿王钱弘俶`
    },
    {
      type2: '闽国',
      content: `太祖王审知
      嗣王王延翰
      惠宗王延钧
      康宗王昶
      景宗王曦
      殷帝王延政`
    },
    {
      type2: '荆南',
      content: `武信王高季兴
      文献王高从诲
      贞懿王高宝融
      荆南侍中高保勖
      荆南侍中高继`
    },
    {
      type2: '南楚',
      content: `武穆王马殷
      衡阳王马希声
      文昭王马希范
      前废王马希广
      恭孝王马希萼
      后废王马希崇`
    },
    {
      type2: '南吴',
      content: `太祖杨行密
      烈宗杨渥
      高祖杨渭
      让帝杨溥`
    },
    {
      type2: '岐国',
      content: `忠敬王李茂贞
      桀燕（杰燕）
      桀王刘仁恭
      燕王刘守光`
    },
    {
      type2: '南唐',
      content: `烈祖李升
      元宗李璟
      后主李煜`
    },
    {
      type2: '南汉',
      content: `烈宗刘隐
      高祖刘岩
      殇帝刘玢
      中宗刘晟
      后主刘鋹`
    },
    {
      type2: '前蜀',
      content: `高祖王建
      后主王衍`
    },
    {
      type2: '后蜀',
      content: `高祖孟知祥
      后主孟昶`
    },
  ],
  '宋辽': [
    {
      type2: '',
      content: `辽太祖耶律阿保机
      辽太宗耶律德光
      辽世宗耶律阮
      辽穆宗耶律璟
      辽景宗耶律贤
      辽圣宗耶律隆绪
      辽兴宗耶律宗真
      辽道宗耶律洪基
      天祚帝耶律延禧`
    },
    {
      type2: '西辽',
      content: `辽德宗耶律大石
      感天后萧塔不烟
      辽仁宗耶律夷列
      承天后耶律普速完
      辽末帝耶律直鲁古
      辽恭帝耶律屈出律`
    },
    {
      type2: '南宋',
      content: `宋高宗赵构
      元懿太子赵旉
      宋孝宗赵眘（赵伯琮，赵瑗）
      宋光宗赵淳
      宋宁宗赵扩
      宋理宗赵昀
      宋度宗赵禥
      宋恭帝赵?（赵显）
      宋端宗赵昰
      宋帝昺赵昺`
    },
    {
      type2: '金',
      content: `金太祖完颜旻（完颜阿骨打）
      金太宗完颜晟
      金熙宗完颜亶
      海陵王完颜亮
      金世宗完颜雍
      金章宗完颜璟
      卫绍王完颜永济
      金宣宗完颜珣
      金哀宗宛颜守绪
      金末帝完颜承麟`
    },
    {
      type2: '西夏',
      content: `太祖李继迁
      太宗李德明
      景宗李元昊
      毅宗李谅祚
      惠宗李秉常
      崇宗李乾顺
      仁宗李仁孝
      桓宗李纯佑
      襄宗李安全
      神宗李遵顼
      献宗李德旺
      末帝李睍`
    },
  ],
  '元': [
    {
      type2: '',
      content: `太祖（成吉思汗）铁木真
      元睿宗（监国）拖雷
      元太宗窝阔台
      马乃真后（称制）
      元定宗贵由
      海迷失后（称制）
      元宪宗孛儿只斤蒙哥
      元世祖（薛禅汗）忽必烈
      元成宗（完泽笃汗）铁穆耳
      元武宗（曲律汗）海山
      元仁宗（普颜笃汗）
                  爱育黎拔力八达
      元英宗（格坚汗）硕德八剌
      泰定帝也孙铁木儿
      天顺帝阿速吉八
      元文宗（札牙笃汗）图帖睦尔
      元明宗和世剌
      元宁宗懿璘质班
      元惠宗（乌哈图汗）妥懽帖睦尔
      元昭宗爱猷识理答腊
      元益宗脱古思帖木儿`
    }
  ]
}