export default {
  '后羿': {
    name: '后羿',
    dynasty: '夏朝',
    from: '前2070年',
    to: '前1600年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail1.png',
    content: `
    本称羿，中国远古五帝时期的神话人物，擅于射箭，曾助尧帝射九日，在民间有"羿射九日"的典故。
《淮南子》云:"尧之时十日并出，焦禾稼，杀草木，而民无所食，羿上射十日，万民皆喜，置尧以为天子。"
先秦文献中，《山海经》多次出现羿射杀怪兽的事迹，《楚辞·天问》中也已收录羿射日的典故。汉代文献中，《括地图》称羿在年仅五岁的时候被父母抛弃在深山，自幼在山林中成长。 他善于射箭，一称他是帝喾时的射官， 《淮南子·本经训》:"尧之时十日并出，焦禾稼，杀草木，而民无所食，羿上射十日，万民皆喜，置尧以为天子。" 根据《括地志》记载，羿被帝尧封于商丘(今河南省商丘市)。 "嫦娥奔月"的典故也与他有关。`
  },
  '寒浞': {
    name: '寒浞',
    dynasty: '夏朝',
    from: '前2070年',
    to: '前1600年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/2.png',
    content: `
    妘姓，名浞。夏朝时期的篡位君主，只是因为他的名声不好，以孔子的儒家思想为主体的中国历史把他排斥在帝王之外。他早年任东夷有穷氏部落首领后羿的相，后羿趁夏君太康不恤国事趁虚而入，"因夏民以代夏政"，夺得了夏朝政权，史称太康失国。
后羿执政8年,不修民事，寒浞趁机杀死后羿，夺取有穷氏大权。寒浞二十八年，寒浞消灭了偏安在斟鄩的夏朝残余势力相，使自太康失国以来长期分裂的中原北方地区重新统一。`
  },
  '伊尹': {
    name: '伊尹',
    dynasty: '商朝',
    from: '前1600年',
    to: '前1046年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail2.png',
    content: `
    己姓，伊氏，名挚，有莘国(今河南省杞县葛岗镇空桑村 )，史籍记载生于洛阳伊川 ，商朝开国元勋，杰出的政治家、思想家，中华厨祖。 今江苏省连云港市灌云县境内伊芦山是伊尹晚年隐居采药的地方，此山因之得名伊莱山，后演变为伊芦山。
聪明颖慧，勤学上进，耕作于有莘国。经过成汤三聘之后，担任右相，联合仲虺辅佐商汤打败夏桀。商朝建立后。担任尹(相当于秦朝时期的丞相)，用"以鼎调羹"、"调和五味"的理论治理天下。积极整顿吏治，洞察民心国情，推动经济繁荣、政治清明。历事成汤、外丙、仲壬、太甲、沃丁五代君主，尊号"阿衡"，辅政五十余年，为商朝兴盛富强立下汗马功劳。`
  },
  '比干': {
    name: '比干',
    dynasty: '商朝',
    from: '前1600年',
    to: '前1046年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/5.png',
    content: `
    沫邑(今河南省淇县)人，封于比邑(今山西省汾阳市)，故称比干，也称王子比干 ，商王文丁的儿子，商王帝乙的弟弟，商纣王帝辛的叔父(一说是纣王的兄弟 )，殷商王室的重臣。
幼年聪慧，勤奋好学。授以少师，辅佐商王帝乙。接受托孤之重，辅佐商纣王帝辛，历经两朝，忠君爱国，为民请命，敢于直言劝谏。从政40多年，主张鼓励发展农牧业生产，提倡冶炼铸造，富国强兵，成为"亘古忠臣"。帝辛二十九年(公元前1047年)，去世，终年六十四岁。唐太宗时期，追赠太师，谥号忠烈。`
  },
  '箕子': {
    name: '箕子',
    dynasty: '商朝',
    from: '前1600年',
    to: '前1046年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/4.png',
    content: `
    名胥余，殷商末期人，是文丁的儿子，帝乙的弟弟，纣王的叔父。官太师，封于箕，在商周政权交替与历史大动荡的时代中，因其道之不得行，其志之不得遂，"违衰殷之运，走之朝鲜"，建立朝鲜，其流风遗韵，至今犹存。
箕子与微子、比干，在殷商末年齐名，并称"殷末三仁"，在孔子《论语·微子》中曰:" 微子去之，箕子为之奴，比干谏而死，殷有三仁焉。`
  },
  '微子': {
    name: '微子',
    dynasty: '商朝',
    from: '前1600年',
    to: '前1046年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/6.png',
    content: `
    子姓，宋氏，名启，后世称微子、微子启、宋微子。微子是商王帝乙的长子、商纣王帝辛的长兄。
子启同母兄弟共有三人，子启是长兄，中衍(宋微仲)居中，受德(商纣王)最小。微子启的母亲生子启和中衍的时候还是妾的身份，后来成为正妻后才生下了纣。父母想要立长子子启为太子，而太史则依据法典为此事争辩，认为有正妻的儿子在，就不可立妾的儿子做太子。子启因此没有成为商王的继承人。`
  },
  '姜尚': {
    name: '姜尚',
    dynasty: '西周',
    from: '前1046年',
    to: '前766年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail3.png',
    content: `
    姜子牙，姜姓，吕氏，名望，字子牙，号飞熊，也称吕尚。商朝末年人，其始祖四岳伯夷佐大禹治水有功而被封于吕地，因此得吕氏。姜子牙出世时，家境已经败落了，所以姜子牙年轻的时候干过宰牛卖肉的屠夫，也开过酒店卖过酒，聊补无米之炊。但姜子牙人穷志不短，始终勤奋刻苦地学习天文地理、军事谋略，研究治国安邦之道，期望能为国施展才华。姜太公是齐国的缔造者，周文王倾商武王克殷的首席谋主、最高军事统帅与西周的开国元勋，齐文化的创始人，亦是中国古代的一位影响久远的杰出的韬略家、军事家与政治家。历代典籍都公认他的历史地位，儒、道、法、兵、纵横诸家皆追他为本家人物，被尊为“百家宗师”。`
  },
  '周公旦': {
    name: '周公旦',
    dynasty: '西周',
    from: '前1046年',
    to: '前766年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/8.png',
    content: `
    周公，姬姓，名旦，是周文王姬昌第四子，周武王姬发的弟弟，曾两次辅佐周武王东伐纣王，并制作礼乐。因其采邑在周，爵为上公，故称周公。周公是西周初期杰出的政治家、军事家、思想家、教育家，被尊为“元圣”和儒学先驱。`
  },
  '曹刿': {
    name: '曹刿',
    dynasty: '春秋',
    from: '前1046年',
    to: '前766年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/9.png',
    content: `
    曹刿一作曹翙，即曹沫(有争议)。生卒年不详，春秋时期鲁国(今山东菏泽)人，周文王第六子曹叔振铎之后，著名的军事理论家。鲁庄公十年，齐攻鲁，刿求见请取信于民后战，作战时随从指挥，大败齐师，一鼓作气之典出于此。`
  },
  '先轸': {
    name: '先轸',
    dynasty: '春秋',
    from: '前680年',
    to: '前627年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/13.png',
    content: `
    晋国原邑(今河南省济源市)人，春秋时期晋国名将、军事家，因采邑在原邑，故又称原轸。先轸曾辅佐晋文公、晋襄公两位霸主，屡出奇策，并以中军主将的身份指挥城濮之战、崤之战，打败强大的楚国和秦国，成为中国历史上第一位同时拥有元帅头衔和元帅战绩的军事统帅。`
  },
  '晏婴': {
    name: '晏婴',
    dynasty: '春秋',
    from: '前578年',
    to: '前500年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/10.png',
    content: `
    名婴，字仲，谥平，习惯上多称平仲。夷维(今山东省莱州市)人，春秋时期著名政治家、思想家、外交家。
晏婴是齐国上大夫晏弱之子。齐灵公二十六年(前556年)晏弱病死，晏婴继任为上大夫。历任齐灵公、庄公、景公三朝，辅政长达50余年。以有政治远见、外交才能和作风朴素闻名诸侯。晏婴聪颖机智，能言善辩。内辅国政，屡谏齐候。对外他既富有灵活性，又坚持原则性，出使不受辱，捍卫了齐国的国格和国威。`
  },
  '伍子胥': {
    name: '伍子胥',
    dynasty: '春秋',
    from: '前559年',
    to: '前484年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/14.png',
    content: `
    字子胥，楚国人，春秋末期吴国大夫、军事家。以封于申，也称申胥。
伍子胥之父伍奢为楚平王子建太傅，因受费无极谗害，和其长子伍尚一同被楚平王杀害。伍子胥从楚国逃到吴国，成为吴王阖闾重臣，是姑苏城(今苏州)的营造者，至今苏州有胥门。公元前506年，伍子胥协同孙武带兵攻入楚都，伍子胥掘楚平王墓，鞭尸三百，以报父兄之仇。吴国倚重伍子胥等人之谋，西破强楚、北败徐、鲁、齐，成为诸侯一霸。`
  },
  '文种': {
    name: '文种',
    dynasty: '春秋',
    from: '？',
    to: '前472年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/11.png',
    content: `
    字会、少禽，一作子禽，春秋末期楚之郢(今湖北江陵附近)人，后定居越国。春秋末期著名的谋略家。越王勾践的谋臣，和范蠡一起为勾践最终打败吴王夫差立下赫赫功劳。灭吴后，自恃功高，不听从范蠡功成身退的劝告，后为勾践所不容，最后被勾践赐死。`
  },
  '范蠡': {
    name: '范蠡',
    dynasty: '春秋',
    from: '前536年',
    to: '前448年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/15.png',
    content: `
    少伯，华夏族，楚国宛地三户(今南阳淅川县寺湾镇)人。春秋末期政治家、军事家、谋略家、经济学家和道家学者，越国相国、上将军。曾献策扶助越王勾践复国，兴越灭吴，后隐去。著《范蠡》兵法二篇，今佚。
范蠡为中国早期商业理论家，楚学开拓者之一。被后人尊称为"商圣"，"南阳五圣"之一。虽出身贫贱，但博学多才、文武双全 。与楚宛令文种相识、相交甚深。因不满当时楚国政治黑暗、非贵族不得入仕而一起投奔越国，之后被拜为上大夫、相国，辅佐越国勾践。他帮助勾践兴越国，灭吴国，一雪会稽之耻，成就霸业，又被封为上将军。功成名就之后急流勇退，化名姓为鸱夷子皮，遨游于七十二峰之间。期间三次经商成巨富，三散家财。后定居于宋国陶丘(今山东省菏泽市定陶区南)，自号"陶朱公"， 公元前448年，范蠡卒，时年88岁 。至唐朝唐德宗建中三年(782年)，配享武成王庙，被追封为古今六十四名将(武成王庙六十四将)之一 ; 宋朝时期，配享武庙。`
  },
  '孙武': {
    name: '孙武',
    dynasty: '春秋',
    from: '前770年',
    to: '前476年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail4.png',
    content: `
    字长卿，春秋末期齐国乐安(今山东省北部)人 。中国春秋时期著名的军事家、政治家，尊称兵圣或孙子(孙武子)，又称“兵家至圣”，被誉为“百世兵家之师”、“东方兵学的鼻祖”。
    孙武大约活动于公元前六世纪末至前五世纪初，由齐至吴，经吴国重臣伍员(伍子胥)举荐，向吴王阖闾进呈所著兵法十三篇，受到重用为将。他曾率领吴国军队大败楚国军队，占领楚国都城郢城，几近覆亡楚国。`
  },
  '吴起': {
    name: '吴起',
    dynasty: '战国',
    from: '前440年',
    to: '前381年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/16.png',
    content: `
    姜姓，吴氏，名起，卫国左氏(今山东省定陶县西)人 。 战国初期军事家、政治家、改革家，兵家代表人物。
吴起早年学儒术于曾申门下，历仕鲁、魏、楚三国，通晓兵、法、儒三家思想，在内政及军事上都有极高的成就。在魏国，他指挥魏军屡次击败秦国，占领西河之地，任西河郡守。在楚国时，吴起被任命为令尹，辅佐楚悼王进行变法，增强国力，扩展了楚国的疆域。前381年，楚悼王逝世后，因变法得罪守旧贵族，吴起惨遭杀害。有《吴子兵法》传于世。`
  },
  '孙膑': {
    name: '孙膑',
    dynasty: '战国',
    from: '前440年',
    to: '前381年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/22.png',
    content: `
    其本名孙伯灵(山东孙氏族谱可查)，是中国战国时期军事家，华夏族。出生于阿、鄄之间(今山东省菏泽市鄄城县北)，是孙武的后代。
孙膑曾与庞涓为同窗，因受庞涓迫害遭受膑刑，身体残疾，后在齐国使者的帮助下投奔齐国，被齐威王任命为军师，辅佐齐国大将田忌两次击败庞涓，取得了桂陵之战和马陵之战的胜利，奠定了齐国的霸业。`
  },
  '张仪': {
    name: '张仪',
    dynasty: '战国',
    from: '前440年',
    to: '前381年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/5.png',
    content: `
    战国时期著名的纵横家、外交家和谋略家。
早年入于鬼谷子门下，学习纵横之术。出山之后，首创"连横"的外交策略，游说六国入秦。得到秦惠文王赏识，封为相国，奉命出使游说各国，以"横"破"纵"，促使各国亲善秦国，受封为武信君。公元前311年，秦惠文王死后，秦武王继位。张仪失去宠信，出逃魏国，担任相国。`
  },
  '苏秦': {
    name: '苏秦',
    dynasty: '战国',
    from: '？',
    to: '前284年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail5.png',
    content: `
    名秦，字季子，雒阳(今河南洛阳市)人。战国时期著名的纵横家、外交家和谋略家。
    早年投入鬼谷子门下，学习纵横之术。学成游历多年，潦倒而归。随后，刻苦攻读《阴符》，游说列国，得到燕文公赏识，出使赵国，提出"合纵"六国以抗秦的战略思想，并最终组建合纵联盟，任"从约长"，兼佩六国相印，使秦国十五年不敢出兵函谷关。联盟解散后，齐国攻打燕国，苏秦说齐归还燕国城池。后自燕至齐，从事反间活动，被齐国任为客卿，齐国众大夫因争宠派人刺杀，苏秦死前献策诛杀了刺客。`
  },
  '蔺相如': {
    name: '蔺相如',
    dynasty: '战国',
    from: '？',
    to: '前284年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/18.png',
    content: `
    战国时期赵国大臣，赵国著名的政治家、外交家。他最重要的有三个事件:完璧归赵、渑池之会与负荆请罪 。
蔺相如原为宦者令缪贤的舍人。赵惠文王时，秦昭王写信给赵王，愿以十五个城池换取"和氏璧"。蔺相如奉命带"和氏璧"来到秦国，据理力争，机智周旋，终于完璧归赵。公元前279年，秦王与赵王相会于渑池(今河南渑池西)，他随侍赵惠文王，当面斥责强大的秦国，不辱国体，使赵王没有受到屈辱，因其功，任为上卿，居官于廉颇之上。廉颇居功自恃，不服相如，耻居其下，并扬言要羞辱相如。蔺相如为保持将相和睦，不使外敌有隙可乘，始终回避忍让。蔺相如以国家利益为重、善自谦抑的精神感动了廉颇，于是亲自到蔺相如府上负荆请罪，二人成为刎颈之交。`
  },
  '廉颇': {
    name: '廉颇',
    dynasty: '战国',
    from: '？',
    to: '前284年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/24.png',
    content: `
    赵国苦陉（今定州邢邑）人。赵惠文王十六年（前283），廉颇领兵攻齐，大败齐军，官拜上卿。后屡次战胜齐、魏等国，以勇敢善战闻名于诸侯。渑池（今河南渑池县西）之会，秦王欲羞辱赵王，被蔺相如以大智大勇挫败，相如亦因此官拜上卿，地位高于廉颇。廉颇不服，多次欲欺辱相如，相如以国家利益为重，再-让，最终感动廉颇，亲自上门负荆请罪，将相和好，两人结为刎颈之交。公元前260年，秦、赵为争夺上党，在长平（今山西高平北）大战，廉颇统率大军，筑壁坚守，相持三年，秦军不能取胜。后赵王中秦人反间计，改用赵括为将，撤换廉颇。赵括只知纸上谈兵，招致惨败，除240名幼俘被释放外，其余降卒全部被活埋，此役赵军损失达40余万人。`
  },
  '田单': {
    name: '田单',
    dynasty: '战国',
    from: '？',
    to: '前284年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/19.png',
    content: `
    妫姓，田氏，名单，临淄(今山东省临淄区)人。战国时期齐国名将，齐国远房宗室。
初任市掾，管理临淄市场秩序。乐毅率领五国军队，攻打齐国。危亡之际，田单坚守即墨，以火牛阵大破燕军，收复失地七十余城，拜为相国，封为安平君。
后来，受到齐王猜忌，前往赵国出将入相，封号都平君，死后葬于安平城内。`
  },
  '乐毅': {
    name: '乐毅',
    dynasty: '战国',
    from: '？',
    to: '前284年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/25.png',
    content: `
    子姓，乐氏，名毅，字永霸。中山灵寿人，战国后期杰出的军事家、战略家，魏将乐羊后裔，拜燕上将军，受封昌国君，辅佐燕昭王振兴燕国。
公元前284年，他统帅燕国等五国联军攻打齐国，连下七十余城，创造了中国古代战争史上以弱胜强的著名战例，报了强齐伐燕之仇。后因受燕惠王的猜忌，无奈投奔赵国，被封于观津，号为望诸君。`
  },
  '孟尝君田文': {
    name: '田文',
    dynasty: '战国',
    from: '？',
    to: '前279年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/20.png',
    content: `
    妫姓，田氏，名文，“战国四公子”之一，战国时期齐国贵族，齐威王田因齐之孙，靖郭君田婴之子，齐宣王田辟疆之侄。因封袭其父爵于薛(今山东省滕州市官桥镇)，又称薛公，号孟尝君。
孟尝君依仗父亲留下的丰厚资产，在封地薛邑广招各国人才，门下有食客数千。秦昭王求贤若渴，听说孟尝君的名气，便想将他招揽到秦国来， 封为丞相，不久逃归。后为齐愍王相国。曾联合韩、魏击败楚、秦。齐愍王七年(前294年)因贵族田甲叛乱事，为愍王所疑，谢病归薛，不久出奔至魏，任相国。曾西合秦、赵与燕共伐破齐。齐襄王立，田文遂保持中立，不久复与莫联合相秦。死后诸子争立，领地薛为齐、魏共同攻灭。`
  },
  '平原君赵胜': {
    name: '赵胜',
    dynasty: '战国',
    from: '？',
    to: '前253年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/26.png',
    content: `
    名赵胜(?-前253年)，是中国东周战国时期赵国宗室大臣，赵武灵王之子，赵惠文王之弟，封于东武(今山东武城)，号平原君。在赵惠文王和赵孝成王时任相，是当时著名的政治家之一，以善于养士而闻名，门下食客曾多达数千人。和齐国孟尝君田文、魏国信陵君魏无忌、楚国春申君黄歇合称战国四公子。司马迁著《史记》，将平原君与虞卿合立《平原君虞卿列传》。`
  },
  '赵奢': {
    name: '赵奢',
    dynasty: '战国',
    from: '？',
    to: '前253年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/21.png',
    content: `
    战国后期赵国名将，战国时代东方六国八名将之一。
赵奢主要生活在赵武灵王、赵惠文王、赵孝成王时期，享年约60余岁。据《战国策·赵策》记载，赵奢曾对赵国平原君赵胜提过自己曾经亡命入燕，得到燕王信任，被任命为上谷守。`
  },
  '信陵君魏无忌': {
    name: '魏无忌',
    dynasty: '战国',
    from: '？',
    to: '前243年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/218.png',
    content: `
    即信陵君，魏国公子，与春申君黄歇、孟尝君田文、平原君赵胜并称为“战国四公子”。是战国时期魏国著名的军事家、政治家，魏昭王少子、魏安厘王的异母弟。公元前276年，被封于信陵(河南宁陵县)， 所以后世皆称其为信陵君。
魏无忌处于魏国走向衰落之时，他效仿孟尝君田文、平原君赵胜的辅政方法，延揽食客，养士数千人，自成势力。魏无忌礼贤下士、急人之困，曾在军事上两度击败秦军，分别挽救了赵国和魏国危局。但屡遭魏安厘王猜忌而未能予以重任。前243年，魏无忌因伤于酒色而死。十八年后，魏国为秦所灭。著有《魏公子兵法》。`
  },
  '春申君黄歇': {
    name: '黄歇',
    dynasty: '战国',
    from: '前314年',
    to: '前238年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/215.png',
    content: `
    嬴姓，黄氏，名歇，东周战国时期楚国公室大臣，是著名的政治家、军事家。与魏国信陵君魏无忌、赵国平原君赵胜、齐国孟尝君田文并称为“战国四公子”，曾任楚相。黄歇游学博闻，善辩。楚考烈王元年（前262），以黄歇为相，封为春申君。赐淮北地12县。
公元前238年，楚考烈王病逝，春申君在前去奔丧，李园令人埋伏于棘门之内，杀死春申君及其全家。又据《越绝书》表明春申君是在楚幽王之时为幽王所杀。`
  },
  '范雎': {
    name: '范雎',
    dynasty: '战国',
    from: '？',
    to: '前255年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/219.png',
    content: `
    字叔，魏国芮城(今山西省芮城县)人，战国时期著名政治家、纵横家、军事谋略家、战略家、外交家、秦国宰相，因封地在应城，所以又称为"应侯"。范雎辅佐秦昭襄王上承秦孝公、商鞅变法图强之志，下开秦始皇、李斯统一帝业。他是秦国历史上继往开来的一代名相。李斯曾高度评价范雎:"昭王得范雎，废穰侯，逐华阳，强公室，杜私门，蚕食诸侯，使秦成帝业。"
范雎本是魏国中大夫须贾门客，因被诬陷通齐卖魏，差点被魏国相国魏齐鞭笞致死，后在郑安平的帮助下，易名张禄，潜随秦国使者王稽入秦。
公元前271年，范雎见秦昭王之后，提出了远交近攻的策略，他主张将韩、魏、赵作为秦国兼并的主要目标，同时应该与齐国等保持良好关系，秦昭王拜范雎为客卿。前266年，他又提醒秦王，秦国的王权太弱，需要加强王权。秦昭王遂废太后，并将国内四大贵族赶出函谷关外，拜范雎为相。`
  },
  '白起': {
    name: '白起',
    dynasty: '战国',
    from: '？',
    to: '前257年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/216.png',
    content: `
    公孙起， 战国时期秦国郿县(今陕西省眉县常兴镇白家村)人，
出自芈姓。楚国白公胜后裔，唐代许多白氏墓志铭详言，其祖先是楚平王孙白公胜。《新唐书宰相世系表》所载白乙丙之说已考证为以误而错。中国战国时代军事家、秦国名将，兵家代表人物。
白起善于用兵，与来自楚国的秦宣太后异父同母的长弟-穰侯魏冉的关系很好。白起在秦昭王时征战六国，为秦国统一六国做出了巨大的贡献。曾在伊阕之战大破魏韩联军，攻陷楚国国都郢城，长平之战重创赵国主力，功勋赫赫。白起担任秦国将领30多年，攻城70馀座，歼灭近百万敌军，被封为武安君。`
  },
  '吕不韦': {
    name: '吕不韦',
    dynasty: '战国',
    from: '？',
    to: '前235年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/220.png',
    content: `
    名不韦，卫国濮阳(今河南省安阳市滑县)人。 战国末年卫国商人、政治家、思想家，后为秦国丞相，姜子牙的二十三世孙。
早年经商于阳翟，将秦国质子异人带回秦国，扶植其成为秦庄襄王后，被拜为相国，封文信侯，食邑河南洛阳十万户。带兵攻取周国、赵国、卫国土地，分别设立三川郡、太原郡、东郡，对秦王嬴政兼并六国的事业作出重大贡献。庄襄王去世后，迎立太子嬴政即位，拜为相邦，尊称"仲父"，权倾天下。受到嫪毐集团叛乱牵连，罢相归国，全家流放蜀郡，途中饮鸩自尽。
主持编纂《吕氏春秋》(又名《吕览》)，包含八览、六论、十二纪，汇合了先秦诸子各派学说，"兼儒墨，合名法"，史称"杂家"。`
  },
  '李牧': {
    name: '李牧',
    dynasty: '战国',
    from: '？',
    to: '前229年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/217.png',
    content: `
    嬴姓，李氏，名牧，战国时期赵国柏仁(今河北省邢台市隆尧县)人，战国时期的赵国名将、军事家，与白起、王翦、廉颇并称"战国四大名将"。 战国末期，李牧是赵国赖以支撑危局的唯一良将，素有"李牧死，赵国亡"之称。
李牧是战国末年东方六国最杰出的将领。 深得士兵和人民的爱戴，有着崇高的威望。李牧生平事迹大致可划分为两个阶段，先是在赵国北部边境，抗击匈奴;后以抵御秦国为主 ，因在宜安之战重创秦军，得到武安君的封号。公元前229年，赵王迁中了秦国的离间计，听信谗言夺取了李牧的兵权，不久后将李牧杀害。`
  },
  '王翦': {
    name: '王翦',
    dynasty: '战国',
    from: '？',
    to: '前236年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/221.png',
    content: `
    战国时期秦国名将、杰出的军事家。王翦年少的时候喜欢军事，随侍秦王嬴政。率军攻破赵国都城邯郸，扫平三晋地区，攻破燕国都城蓟，又消灭楚国。王翦与其子王贲成为秦始皇统一六国、开疆扩土的最大功臣。
统一中国后，急流勇退，没有辅佐秦始皇建立德政，巩固国家根基。和白起比较，可谓"尺有所短，寸有所长"。 凭借杰出的军事指挥才能，与白起、李牧、廉颇并称"战国四大名将"。后世尊王翦为琅琊王氏和太原王氏的共同始祖。`
  },
  '蒙恬': {
    name: '蒙恬',
    dynasty: '秦朝',
    from: '前221年',
    to: '前207年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail6.png',
    content: `姬姓，蒙氏，名恬，齐国蒙山（今山东省临沂市蒙阴县联城乡边家城子村）人 [24]  。秦朝时期名将，上卿蒙骜之孙，内史蒙武之子。
    出身名将世家，自幼胸怀大志。率军攻破齐国，拜为内史 ，深得秦始皇宠信。秦统一六国后，率领三十万大军北击匈奴，收复河南之地，威震匈奴，誉为“中华第一勇士”。中国西北最早的开发者，是古代开发宁夏第一人。监修万里长城和九州直道，克服了国内交通闭塞的困境，大大促进了北方各族人民经济、文化的交流和融合。曾经改良毛笔，被誉为“笔祖”。
    秦始皇去世后，中车令赵高、丞相李斯、公子胡亥暗中谋划政变，导致蒙恬吞药自杀。`
  },
  '扶苏': {
    name: '扶苏',
    dynasty: '秦朝',
    from: '前221年',
    to: '前207年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/30.png',
    content: `
    
    嬴姓，名扶苏，咸阳(今陕西省咸阳市)人。秦朝宗室大臣，秦始皇长子。
    刚毅勇武，信人而奋士。为人宽仁，有政治远见。直言劝谏父亲，反对坑杀"犯禁者四百六十余人"一事，触怒秦始皇。受命前往上郡，协助大将蒙恬修筑长城、抵御匈奴。
    秦始皇37年(公元前210年)，秦始皇病逝后，遗诏扶苏治丧即位。中车府令赵高联合丞相李斯，拥立始皇第十八子胡亥登基，矫诏逼令扶苏自尽，葬于上郡(今陕西省绥德县)。`
  },
  '李斯': {
    name: '李斯',
    dynasty: '秦朝',
    from: '前221年',
    to: '前207年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/31.png',
    content: `
    
    战国末楚国上蔡(今河南省上蔡县芦岗乡李斯楼村)人。 秦朝著名政治家、文学家和书法家。
    少为郡吏，曾从荀卿学。战国末年入秦国，初为秦相吕不韦舍人，被任命为郎。旋任长史，拜客卿。秦王政十年(前237)下逐客令时，上书力谏客不可逐，为秦王采纳。又为秦并六国谋划，建议先攻取韩国，再逐一消灭各诸侯国，完成统一大业。
    秦始皇二十六年(前221年)统一全国后，作为廷尉奉命与丞相王绾、御史大夫冯劫等议定"皇帝"之号。后任丞相，多次随始皇帝巡行。反对淳于越分封子弟之议，主张禁私学、废《诗》、《书》、六国史记及"百家语"。又以小篆为标准,整理文字，作《仓颉篇》以为范文。`
  },
  '蒙毅': {
    name: '蒙毅',
    dynasty: '秦朝',
    from: '？',
    to: '前210年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/28.png',
    content: `名将蒙骜之孙，蒙武之子，蒙恬之弟 ，秦朝大臣。蒙氏家族三代仕秦，攻城略地，出生入死，为秦始皇统一六国，立下汗马功劳。
    蒙毅、蒙恬兄弟二人一文一武，蒙恬管军事在外统兵，蒙毅掌朝政在内辅佐秦始皇，官拜上卿。蒙毅深受秦始皇的亲近，外出陪秦始皇同乘一车，居内则侍从秦始皇左右。
    秦二世继位后，蒙毅因遭中车府令赵高的谗言陷害，被秦二世囚禁杀害。`
  },
  '赵高': {
    name: '赵高',
    dynasty: '秦朝',
    from: '前221年',
    to: '前207年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/29.png',
    content: `
    
    嬴姓，赵氏。秦朝二世皇帝时丞相，任中车府令，兼行符玺令事，"管事二十余年"。秦始皇死后，赵高发动沙丘政变，他与丞相李斯合谋伪造诏书，逼秦始皇长子扶苏自杀，另立始皇幼子胡亥为帝，是为秦二世并自任郎中令。他在任职期间独揽大权，结党营私，征役更加繁重，行政更加苛暴。公元前208年又设计害死李斯，继之为秦朝丞相。第三年他迫秦二世自杀， 另立子婴为秦王。不久被子婴设计杀掉，诛夷三族。`
  },
  '章邯': {
    name: '章邯',
    dynasty: '秦朝',
    from: '？',
    to: '前205年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/32.png',
    content: `
    
    秦朝著名将领，上将军。秦二世时任少府，为秦朝的军事支柱，秦王朝最后一员大将。秦二世元年(前209)九月，受命率骊山刑徒及奴产子迎击陈胜起义军周文部，屡战屡胜。又陆续攻灭义军田臧等部于荥阳直逼陈，迫陈胜遁走。后攻杀反秦武装首领魏咎、田儋、项梁，移师渡河攻赵。巨鹿之战中被项羽击败，漳纡之战中再次被项羽击败而投降，随项羽入关。项羽分关中之地给秦人章邯、司马欣、董翳，分别为雍王、塞王、翟王，号称"三秦"。楚汉战争中，章邯在汉王元年(前206)八月，与刘邦军屡战不利，退保废丘(今陕西兴平东南)。汉王二年(前205年)六月，城破自杀。`
  },

  '张良': {
    name: '张良',
    dynasty: '西汉',
    from: '前207年',
    to: '8年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail7.png',
    content: `
    字子房，颍川城父(今河南郏县)人。 秦末汉初杰出谋臣，西汉开国功臣，政治家，与韩信、萧何并称为"汉初三杰"。
    张良先辈在韩国任过五代韩王之国相。力劝刘邦在鸿门宴上卑辞言和，保存实力，并疏通项羽季父项伯，使得刘邦顺利脱身。 凭借出色的智谋，协助汉王刘邦赢得楚汉战争，建立大汉王朝，帮助吕后之子刘盈成为皇太子，册封为留侯。
    张良精通黄老之道，不恋权位，晚年随赤松子云游四海，汉高后二年(前186年)去世，谥号文成。汉高祖刘邦曾在洛阳南宫评价他说:"夫运筹策帷帐之中，决胜于千里之外，吾不如子房。"`
  },
  '萧何': {
    name: '萧何',
    dynasty: '西汉',
    from: '前257年',
    to: '前193年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/33.png',
    content: `
    西汉政治家。沛（今江苏沛县）人。秦末随刘邦起义。刘邦攻取咸阳后，他收取律令图书，熟谙全国山川险要、郡县户口。楚汉战争时荐韩信为大将，镇守关中，不断给前线输送兵卒和粮饷，为刘邦战胜项羽创造了条件。西汉建立后，任丞相十四年，制定《汉律》九章。对建立和巩固西汉政权起了积极作用。`
  },
  '曹参': {
    name: '曹参',
    dynasty: '西汉',
    from: '？',
    to: '前190年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/38.png',
    content: `
    字敬伯 ，泗水郡沛县(今江苏省徐州市沛县)人 。西汉开国功臣、军事家、政治家，汉朝第二位相国，史称"曹相国"。
初仕秦朝，起家沛县狱掾。秦二世元年(公元前209年)，参加沛县起兵。身经百战，反秦灭楚，屡建战功， 攻下二国和一百二十二个县。刘邦定都长安后后，论功行赏，功居第二，赐爵平阳侯。出任齐国丞相，辅佐齐王刘肥。汉惠帝即位，继任萧何为相国，秉承"萧规曹随，休养生息"，为文景之治奠定了良好的物质和理论基础。`
  },
  '陈平': {
    name: '陈平',
    dynasty: '西汉',
    from: '？',
    to: '前178年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/39.png',
    content: `
    西汉王朝的开国功臣。阳武（今河南原阳东南）人，伟大的谋略家。少时喜读书，有大志，曾为乡里分肉，甚均，父老赞之，他感慨地说：“使平得宰天下，亦如此肉矣！”
秦二世元年（前209）陈胜、吴广起义后,六国贵族也纷纷起兵，陈平往事魏王咎。不久受谗亡归项羽,随从入关破秦。刘邦还定三秦时，又间行降汉。拜为都尉，使参乘、典护军。后历任亚将、护军中尉。先后参加楚汉战争和平定异姓王侯叛乱（见异姓诸侯王）诸役，成为汉高祖刘邦的重要谋士。刘邦困守荥阳时,陈平建议捐金数万斤,离间项羽群臣，使项羽的重要谋士范增忧愤病死。高帝六年（前201）又建议刘邦伪游云梦,逮捕韩信。次年，刘邦为匈奴困于平城（今山西大同北部）七天七夜，后采纳陈平计策,重贿冒顿单于的阏氏,才得以解围。陈平因功先后受封为户牖侯和曲逆侯。`
  },
  '贾谊': {
    name: '贾谊',
    dynasty: '西汉',
    from: '前200年',
    to: '前168年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/35.png',
    content: `
    汉族，洛阳(今河南省洛阳市)人，西汉初年著名政论家、文学家，世称贾生。贾谊少有才名，十八岁时，以善文为郡人所称。文帝时任博士，迁太中大夫，受大臣周勃、灌婴排挤，谪为长沙王太傅，故后世亦称贾长沙、贾太傅。三年后被召回长安，为梁怀王太傅。梁怀王坠马而死，贾谊深自歉疚，抑郁而亡，时仅三十三岁。司马迁对屈原、贾谊都寄予同情，为二人写了一篇合传，后世因而往往把贾谊与屈原并称为"屈贾"。`
  },
  '晁错': {
    name: '晁错',
    dynasty: '西汉',
    from: '前200年',
    to: '前154年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/40.png',
    content: `
    汉族，颍川(今河南禹州)人，西汉政治家、文学家。汉文帝时，任太常掌故，后历任太子舍人、博士、太子家令;景帝即位后，任为内史，后迁至御史大夫。
晁错发展了"重农抑商"政策，主张纳粟受爵，增加农业生产，振兴经济;在抵御匈奴侵边问题上，提出"移民实边"的战略思想，建议募民充实边塞，积极备御匈奴攻掠;政治上，进言削藩，剥夺诸侯王的政治特权以巩固中央集权，损害了诸侯利益，以吴王刘濞为首的七国诸侯以"请诛晁错，以清君侧"为名，举兵反叛。景帝听从袁盎之计，腰斩晁错于东市。`
  },
  '张骞': {
    name: '张骞',
    dynasty: '西汉',
    from: '前164年',
    to: '前114年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/36.png',
    content: `
    子文，汉中郡城固(今陕西省汉中市城固县)人，中国汉代杰出的外交家、旅行家、探险家，丝绸之路的开拓者，故里在陕西省汉中市城固县城南2千米处汉江之滨的博望村。
张骞富有开拓和冒险精神，建元二年(前139年)，奉汉武帝之命，由甘父做向导，率领一百多人出使西域，打通了汉朝通往西域的南北道路，即赫赫有名的丝绸之路，汉武帝以军功封其为博望侯。史学家司马迁称赞张骞出使西域为“凿空”，意思是“开通大道”。
张骞被誉为伟大的外交家、探险家，是“丝绸之路的开拓者”、“第一个睁开眼睛看世界的中国人”、“东方的哥伦布” 。他将中原文明传播至西域，又从西域诸国引进了汗血马、葡萄、苜蓿、石榴、胡麻等物种到中原，促进了东西方文明的交流。`
  },
  '东方朔': {
    name: '东方朔',
    dynasty: '西汉',
    from: '前161年',
    to: '前93年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/41.png',
    content: `
    字曼倩，平原郡厌次县人， 西汉时期著名文学家。
汉武帝即位，征辟四方士人。东方朔上书自荐，拜为郎。后任常侍郎中、太中大夫等职。性格诙谐，言词敏捷，滑稽多智，常在汉武帝面前谈笑取乐，曾言政治得失，上陈"农战强国"之计。汉武帝始终视为俳优之言，不以采用。`
  },
  '霍光': {
    name: '霍光',
    dynasty: '西汉',
    from: '？',
    to: '前68年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/37.png',
    content: `
    字子孟。河东平阳(今山西临汾)人。西汉权臣、政治家，麒麟阁十一功臣之首，大司马霍去病异母弟、汉昭帝皇后上官氏的外祖父、汉宣帝皇后霍成君之父。
霍光身高七尺三寸，皮肤白皙，眉目疏朗，胡须很美，是当时有名的美男子。历经汉武帝、汉昭帝、汉宣帝三朝，官至大司马大将军。期间曾主持废立昌邑王刘贺。汉宣帝地节二年(前68年)，霍光去世，谥号“宣成” 。两年后，霍家因谋反被族诛。
`
  },
  '班超': {
    name: '班超',
    dynasty: '东汉',
    from: '24年',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail8.png',
    content: `
    字仲升，扶风郡平陵县(今陕西咸阳东北)人。东汉时期著名军事家、外交家，史学家班彪的幼子，其长兄班固、妹妹班昭也是著名史学家。
    班超为人有大志，不修细节，但内心孝敬恭谨，审察事理。他口齿辩给，博览群书。不甘于为官府抄写文书，投笔从戎，随窦固出击北匈奴，又奉命出使西域，在三十一年的时间里，平定了西域五十多个国家，为西域回归、促进民族融合，做出了巨大贡献。官至西域都护，封定远侯，世称"班定远"。`
  },
  '马援': {
    name: '马援',
    dynasty: '东汉',
    from: '前14年',
    to: '49年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/42.png',
    content: `
    字文渊，扶风茂陵（今陕西兴平东北）人，东汉时期著名的军事家。汉光武帝时，拜为伏波将军，封新息侯，世称“马伏波”。马援一生东征西讨，为东汉王朝的建立和巩固立下了赫赫战功。其“马革裹尸”和“老当益壮”的慷慨名言也成为后世的楷模。`
  },
  '班固': {
    name: '班固',
    dynasty: '东汉',
    from: '32年',
    to: '92年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/45.png',
    content: `
    字孟坚，扶风安陵(今陕西咸阳东北)人，东汉著名史学家、文学家。班固出身儒学世家，其父班彪、伯父班嗣，皆为当时著名学者。在父祖的熏陶下，班固九岁即能属文，诵诗赋，十六岁入太学，博览群书，于儒家经典及历史无不精通。
建武三十年(54年)，班彪过世，班固从京城洛阳迁回老家居住，开始在班彪《史记后传》的基础上，撰写《汉书》，前后历时二十余年，于建初中基本修成。汉和帝永元元年(89年)，大将军窦宪率军北伐匈奴，班固随军出征，任中护军，行中郎将，参议军机大事，大败北单于后撰下著名的《封燕然山铭》。后窦宪因擅权被杀，班固受株连，死于狱中，时年六十一岁。`
  },
  '张衡': {
    name: '张衡',
    dynasty: '东汉',
    from: '78年',
    to: '139年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/46.png',
    content: `
    字平子，南阳郡西鄂县(今河南省南阳市石桥镇)人 。东汉时期杰出的天文学家、数学家、发明家、地理学家、文学家。举孝廉出身，历任郎中、太史令、侍中、河间相等职。晚年因病，入朝担任尚书。永和四年(139年)，逝世，享年六十二岁。北宋时，获封西鄂县伯。
张衡在天文学方面著有《灵宪》《浑仪图注》等;数学著作有《算罔论》;文学作品以《二京赋》《归田赋》等为代表，与司马相如、扬雄、班固并称"汉赋四大家"。
张衡为中国天文学、机械技术、地震学的发展作出了杰出的贡献，发明了浑天仪、地动仪，是东汉中期浑天说的代表人物之一，后人誉为"木圣" (科圣)，由于他的贡献突出，联合国天文组织将月球背面的一个环形山命名为"张衡环形山"，太阳系中的1802号小行星命名为"张衡星"。后人为纪念张衡，在南阳修建了张衡博物馆。`
  },
  '董卓': {
    name: '董卓',
    dynasty: '东汉',
    from: '？',
    to: '192年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/44.png',
    content: `
    字仲颖，凉州陇西临洮（今甘肃岷县）人，东汉末年军阀和权臣，其种种的暴行使之成为中国历史上总体评价极其负面的人物之一。
董卓于桓帝末年先后担任并州刺史，利用汉末战乱和朝廷势弱占据京城，废立挟持汉献帝，东汉政权从此名存实亡。他生性凶残，犯下诸多罪行，引致全国其它割据军阀发动董卓讨伐战，董卓本人则被朝内大臣联合其部下设计诛杀，死后部下李傕和郭汜两人为了把持朝政互相火拼，皇帝与朝廷流离失所，各地州牧、刺史、太守、占据属地完全脱离中央控制，开启三国时代。`
  },
  '王允': {
    name: '王允',
    dynasty: '东汉',
    from: '137年',
    to: '192年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/47.png',
    content: `
    字子师，太原祁县(今山西祁县)人。东汉末年时期大臣。出身太原王氏，世代官宦。举孝廉出身，司徒高第征为侍御史。出任豫州刺史，勤政爱民。斗争中常侍张让失败后，去官隐居。中平六年，大将军何进掌权之后，辟王允为从事中郎，迁河南尹。董卓拥立汉献帝即位后，王允代替杨彪，拜太仆、尚书令、司徒，密谋刺死董卓，联合吕布共同执政，日益骄傲自满。
初平三年(192年)，董卓余党李傕、郭汜、樊稠等攻破长安。王允兵败而被处死，时年五十六岁。
`
  },
  '诸葛亮': {
    name: '诸葛亮',
    dynasty: '三国',
    from: '220年',
    to: '265年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail9.png',
    content: `
    字孔明，号卧龙（也作伏龙），汉族，徐州琅琊阳都（今山东临沂市沂南县）人，三国时期蜀汉丞相，杰出的政治家、军事家、散文家、书法家、发明家。在世时被封为武乡侯，死后追谥忠武侯，东晋政权因其军事才能特追封他为武兴王。其散文代表作有《出师表》、《诫子书》等。曾发明木牛流马、孔明灯等，并改造连弩，叫做诸葛连弩，可一弩十矢俱发。于建兴十二年（234年）在五丈原（今宝鸡岐山境内）逝世。
刘禅追谥其为忠武侯，故后世常以武侯、诸葛武侯尊称诸葛亮。诸葛亮一生鞠躬尽瘁、死而后已，是中国传统文化中忠臣与智者的代表人物。`
  },
  '钟会': {
    name: '钟会',
    dynasty: '三国',
    from: '225年',
    to: '264年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/203.png',
    content: `字士季，颍川长社(今河南省长葛市)人。三国时期魏国军事家、书法家，太傅钟繇幼子、青州刺史钟毓之弟。
    出身颍川钟氏，才华横溢，精通玄学。弱冠入仕，历任要职。深得魏帝和群臣赏识。随从司马师征讨毋丘俭，典知机密。献策于司马昭，粉碎曹髦的夺权企图。随军平定诸葛诞叛乱，屡出奇谋，时人比之为张良。累拜司隶校尉，插手朝廷大小事务及官员任免。
    景元年间，力挺司马昭伐蜀计划，拜镇西将军、假节、都督关中诸军事，主持伐蜀事宜。景元四年(263年)，魏灭蜀之战中，配合邓艾分兵进取，最终灭亡蜀汉。拜司徒，封县侯。功成之后，萌生不臣之心，勾结蜀将姜维，图谋据蜀自立，打压太尉邓艾。景元五年(264年)正月，以郭太后遗命之名，矫诏讨伐司马昭，为部将胡烈所害，死于乱军，时年四十岁。`
  },
  '孙坚': {
    name: '孙坚',
    dynasty: '三国',
    from: '155年',
    to: '191年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/48.png',
    content: `
    字文台，汉族，吴郡富春（今浙江省杭州市富阳区）人。东汉末年将领、军阀，东吴政权的奠基人之一。据传为春秋时期军事家孙武的后裔。 
史书说他“容貌不凡，性阔达，好奇节”。曾参与讨伐黄巾军的战役以及讨伐董卓的战役。后与刘表作战时阵亡。因官至破虏将军，又称“孙破虏”。其子孙权即为孙吴的开国皇帝。孙权称帝后，追谥孙坚为武烈皇帝，庙号始祖。`
  },
  '典韦': {
    name: '典韦',
    dynasty: '三国',
    from: '?',
    to: '197年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/54.png',
    content: `
    陈留己吾(今河南商丘市宁陵县己吾城村)人。东汉末年名将。典韦相貌魁梧，膂力过人。本属张邈，曾单手举起牙门旗。后转投曹操，在曹操征讨吕布时被募为陷阵，表现英勇，被拜为校尉，宿卫曹操。建安二年(197年)，张绣背叛曹操，典韦为保护曹操而率十余人挡叛军，击杀多人，但最终因寡不敌众而战死。
典韦武艺卓越，被史学家潘眉评价为:雄武壮烈，不在张辽、许褚之下。`
  },
  '孙策': {
    name: '孙策',
    dynasty: '三国',
    from: '175年',
    to: '200年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/49.png',
    content: `
    字伯符，吴郡富春（今浙江富阳）人。孙坚长子，孙权长兄。东汉末年割据江东一带的军阀，汉末群雄之一，三国时期孙吴的奠基者之一。《三国演义》中绰号“小霸王”。
为继承父亲孙坚的遗业而屈事袁术，后脱离袁术，统一江东。在一次狩猎中为刺客所伤，不久后身亡，年仅二十六岁。其弟孙权接掌孙策势力，并于称帝后，追谥孙策为长沙桓王。`
  },
  '吕布': {
    name: '吕布',
    dynasty: '三国',
    from: '?',
    to: '199年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/59.png',
    content: `
    字奉先，五原郡九原县人（今内蒙古包头九原区），东汉末年名将，汉末群雄之一。先后为丁原、董卓的部将，后与司徒王允合力诛杀董卓，旋即被董卓旧部李傕等击败，依附袁绍。与曹操争夺兖州失败后，吕布袭取徐州，割据一方。建安三年十二月（199年2月）吕布于下邳被曹操击败并处死。
由于《三国演义》及各种民间艺术的演绎，吕布向来是以“三国第一猛将”的形象存在于人们的心目之中。`
  },
  '袁绍': {
    name: '袁绍',
    dynasty: '三国',
    from: '?',
    to: '202年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/55.png',
    content: `
    字本初，汝南汝阳(今河南省商水县)人。东汉末年军阀，汉末群雄之一，司空袁逢的儿子。袁绍出身"汝南袁氏"，四世三公。料。起家大将军(何进)掾，历任中军校尉、司隶校尉，参与指挥诛杀宦官。怒斥董卓，出任渤海太守，册封邟乡侯。初平元年(190年)，担任关东联军首领，带兵讨伐董卓，自号车骑将军。励精图治，先后占据冀州、青州、并州、幽州地区，统一河北地区，交好北方少数民族，势力达到顶点。建安五年(200年)，发动官渡之战，兵败于曹操。
建安七年(202年)，平定冀州叛乱之后，病逝于家中。`
  },
  '太史慈': {
    name: '太史慈',
    dynasty: '三国',
    from: '166年',
    to: '206年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/60.png',
    content: `
    字子义，东莱黄县(今山东龙口东黄城集)人。东汉末年武将，官至建昌都尉。弓马熟练，箭法精良。原为刘繇部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。孙权统事后，因太史慈能制刘磐，便将管理南方的要务委托给他。建安十一年(206年)太史慈逝世，死前说道:"丈夫生世，当带三尺之剑，以升天子之阶。今所志未从，奈何而死乎!"(《吴书》，《三国演义》为"大丈夫生于乱世，当带三尺剑立不世之功;今所志未遂，奈何死乎!")言讫而亡，年四十一岁。`
  },
  '刘表': {
    name: '刘表',
    dynasty: '三国',
    from: '142年',
    to: '208年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/50.png',
    content: `
    字景升，山阳郡高平县(今山东微山 )人。东汉末年宗室、名士、军阀，汉末群雄之一，西汉鲁恭王刘余之后 。
刘表身长八尺余，姿貌温厚伟壮，少时知名于世，名列"八俊"。早年因参与太学生运动而受党锢之祸牵连，被迫逃亡，光和七年(184年)，党禁解除，被大将军何进辟为掾，出任北军中候。后代王睿为荆州刺史，用蒯氏兄弟、蔡瑁等人为辅。李傕等入长安，刘表遣使奉贡，被任命为镇南将军、荆州牧、假节，封成武侯。在荆州期间，刘表恩威并著，招诱有方，使得万里肃清、群民悦服。又开经立学，爱民养士，从容自保。远交袁绍，近结张绣，内纳刘备，据地数千里，带甲十余万，称雄荆江，先杀孙坚，后又常抗曹操。然而刘表为人性多疑忌，好于坐谈，立意自守，而无四方之志，后更宠溺后妻蔡氏，使妻族蔡瑁等得权。
建安十三年(208年)，刘表病逝。蔡瑁等人废长立幼，奉表次子刘琮为主;曹操南征，刘琮举州投降，荆州遂没。`
  },
  '周瑜': {
    name: '周瑜',
    dynasty: '三国',
    from: '175年',
    to: '210年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/56.png',
    content: `
    字公瑾，东汉末年名将，庐江舒县人 。洛阳令周异之子，堂祖父周景、堂叔周忠，都官至太尉。长壮有姿貌、精音律，江东有"曲有误，周郎顾"之语。周瑜少与孙策交好，21岁起随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事。建安十三年 (208年)，周瑜率江东孙氏集团军队与刘备军队联合，赤壁之战大败曹军，由此奠定了三分天下的基础。建安十四年(209年)，拜偏将军领南郡太守。建安十五年(公元210年)病逝于巴丘(今湖南岳阳)，年仅36岁。
正史上周瑜"性度恢廓""实奇才也"，范成大誉之为"世间豪杰英雄士、江左风流美丈夫"。宋徽宗时追尊其为平虏伯。位列唐武庙六十四将、宋武庙七十二将之一。`
  },
  '黄盖': {
    name: '黄盖',
    dynasty: '三国',
    from: '?',
    to: '199年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/61.png',
    content: `
    字公覆，零陵泉陵(今湖南省永州市零陵区)人。东汉末年名将，历仕孙坚、孙策、孙权三任，为人严肃，善于训练士卒，每每征讨，他的部队皆勇猛善战。早年为郡吏，后追随孙坚走南闯北。孙坚遇难后，黄盖跟随孙策、孙权"擐甲周旋，蹈刃屠城"。诸山越不宾，黄盖活跃在镇抚山越的一线，前后九县，所在悉平，迁丹杨都尉。
建安十三年(208年)赤壁之战时，黄盖前往曹营诈降，并趁机以火攻大破曹操的军队，是赤壁之战主要功臣之一，以功拜武锋中郎将，他也因为此事迹而被后人广为传颂，罗贯中长篇小说《三国演义》在刻画黄盖这一人物时描写了"苦肉计"的故事。不久武陵蛮夷反，攻打城邑，黄盖以五百人，放其半入，拦腰截击，大破诸贼。春去夏来，寇乱尽平。后又平讨长沙益阳县山贼，加偏将军。官至偏将军、武陵太守。有一子黄柄。`
  },
  '荀彧': {
    name: '荀彧',
    dynasty: '三国',
    from: '163年',
    to: '212年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/51.png',
    content: `
    字文若。颍川郡颍阴县(今河南许昌)人。东汉末年政治家、战略家，曹操统一北方的首席谋臣和功臣。荀彧早年被称为"王佐之才"，举孝廉出身，任守宫令。董卓执政后弃官归乡，率领宗族避难冀州，被袁绍待为上宾。后投奔曹操，官至侍中、守尚书令，封万岁亭侯，居中持重达十数年，处理军国事务，被人敬称为"荀令君"。后因反对曹操称魏公，被调离中枢，于寿春忧郁而亡(一说服毒自尽)，享年五十岁。获谥为"敬"。魏咸熙二年(265年)被赠为太尉。
荀彧在战略方面为曹操规划制定了统一北方的蓝图和军事路线，多次修正曹操的战略方针而获其赞赏，包括"深根固本以制天下"、"迎奉天子";战术上，面对吕布叛乱而保全兖州三城，奇谋扼制袁绍于官渡，险出宛、叶而间行轻进以掩其不意奇袭荆州等诸多建树;政治上，为曹操举荐了钟繇、荀攸、陈群、杜袭、戏志才、郭嘉等大量人才。荀彧在建计、密谋、匡弼、举人等方面多有建树，被曹操称为"吾之子房" 。
`
  },
  '荀攸': {
    name: '荀攸',
    dynasty: '三国',
    from: '157年',
    to: '214年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/57.png',
    content: `
    字公达，颍川颍阴（今河南许昌）人。荀彧之侄，东汉末年谋士。 荀攸在何进掌权时期任黄门侍郎，在董卓进京时曾因密谋刺杀董卓而入狱，后弃官回家。 曹操迎天子入许都之后，荀攸成为曹操的军师。 曹操征伐吕布时荀攸劝阻了曹操退兵，并献奇计水淹下邳城，活捉吕布。官渡之战荀攸献计声东击西，斩杀颜良和文丑。又策奇兵，派徐晃烧袁绍粮草，同时力主曹操接纳许攸，画策乌巢，立下大功。平定河北期间，荀攸力排众议，主张曹操消灭袁绍诸子，被曹操上奏朝廷封为陵树亭侯。荀攸行事周密低调，计谋百出，深受曹操称赞。建安十九年（214年），荀攸在曹操伐吴途中去世。 
荀攸被称为曹操的“谋主”，擅长灵活多变的克敌战术和军事策略。他生前设奇策共十二计，只有钟繇知道。钟繇整理未全就去世了，故后世不得而知。`
  },
  '鲁肃': {
    name: '鲁肃',
    dynasty: '三国',
    from: '172年',
    to: '217年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/62.png',
    content: `
    字子敬，汉族，临淮郡东城县（今安徽定远）人，中国东汉末年杰出战略家、外交家。出生于一士族家庭；幼年丧父，由祖母抚养长大。他体貌魁伟，性格豪爽，喜读书、好骑射。东汉末年，他眼见朝廷昏庸，官吏腐败，社会动荡，常召集乡里青少年练兵习武。他还仗义疏财，深得乡人敬慕。当时，周瑜为居巢长，因缺粮向鲁肃求助，鲁肃将一仓三千斛粮食慷慨赠给周瑜。从此，二人结为好友，共谋大事。
建安二年，鲁肃率领部属投奔孙权，为其提出鼎足江东的战略规划，因此得到孙权的赏识。建安十三年，曹操率大军南下。孙权部下多主降，而鲁肃与周瑜力排众议，坚决主战。结果，孙、刘联军大败曹军于赤壁，从此，奠定了三国鼎立格局。 
赤壁大战后，鲁肃被任命为赞军校尉。周瑜逝世后，孙权采纳周瑜生前建议，令鲁肃代周瑜职务领兵四千人，因鲁肃治军有方，军队很快发展到万余人。孙权根据当时政治军事形势需要，又任命鲁肃为汉昌太守，授偏将军；鲁肃随从孙权破皖城后，被授为横江将军，守陆口。此后鲁肃为索取荆州而邀荆州守将关羽相见，然而却无功而返。建安二十二年，鲁肃去世，终年46岁，孙权亲自为鲁肃发丧，诸葛亮亦为其发哀。`
  },
  '夏侯渊': {
    name: '夏侯渊',
    dynasty: '三国',
    from: '?',
    to: '219年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/52.png',
    content: `
    字妙才，沛国谯县(今安徽亳州市谯城区)人。东汉末年名将，太仆夏侯婴后代。
夏侯渊早年跟随曹操征伐四方，先后任骑都尉和陈留、颍川二郡太守。参加官渡之战，负责督运粮草。擅长千里奔袭，作战出其不意，先后平定昌豨、徐和、雷绪、商曜等叛乱。渭南之战后，夏侯渊率军剿灭关陇地区的韩遂余部以及羌、氐部落，威震关右地区。凭借功勋，累迁征西将军，受封博昌亭侯。张鲁投降曹操后，夏侯渊负责镇守汉中。建安二十四年，刘备率军进攻汉中，夏侯渊被黄忠袭杀。死后谥号为愍 ，配享太祖(曹操)庙庭。`
  },
  '关羽': {
    name: '关羽',
    dynasty: '三国',
    from: '161年',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/58.png',
    content: `
    字云长，河东解良（今山西运城）人，东汉末年蜀国名将。
早期跟随刘备辗转各地，曾被曹操生擒，于白马坡斩杀袁绍大将颜良，与张飞一同被称为万人敌。赤壁之战后，刘备助东吴周瑜攻打南郡曹仁，别遣关羽绝北道，阻挡曹操援军，曹仁退走后，关羽被封为襄阳太守。刘备入益州，关羽留守荆州。建安二十四年，关羽围襄樊，曹操派于禁前来增援，关羽擒获于禁，斩杀庞德，威震华夏，曹操曾想迁都以避其锐。后曹操派徐晃前来增援，东吴吕蒙又偷袭荆州，关羽腹背受敌，兵败被杀。
关羽去世后，逐渐被神化，被民间尊为“关公”，又称美髯公。历代朝廷多有褒封，清代奉为“忠义神武灵佑仁勇威显关圣大帝”，崇为“武圣”，与“文圣” 孔子齐名。`
  },
  '吕蒙': {
    name: '吕蒙',
    dynasty: '三国',
    from: '179年',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/63.png',
    content: `
    字子明，汝南郡富陂县(今安徽省阜南县王化镇吕家岗)人。东汉末年名将。
早年依附姊夫邓当，跟随孙策征战，以胆气著称。邓当死后，吕蒙统领其部众，拜别部司马。孙权统事后，吕蒙渐受重用，从破黄祖作先登，封横野中郎将。从破曹仁于南郡，从破朱光于皖城，累功拜庐江太守。进占荆州南部三郡，并计擒郝普。在逍遥津之战掩护孙权逃生。在濡须抵御魏军。官拜左护军、虎威将军。鲁肃去世后，吕蒙代守陆口，袭取荆州西部三郡，彻底击败蜀汉名将关羽，拜南郡太守，封孱陵侯，受勋殊隆。建安二十四年(219年)的年末(220年初)，因病去世，享年四十二岁。`
  },
  '黄忠': {
    name: '黄忠',
    dynasty: '三国',
    from: '?',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/53.png',
    content: `
    字汉升(一作"汉叔" )，南阳(今河南南阳)人。东汉末年名将。
本为刘表部下中郎将，后归刘备，并助刘备攻破益州刘璋。建安二十四年(219年)，定军山之战中，黄忠阵斩曹操部下名将夏侯渊，拜征西将军。刘备称汉中王后，加封后将军，赐关内侯。次年，黄忠病逝。景耀三年(260年)，追谥为刚侯。
黄忠在后世多以勇猛的老将形象出现于各类文学艺术作品中。《三国演义》里，刘备称汉中王后，将其封为"五虎上将"之一，而黄忠的名字在中国也逐渐成为了老当益壮的代名词。`
  },
  '夏侯惇': {
    name: '夏侯惇',
    dynasty: '三国',
    from: '?',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/205.png',
    content: `
    字元让，沛国谯县(今安徽省亳州市)人。汉末三国时期曹魏名将，西汉开国元勋夏侯婴的后代。少年时以勇气闻名于乡里。曹操起兵，夏侯惇是其最早的将领之一。与吕布军交战时，曾一度被擒为人质，又被流矢射瞎左眼。多次为曹操镇守后方，曾率军民阻断太寿河水，筑陂塘灌溉农田，使百姓受益，功勋卓著。官至大将军，封高安乡侯。追谥忠侯(《史记·谥法解》云:"危身奉上曰忠。险不辞难。")。青龙元年(233年)，得以配享太祖(曹操)庙庭。
夏侯惇一生多在军旅，仍不忘治学。他常亲自迎师，虚心求教。他为人俭朴，所得赏赐全部分给将士。一生不置产业，至死家无余财。`
  },
  '甘宁': {
    name: '甘宁',
    dynasty: '三国',
    from: '?',
    to: '220年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/210.png',
    content: `
    字兴霸，巴郡临江（今重庆忠县）人，三国时期孙吴名将，官至西陵太守，折冲将军。 少年时好游侠，纠集人马，持弓弩，在地方上为非作歹，组成渠师抢夺船只财物，人称锦帆贼。青年时停止抢劫，熟读诸子。曾任蜀郡丞，后历仕于刘表和黄祖麾下，未受重用。 
建安十三年（208年），甘宁率部投奔孙权，开始建功立业。先后随孙权破黄祖据楚关，随周瑜攻曹仁取夷陵，随鲁肃镇益阳拒关羽，守西陵、擒朱光，率百余人夜袭曹营，战功赫赫。孙权曾说：“孟德有张辽，孤有甘兴霸，足相敌也。”他为人仗义疏财，深得士卒拥戴，被陈寿盛赞为“江表之虎臣”。`
  },
  '张飞': {
    name: '张飞',
    dynasty: '三国',
    from: '?',
    to: '221年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/200.png',
    content: `
    字益德，涿郡(今河北保定涿州市)人，三国时期蜀汉名将。张飞勇武过人，与结拜兄弟关羽并称为"万人敌"。关羽年长数岁，张飞兄事之。公元184年黄巾起义爆发，刘备在涿县组织起了一支义勇军参与扑灭黄巾军的战争，张飞与关羽一起加入，随刘备辗转各地。三人情同兄弟，寝则同床，刘备出席各种宴会时，和关羽终日侍立在刘备身旁。公元196年因交恶曹豹而被吕布所破。吕布败亡之后，张飞被任命为中郎将。公元200年刘备衣带诏事情泄漏，率领关羽、张飞逃走，杀徐州刺史车胄。后刘备战败，关羽被擒，刘备与张飞投奔袁绍。公元208年刘备于长坂坡败退时，张飞仅率二十骑断后，据当阳桥厉声大喝，曹军无人敢逼近，刘备因此得以免难。
刘备入蜀后，张飞与诸葛亮、赵云进军西川，分定郡县。在抵达江州时义释了刘璋手下的巴郡太守严颜。在巴西之战中，击败魏国名将张郃。在武都之战中，兵败而还。刘备称帝后，张飞晋升为车骑将军、领司隶校尉，封西乡侯。同年，张飞因为暴而无恩，被部将范强、张达杀害。谥曰桓侯。`
  },
  '马超': {
    name: '马超',
    dynasty: '三国',
    from: '176年',
    to: '222年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/206.png',
    content: `
    字孟起，扶风茂陵(今陕西省兴平市)人，汉伏波将军马援的后人，马腾的儿子，少年成名，曹操曾多次征召马超入京为官，但都被马超拒绝。而后马腾入京被封为卫尉，马超就统领了马腾的部队。
建安十六年(211年)，曹操治兵关中，马超联合关中诸侯韩遂等抵抗曹操，曾一度对曹操造成了极大的威胁，但被曹操用离间计击败退走，而后聚拢部队再次攻取陇上诸郡，失败后依附汉中张鲁。刘备攻打刘璋时，马超投降刘备，与刘备军合围成都，汉中之战后联名上书尊刘备为汉中王。蜀汉建立后，马超官至骠骑将军、斄乡侯。
章武二年(222年)，马超病逝，享年四十七岁，刘禅时期被追谥为威侯。有一女嫁于安平王刘理。有剑术"出手法"流传后世。`
  },
  '张辽': {
    name: '张辽',
    dynasty: '三国',
    from: '169年',
    to: '222年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/211.png',
    content: `
    字文远，雁门马邑（今山西朔州）人。三国时期曹魏著名将领。曾从属丁原、董卓、吕布。下邳之战后，归顺曹操。此后随曹操征讨，战功累累。与关羽同解白马围，降昌豨于东海，攻袁尚于邺城，率先锋在白狼山斩杀乌桓单于蹋顿，又讨平辽东柳毅、淮南梅成、陈兰等。 
濡须之战后，曹操任命张辽、李典、乐进等守合肥。张辽多次击退孙吴进攻，在建安二十年（215年）的合肥之战，张辽率800将士冲击孙权的十万大军，打到了孙权的主帅旗下，令孙权闻风丧胆，吴军披靡溃败。后以七千之众大破十万大军，差点活捉孙权。经此一役，张辽威震江东，声名大噪，“张辽止啼”也成为民间流传的传奇典故。张辽为历代推崇，并成为古今六十四名将之一。 曹丕登基后，仍令张辽守御孙权。黄初二年（221年），张辽屯驻雍丘，染病。张辽大病期间，孙权依旧对其非常忌惮。黄初三年（222年），张辽不负众望，抱病击破吴将吕范。同年在江都病逝，谥刚侯，享年五十四岁。陈寿撰写三国志时，称他为“五子良将”。`
  },
  '贾诩': {
    name: '贾诩',
    dynasty: '三国',
    from: '147年',
    to: '223年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/201.png',
    content: `
    字文和，凉州姑臧（今甘肃武威市凉州区）人。东汉末年至三国初年著名谋士、军事战略家，曹魏开国功臣。原为董卓部将，董卓死后，献计李傕、郭汜反攻长安。李傕等人失败后，辗转成为张绣的谋士。张绣曾用他的计策两次打败曹操，官渡之战前他劝张绣归降曹操。 
官渡之战时，贾诩力主与袁绍决战。赤壁之战前，认为应安抚百姓而不应劳师动众讨江东，曹操不听，结果受到严重的挫败。曹操与关中联军相持渭南时，贾诩献离间计瓦解马超、韩遂，使得曹操一举平定关中。 
在曹操继承人的确定上，贾诩以袁绍、刘表为例，暗示曹操不可废长立幼，从而暗助了曹丕成为世子。黄初元年（220年），曹丕称帝，拜其为太尉，封魏寿乡侯。曹丕曾问贾诩应先灭蜀还是吴，贾诩建议应先治理好国家再动武，曹丕不听，果然征吴无功而返。`
  },
  '赵云': {
    name: '赵云',
    dynasty: '三国',
    from: '?',
    to: '229年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/207.png',
    content: `
    字子龙，常山真定（今河北省正定）人。身长八尺，姿颜雄伟，蜀汉名将之一。
汉末军阀混战，赵云受本郡推举，率领义从加入白马将军公孙瓒。期间结识了汉室皇亲刘备，但不久之后，赵云因为兄长去世而离开。赵云离开公孙瓒大约七年左右的时间，在邺城与刘备相见，从此追随刘备。 赵云跟随刘备将近三十年，先后参加过博望坡之战、长坂坡之战、江南平定战，独自指挥过入川之战、汉水之战、箕谷之战，都取得了非常好的战果。除了四处征战，赵云还先后以偏将军任桂阳太守，以留营司马留守公安，以翊军将军督江州。 除此，赵云于平定益州时引霍去病故事劝谏刘备将田宅归还百姓，又于关羽张飞被害之后劝谏刘备不要伐吴。赵云死后，刘禅又下令追谥赵云，姜维以“柔贤慈惠曰顺，执事有班曰平，克定祸乱曰平”追谥赵云为顺平侯。`
  },
  '曹植': {
    name: '曹植',
    dynasty: '三国',
    from: '192年',
    to: '232年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/212.png',
    content: `
    字子建，沛国谯（今安徽省亳州市）人，出生于东阳武，是曹操与武宣卞皇后所生第三子，生前曾为陈王，去世后谥号“思”，因此又称陈思王。
曹植是三国时期曹魏著名文学家，建安文学的代表人物。其代表作有《洛神赋》、《白马篇》《七哀诗》等。后人因其文学上的造诣而将他与曹操、曹丕合称为“三曹”。其诗以笔力雄健和词采画眉见长，留有集三十卷，已佚，今存《曹子建集》为宋人所编。曹植的散文同样也具有“情兼雅怨，体被文质”的特色，加上其品种的丰富多样，使他在这方面也取得了卓越的成就。南朝宋文学家谢灵运有“天下才有一石，曹子建独占八斗”的评价。《诗品》的作者钟嵘亦赞曹植“骨气奇高，词彩华茂，情兼雅怨，体被文质，粲溢今古，卓尔不群。”王士祯尝论汉魏以来二千年间诗家堪称“仙才”者，曹植、李白、苏轼三人耳。`
  },
  '陆逊': {
    name: '陆逊',
    dynasty: '三国',
    from: '183年',
    to: '245年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/208.png',
    content: `
    本名陆议，字伯言，吴郡吴县（今江苏苏州）人。三国时期吴国政治家、军事家。 
建安八年（203年），入孙权幕府，历任海昌屯田都尉、定威校尉、帐下右部督。建安二十四年（219年），陆逊参与袭取荆州。章武二年（222年），孙权以陆逊为大都督，在夷陵火烧连营击败刘备，一战成名。黄武七年（228年），陆逊取得石亭之战的胜利。黄龙元年（229年），孙权称帝后，以陆逊为上大将军、辅佐太子孙登并掌管陪都武昌事宜，后卷入立嗣之争。赤乌七年（244年）拜为丞相、荆州牧、右都护。次年去世，终年六十三岁，追谥昭侯。 
陆逊跟随孙权四十余年，统领吴国军政十余年，深得孙权器重。深谋远虑，忠诚刚直。一生出将入相，被赞为”社稷之臣“。`
  },
  '诸葛恪': {
    name: '诸葛恪',
    dynasty: '三国',
    from: '203年',
    to: '253年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/213.png',
    content: `
    字元逊，琅邪阳都（今山东沂南）人。他体格肥胖，是三国时期东吴权臣，蜀汉丞相诸葛亮之侄，大将军诸葛瑾长子。 
诸葛恪幼小以神童著称，成人之后拜骑都尉，孙权长子孙登为太子时担任左辅都尉，作为东宫幕僚领袖辅佐太子理政。之后历任丹阳太守、威北将军等职，赤乌八年（公元245年）丞相陆逊病逝，诸葛恪升任大将军并代领其兵。神凤元年（公元252年）孙权病危时在孙峻的力荐下将诸葛恪任命为托孤大臣之首。孙亮即位后受封太傅。开始掌握吴国军政大权。执政初期革新政治，率军抗击魏国取得东兴大捷颇孚民望。并因功加封丞相、晋爵阳都侯。 
此战之后产生轻敌之心，开始大举出兵伐魏，惨遭新城之败。回朝之后为掩饰过错更加独断专权。建兴二年（公元253年）十月，同为托孤大臣的孙峻暗中联合吴主孙亮，将诸葛恪及其死党以赴宴为名诱入宫中，在宴会上将诸葛恪杀害，时年五十一岁。孙休即位除掉权臣孙綝之后，下诏为诸葛恪平反。`
  },
  '邓艾': {
    name: '邓艾',
    dynasty: '三国',
    from: '197年',
    to: '264年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/209.png',
    content: `
    字士载，义阳棘阳(今河南新野)人。三国时期魏国杰出的军事家、将领。其人文武全才，深谙兵法，对内政也颇有建树。本名邓范，后因与同乡人同名而改名。邓艾多年在曹魏西边战线防备蜀汉姜维。
公元263年他与钟会分别率军攻打蜀汉，最后他率先进入成都，使得蜀汉灭亡。后因遭到钟会的污蔑和陷害，被司马昭猜忌而被收押，最后与其子邓忠一起被卫瓘派遣的武将田续所杀害。`
  },
  '姜维': {
    name: '姜维',
    dynasty: '三国',
    from: '202年',
    to: '264年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/214.png',
    content: `
    字伯约，天水冀县（今甘肃甘谷东南）人。三国时蜀汉名将，官至大将军。少年时和母亲住在一起，喜欢儒家大师郑玄的学说。因为父亲姜冏战死，姜维被郡里任命为中郎。
诸葛亮北伐时，姜维被怀疑有异心，姜维不得已投降蜀汉，被诸葛亮重用。诸葛亮去世后姜维在蜀汉开始崭露头角，费祎死后姜维开始独掌军权，继续率领蜀汉军队北伐曹魏，与曹魏名将邓艾、陈泰、郭淮等多次交手，姜维北伐总计大胜两次；小胜三次；相距不克四次；大败一次，小败一次。后因蜀中大臣也多反对姜维北伐，而宦官黄皓弄权，姜维杀之不成，只得在沓中屯田避祸，后司马昭五道伐蜀，姜维据守剑阁，阻挡住钟会大军，却被邓艾从阴平偷袭成都，刘禅投降。后姜维希望凭自己的力量复兴蜀汉，假意投降魏将钟会，打算利用钟会反叛曹魏以实现恢复汉室的愿望，但最终钟会反叛失败，姜维与钟会一同被魏军所杀。`
  },
  '卫瓘': {
    name: '卫瓘',
    dynasty: '三国',
    from: '220年',
    to: '291年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/204.png',
    content: `
    字伯玉。河东郡安邑县(今山西省夏县)人。三国曹魏后期至西晋初年重臣、书法家，曹魏尚书卫觊之子。卫瓘出身官宦世家，年轻时仕官于曹魏，历任尚书郎、散骑常侍、侍中、廷尉等职。后以镇西军司、监军身份参与伐蜀战争。蜀汉亡后，与钟会一道逮捕邓艾;钟会谋反时，又成功平息叛乱，命田续杀邓艾父子。回师后转任督徐州诸军事、镇东将军，封菑阳侯。西晋建立后，历任青州、幽州刺史、征东大将军等职，成功化解北方边境威胁，因功进爵菑阳公。后入朝为尚书令、侍中，又升任司空，领太子少傅。后逊位，拜太保。晋惠帝即位后，与贾皇后对立，终在政变中满门遇害，享年七十二岁。`
  },
  '贾南风': {
    name: '贾南风',
    dynasty: '晋朝',
    from: '265年',
    to: '420年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail10.png',
    content: `

    即惠贾皇后，小名峕(shí)，平阳襄陵(今山西襄汾东北)人。她是西晋时期晋惠帝司马衷的皇后，贾充的女儿。貌丑而性妒，因惠帝懦弱而一度专权，是西晋时期“八王之乱”的罪魁祸首，后死于赵王司马伦之手。而随后的八王之乱则引发了历史上著名的五胡乱华。`
  },
  '贾充': {
    name: '贾充',
    dynasty: '晋朝',
    from: '217年',
    to: '282年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/64.png',
    content: `

    字公闾，平阳襄陵(今山西襄汾)人，三国曹魏至西晋时期大臣，曹魏豫州刺史贾逵之子。西晋王朝的开国元勋。出身平阳贾氏。曾参与镇压淮南二叛和弑杀魏帝曹髦，因此深得司马氏信任，其女儿贾褒(一名荃)及贾南风分别嫁予司马炎弟司马攸及次子司马衷，与司马氏结为姻亲，地位显赫。晋朝建立后，转任车骑将军、散骑常侍、尚书仆射，后升任司空、太尉等要职。更封鲁郡公。咸宁末，为使持节、假黄钺、大都督征讨吴国。吴国平定后，增邑八千户。`
  },
  '陶侃': {
    name: '陶侃',
    dynasty: '晋朝',
    from: '259年',
    to: '334年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/65.png',
    content: `

    字士行，本为鄱阳郡枭阳县(今江西都昌 )人，东晋时期名将。陶侃出身贫寒，初任县吏，后逐渐出任郡守。永嘉五年(311年)，任武昌太守。建兴元年(313年)，任荆州刺史。官至侍中、太尉、荆江二州刺史、都督八州诸军事，封长沙郡公。咸和九年(334年)，陶侃去世，年七十六。获赠大司马，谥号"桓"。有文集二卷，今已佚。《全晋文》录有其文。其曾孙为著名田园诗人陶渊明。
陶侃平定陈敏、杜弢、张昌起义，又作为联军主帅平定了苏峻之乱，为稳定东晋政权，立下赫赫战功;他治下的荆州，史称"路不拾遗"。他精勤于吏职，不喜饮酒、赌博，为人所称道。在后将军郭默擅自杀害刘胤后，即率兵征讨，不费一兵一卒就擒获郭默父子，因而名震敌国。`
  },
  '祖逖': {
    name: '祖逖',
    dynasty: '晋朝',
    from: '266年',
    to: '321年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/70.png',
    content: `
    字士稚，范阳郡遒县(今河北省保定市涞水县)人。东晋时期杰出的军事家、民族英雄。
    祖逖出身于范阳祖氏，曾任司州主簿、大司马掾、骠骑祭酒、太子中舍人等职。永嘉之乱后，率领亲党避乱于江淮，担任奋威将军、豫州刺史。他在建武元年(317年)率部北伐，得到各地人民的响应。数年间，收复黄河以南大片领土，使得石勒不敢南侵，进号镇西将军。后因功勋巨大，受到东晋朝廷的忌惮。
    太兴四年(321年)，朝廷命戴渊出镇合肥，以牵制祖逖的北伐。祖逖目睹朝内明争暗斗，国事日非，最终忧愤而死，朝廷追赠车骑将军，部众被弟弟祖约接掌，祖逖的北伐大业也因此而功败垂成。321年
    `
  },
  '王导': {
    name: '王导',
    dynasty: '晋朝',
    from: '276年',
    to: '339年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/66.png',
    content: `
    字茂弘，小字赤龙 ，琅琊郡临沂县(今山东省临沂市)人。东晋开国元勋，政治家、书法家，镇军司马王裁的儿子。
王导出身琅琊王氏，早年便与琅玡王司马睿(晋元帝)友善，后建议其移镇建邺，又为他联络南方士族，安抚南渡北方士族。东晋建立后，先拜骠骑大将军、仪同三司，封武冈侯，又进位侍中、司空、假节、录尚书事，领中书监。与其从兄王敦一内一外，形成"王与马，共天下"的格局。"王敦之乱"时，王导拒绝王敦欲废元帝而立幼主的想法。不久，又受元帝遗诏辅立晋明帝。其后进位太保。明帝驾崩后，王导与外戚庾亮等共同辅政，并反对庾亮征历阳太守苏峻入京。"苏峻之乱"平定后，他驳斥众人企图迁都的念头，稳定局势。此后联合太尉郗鉴继续执政，虽与重臣陶侃、庾亮矛盾颇重，但终无大乱。咸康五年(339年)，王导去世，年六十四。晋成帝举哀于朝堂，遣使追谥"文献"。 葬礼规格同霍光、司马孚，为东晋中兴名臣之最。
    `
  },
  '桓温': {
    name: '桓温',
    dynasty: '晋朝',
    from: '312年',
    to: '373年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/71.png',
    content: `
    字元子，谯国龙亢县(今安徽省怀远县龙亢镇)人。东晋时期政治家、军事家、书法家、权臣，晋明帝司马绍女婿，宣城太守桓彝长子。
    出身谯国桓氏， 姿貌伟岸，豪爽大度。迎娶南康公主，拜驸马都尉，袭封万宁县男。 咸康元年(335年)，出任琅琊太守。 参与庾翼北伐，迁徐州刺史 。永和元年(345年)，迁使持节、安西将军、护南蛮校尉、荆州都督，掌握长江上游地区的兵权。 溯江而上，灭亡成汉，拜征西大将军、开府仪同三司，册封临贺郡公，声名大振。累迁大司马，册封南郡公。掌权期间，抑制朋党，改善吏治，抑制兼并，实施土断，重视民间疾苦，改善教育。三次出兵北伐，在声望受损后，奢求朝廷加九锡，受制于王谢势力阻碍，未能如愿。
    宁康元年(373年)七月，病逝于姑孰，享年六十二岁，追赠丞相，谥号宣武，丧礼依照安平献王司马孚、西汉大司马霍光的旧例。 元兴二年(403年)，其子桓玄篡位称帝，建立桓楚，追尊皇帝，庙号太祖，安葬于永崇陵。
    `
  },
  '谢安': {
    name: '谢安',
    dynasty: '晋朝',
    from: '320年',
    to: '385年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/67.png',
    content: `
    字安石。陈郡阳夏(今河南省太康县)人。东晋时期政治家、名士，太常谢裒第三子、镇西将军谢尚堂弟。
    谢安出身陈郡谢氏。自少以清谈知名，屡辞辟命，隐居会稽郡山阴县之东山，与王羲之、许询等游山玩水，并教育谢家子弟。后谢氏家族于朝中之人尽数逝去，他才东山再起，历任征西大将军司马、吴兴太守、侍中、吏部尚书、中护军等职。简文帝逝后，谢安与王坦之挫败桓温篡位意图。桓温死后，更与王彪之等共同辅政。在淝水之战中，谢安作为东晋一方的总指挥，以八万兵力打败了号称百万的前秦军队，使晋室得以存续。战后因功名太盛而被孝武帝猜忌，被迫前往广陵避祸。太元十年(385年)，谢安病逝，享年六十六岁。获赠太傅、庐陵郡公，谥号"文靖"。
    `
  },
  '谢玄': {
    name: '谢玄',
    dynasty: '晋朝',
    from: '343年',
    to: '388年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/72.png',
    content: `
    字幼度。陈郡阳夏(今河南太康)人。东晋名将，豫州刺史谢奕之子、太傅谢安之侄。
    谢玄有经国才略，善于治军。早年为大司马桓温部将。太元二年(377年)，为抵御前秦袭扰，谢安荐谢玄为建武将军、兖州刺史，领广陵相，监江北诸军事。他招募北来民众中的骁勇之士，组建训练一支精锐部队，号为"北府兵"。太元四年(379年)，率兵击败前秦军的进攻，进号冠军将军，加领徐州刺史。淝水之战中，谢玄任前锋都督，先遣部将刘牢之率部夜袭洛涧，首战告捷。继而抓住战机，计诱前秦军后撤，乘势猛攻，取得以少胜多的巨大战果。太元九年(384年)，率兵为前锋，乘胜开拓中原，先后收复了今河南、山东、陕西南部等地区。后因病改任左将军、会稽内史。
    `
  },
  '杨佺期': {
    name: '杨佺期',
    dynasty: '晋朝',
    from: '？',
    to: '399年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/68.png',
    content: `
    字号不详，弘农华阴(今陕西华阴)人。东晋将领，汉太尉杨震之后。
    沉毅果敢，个性勇猛，累官至龙骧将军、雍州刺史，曾参与王恭举兵讨伐王国宝的行动，又与荆州刺史殷仲堪一同对抗桓玄，但因殷仲堪对其的畏惧而不信任，终被桓玄先发制人，杨佺期兵败，被擒后遇害。
    `
  },
  '殷仲堪': {
    name: '殷仲堪',
    dynasty: '晋朝',
    from: '？',
    to: '399年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/73.png',
    content: `
    陈郡长平(今河南西华)人，东晋太常殷融之孙，晋陵太守殷师之子。
    东晋末年重要将领、大臣。官至荆州刺史，曾两度响应王恭讨伐朝臣的起事，在王恭死后与桓玄及杨佺期结盟对抗朝廷，逼令朝廷屈服。后来却被桓玄袭击，逼令自杀。
    `
  },
  '刘牢之': {
    name: '刘牢之',
    dynasty: '晋朝',
    from: '？',
    to: '402年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/222.png',
    content: `
    字道坚。彭城郡(今江苏省徐州市)人 。东晋时期名将，雁门太守刘羲之孙，征虏将军刘建之子。
    刘牢之生长于尚武世家，其人面色紫赤，须目都异于常人，性格深沉刚毅，为人足智多谋。最初应谢玄之募入北府兵，任参军，后以功升鹰扬将军、广陵相。淝水之战时，率五千精兵在洛涧大破梁成，在苻坚败后率军攻陷谯郡，因功晋升龙骧将军、彭城内史，赐封武冈县男。后奉命救援前秦苻丕，为慕容垂所败，被召回，此后又平定了多处叛乱。王恭第二次起兵时，刘牢之答应司马元显而背叛王恭，在其死后接管兖、青、冀、幽、并、徐、扬七州及晋陵军务。又率兵屡破孙恩，最终将其驱赶斩杀。后拜前锋都督、征西将军，兼江州刺史，讨伐桓玄。又听从何穆建议再次倒戈，致使司马元显被杀。
    `
  },
  '司马元显': {
    name: '司马元显',
    dynasty: '晋朝',
    from: '382年',
    to: '402年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/224.png',
    content: `
    字朗君，河内郡温县(今河南温县)人。东晋宗室、权臣。晋简文帝司马昱之孙，会稽文孝王司马道子之子，晋孝武帝司马曜之侄。初任中书令、尚书令，后官至骠骑大将军。
    自隆安三年(399)至元兴元年(402)，司马元显曾一度执掌东晋政权。因征调江南诸郡已免奴为客者，到建康服兵役，称为"乐属"，激起了孙恩起义。孙恩连年攻掠当时朝廷唯一能直接控制的三吴地区，战事不息，而司马元显仍贪腐不已，国库空虚下仍聚敛钱财之余亦骄傲自大，宠信小人张法顺，败坏朝政。及后司马元显讨伐桓玄，倚靠了北府军将领刘牢之，然而刘牢之倒戈投降桓玄。司马元显兵败被捕，不久与其六个儿子一同被杀，时年仅21岁。
    `
  },
  '司马道子': {
    name: '司马道子',
    dynasty: '晋朝',
    from: '364年',
    to: '403年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/223.png',
    content: `
    字道子，河内郡温县(今河南省温县)人。东晋宗室、权臣。晋简文帝司马昱第七子，晋孝武帝司马曜同母弟，母李陵容。
    初封琅邪王，后徙封会稽王。曾担任司徒、扬州刺史、录尚书六条事等重要职务，司马道子在孝武帝朝是与皇室血缘最近的一支，在当时被委以朝政大任，又排挤当国的陈郡谢氏士族，皇族权力得以提升。然而孝武帝和司马道子皆嗜酒，司马道子亦任用小人，致令朝政渐见败坏;而孝武帝信任的臣下亦有不齿于司马道子党众的人，两派之间矛盾造成主相之间的斗争。
    太元二十一年(396年)孝武帝司马曜被张贵人所杀，太子司马德宗即位，司马道子以皇叔之尊辅政掌权，继续任用王国宝等宠臣，招来王恭发兵讨伐。司马道子虽然屈服，但仍以司马尚之和王愉等人试图抗衡，却招来王恭第二度讨伐，最终倚靠儿子司马元显平定。
    `
  },
  '桓玄': {
    name: '桓玄',
    dynasty: '晋朝',
    from: '369年',
    to: '404年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/225.png',
    content: `
    字敬道，一名灵宝，谯国龙亢县(今安徽省怀远县)人，丞相桓温之子，桓楚开国皇帝(403年-404年)。形貌瑰奇，风神疏朗， 袭爵南郡公，世称"桓南郡"。先后消灭殷仲堪和杨佺期 ，除掉执政的司马道子父子，把持朝权 。历任侍中、都督中外诸军事、丞相、录尚书事、扬州牧，领徐州刺史 ，相国、大将军，晋封楚王。大亨元年(403年)，威逼晋安帝禅位，在建康建立桓楚，改元"永始"。
    不久，刘裕举北府兵起义，桓玄败逃江陵重整军力，遭西讨义军击败。试图入蜀，被益州督护冯迁杀死，时年三十六岁。博综艺术，善属文 ，著有《桓玄集》二十卷。
    `
  },
  '祖冲之': {
    name: '祖冲之',
    dynasty: '南北朝',
    from: '420年',
    to: '581年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail11.png',
    content: `
    字文远。出生于建康（今南京），祖籍范阳郡遒县（今河北涞水县），中国南北朝时期杰出的数学家、天文学家。
    祖冲之的成就不仅限于自然科学方面，他还精通乐理．对于音律很有研究。祖冲之又著有《易义》《老子义》《庄子义》《释论语》等关于哲学的书籍，都已经失传了。文学作品方面他著有《述异记》，在《太平御览》等书中可以看到这部著作的片断。`
  },
  '谢灵运': {
    name: '谢灵运',
    dynasty: '南北朝',
    from: '385年',
    to: '433年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/74.png',
    content: `原名公义，字灵运，以字行于世，小名客儿，世称谢客。出身陈郡谢氏，祖籍陈郡阳夏，生于会稽始宁。南北朝时期诗人、文学家、旅行家。谢灵运也是一位画家，他绘画的题材是“菩萨像”，并且，其壁画《菩萨像》即使经历了晚唐灭佛浩劫，仍然幸存六壁之多
    可见谢灵运生前所画的《菩萨像》作品，在数量上是相当可观的，而在艺术上也应该是很有自家风格的。所以绘画界认为，谢灵运绘画与六朝时期诸名家一样，是占据着一席之地的，且是以“佛像”类创作蜚声画坛。
    `
  },
  '兰陵王高长恭': {
    name: '兰陵王高长恭',
    dynasty: '南北朝',
    from: '541年',
    to: '573年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/76.png',
    content: `又名高孝瓘、高肃，祖籍渤海调蓨（今河北省景县），神武帝高欢之孙，文襄帝高澄第四子，生母不详，南北朝时期北齐宗室、将领，封爵兰陵王。高长恭貌柔心壮，音容兼美。为将躬勤细事，每得甘美，虽一瓜数果，必与将士分享。累次升任至并州刺史。突厥攻入晋阳，高长恭奋力将其击退。邙山之战，高长恭为中军，率领五百骑兵再入周军包围圈，直至金墉城下，因高长恭戴着头盔，城中的人不确定是敌军或是我军，直到高长恭把头盔脱下来城上的人才知道是高长恭，派弓箭手开始放箭保护他，之后高长恭成功替金墉解围，高长恭在此次战中威名大振，士兵们为此战而讴歌他，即后来知名的《兰陵王入阵曲》。后历任尚书令、录尚书事、大司马、太保、太尉等。与段韶征讨柏谷，又攻打定阳。段韶患病，高长恭总领其众。前后以战功别封钜鹿、长乐、乐平、高阳等郡公。后因“国事即家事”招致北齐后主高纬记恨，于武平四年（573年）被高纬赐死。死后朝廷追赠为太尉，谥号武。
    `
  },
  '杨素': {
    name: '杨素',
    dynasty: '隋朝',
    from: '581年',
    to: '618年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail12.png',
    content: `
    字处道。汉族，弘农华阴（今属陕西）人。隋朝权臣、诗人，杰出的军事家、统帅。 他出身北朝士族，北周时任车骑将军，曾参加平定北齐之役。他与杨坚（隋文帝）深相结纳。杨坚为帝，任杨素为御史大夫，后以行军元帅率水军东下攻陈。灭陈后，进爵为越国公，任内史令。杨广即位，拜司徒，改封楚国公。去世后谥曰景武。`
  },
  '杨玄感': {
    name: '杨玄感',
    dynasty: '隋朝',
    from: '？',
    to: '613年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/79.png',
    content: `字号不详，弘农华阴(今陕西省华阴市)人。隋朝大臣，司徒楚公杨素嫡长子。
    体貌雄伟，须髯漂亮。喜好读书，擅长骑射。凭借父亲勋劳，授柱国、郢宋二州刺史，迁鸿胪卿、礼部尚书，袭封楚公。声名过盛，受到隋炀帝猜忌，内心不安，策划谋反。
    大业九年(613年)，隋炀帝二次出征高句丽时，趁机反叛，屯兵于黎阳，为大将军宇文述所败，下令其弟杨积善杀死，献首于朝廷。
    `
  },
  '宇文化及': {
    name: '宇文化及',
    dynasty: '隋朝',
    from: '？',
    to: '619年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/78.png',
    content: `本姓破野头，代郡武川(今内蒙古武川县)人，鲜卑人。隋朝末年群雄之一，北周上柱国宇文盛之孙，左卫大将军宇文述长子 。
    宇文化及出身京兆宇文氏，贪婪骄横，不循法度，举动轻薄。门荫入仕，起家千牛备身。保护晋王杨广，迁太子仆，深得宠信。隋炀帝即位后，授太仆少卿，贪婪妄为，横行不法。违背禁令，互市突厥，下狱论死。得到南阳公主出面求情，免罪为奴，起任右屯卫将军，掌管禁卫军。
    大业十四年(公元618年)，发动江都政变，弑杀隋炀帝，拥立秦王杨俊之子杨浩为傀儡皇帝，自称大丞相，率军北归，被魏国公李密击败，自立为帝，国号为许，年号"天寿"。武德二年(公元619年)，与其二子终为夏王窦建德擒杀。
    `
  },
  '宇文成都': {
    name: '宇文成都',
    dynasty: '隋朝',
    from: '541年',
    to: '573年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/80.png',
    content: `宇文化及的儿子，被杨广封为隋朝天宝大将军，赐"天下第一横勇无敌"金牌。身长一丈，腰大十围，金面长须，虎目浓眉。头戴一顶双凤金盔，身穿一件锁子黄金甲，坐下一匹能行千里黄花马。使一条凤翅镏金镋，重四百斤。上界雷声普化天尊临凡，身负三载龙命。武力在隋唐好汉中排第二。
    曾于南阳关力挫排名第五的伍云召，四平山击败排名第四的雄阔海、伍云召以及第六的伍天锡三人联手，随后因体力未恢复输给排名第三的裴元庆，晋阳比武输给排名第一的李元霸。
    十八路反王进逼扬州时，其父宇文化及弑杀隋炀帝。宇文成都与宿敌李元霸战于紫金山，终被李元霸所杀。
    `
  },
  '秦琼': {
    name: '秦琼',
    dynasty: '唐朝',
    from: '618年',
    to: '907年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail13.png',
    content: `

    字叔宝，齐州历城(今山东省济南市历城区)人。隋末唐初名将。
    秦琼勇武过人，远近闻名。初仕隋朝，跟随来护儿、张须陀、裴仁基帐下任职。后来，投奔瓦岗起义军领袖李密。瓦岗败亡后，投靠郑国王世充。因王世充为人奸诈，与程咬金等人一起投奔李渊、李世民父子。后跟随秦王李世民南征北战，屡立战功，浑身伤病，拜左武卫大将军、翼国公。
    贞观十二年(638年)，秦琼病逝，获赠徐州都督、胡国公，谥号为壮。后名列凌烟阁二十四功臣之一。
    `
  },
  '王世充': {
    name: '王世充',
    dynasty: '唐朝',
    from: '？',
    to: '621年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/81.png',
    content: `本姓支，字行满，西域析支(今甘肃省临夏县)人，氐族。隋朝末年群雄之一，汴州长史支收之子。
    涉猎经史，爱好兵法。开皇年间，屡建军功，拜兵部员外郎、仪同三司。隋炀帝大业年间，负责修建江都宫，参与平定杨玄感叛乱以及各地民变各地，发展河南地区的势力。攻打李密领导的瓦岗起义军战败进入洛阳。得知隋炀帝被杀后，越王杨侗即位，封为郑国公，领军大破李密，招降瓦岗众将。之后，废主自立，建立郑国，年号开明。
    武德四年(621年)，秦王李世民攻破洛阳，率部投降，免死流放蜀地，途中为仇人独孤修德所杀。`
  },
  '魏征': {
    name: '魏征',
    dynasty: '唐朝',
    from: '580年',
    to: '643年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/82.png',
    content: `字玄成，钜鹿郡（一说在今河北省巨鹿县，一说在今河北省馆陶县 ，也有说在河北晋州）人，唐朝政治家、思想家、文学家和史学家，因直言进谏，辅佐唐太宗共同创建“贞观之治”的大业，被后人称为“一代名相”。
    贞观十七年（643年），魏征病死。官至光禄大夫，封郑国公，谥号“文贞”。[葬礼从简。同年入凌烟阁。 
    魏征陵墓位于陕西省礼泉县。著有《隋书》序论，《梁书》、《陈书》、《齐书》的总论等。其言论多见《贞观政要》。其中最著名，并流传下来的谏文表---《谏太宗十思疏》。`
  },
  '房玄龄': {
    name: '房玄龄',
    dynasty: '唐朝',
    from: '579年',
    to: '648年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/87.png',
    content: `名乔，字玄龄，以字行于世，唐初齐州人，房彦谦之子。 18岁时本州举进士，授羽骑尉。房玄龄在渭北投秦王李世民后，为李世民出谋划策，典管书记，是李世民得力的谋士之一。 
    武德九年，他参与玄武门之变，与杜如晦、长孙无忌、尉迟敬德、侯君集五人并功第一。唐太宗李世民即位后，房玄龄为中书令；贞观三年二月为尚书左仆射；贞观十一年封梁国公；贞观十六年七月进位司空，仍综理朝政。贞观二十二年七月廿四癸卯日，房玄龄病逝，谥文昭。 永徽三年，玄龄次子遗爱与其妻高阳公主被指谋反，遗爱被处死，公主赐自尽，诸子被发配流放到岭表。玄龄嗣子遗直也被连累，被贬为铜陵尉。房玄龄配享太庙的待遇也因而被停止。`
  },
  '薛仁贵': {
    name: '薛仁贵',
    dynasty: '唐朝',
    from: '614年',
    to: '683年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/83.png',
    content: `名礼，字仁贵。河东道绛州龙门县修村(今山西河津市修村)人。唐朝初年名将，北魏河东王薛安都六世孙。
    薛仁贵出身于河东薛氏南祖房 ，于贞观末年投军，随征高丽，受唐太宗拔擢。自此征战数十年，曾大败九姓铁勒，降服高丽，击破突厥，功勋卓著，留下了"良策息干戈""三箭定天山""神勇收辽东""仁政高丽国""爱民象州城""脱帽退万敌"等典故，至唐高宗时，累官至瓜州长史、右领军卫将军、检校代州都督，封平阳郡公。
    永淳二年(683年)，薛仁贵去世，年七十。册赠左骁卫大将军、幽州都督。`
  },
  '狄仁杰': {
    name: '狄仁杰',
    dynasty: '唐朝',
    from: '630年',
    to: '700年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/88.png',
    content: `字怀英，并州晋阳(今山西省太原市)人。唐代政治家、武周时期的宰相。
    狄仁杰出身于太原狄氏 ，早年以明经及第，历任汴州判佐、并州法曹、大理寺丞、侍御史、度支郎中、宁州刺史、冬官侍郎、文昌右丞、豫州刺史、复州刺史、洛州司马等职，以不畏权贵著称。天授二年(691年)九月拜相，担任地官侍郎、同平章事，但仅四个月便被酷吏来俊臣诬陷谋反，夺职下狱，平反后贬彭泽县令。他在营州之乱时被起复，并于神功元年(697年)再次拜相，担任鸾台侍郎、同平章事，进拜纳言。后犯颜直谏，力劝武则天复立庐陵王李显为太子，使得唐朝社稷得以延续。
    久视元年(700年)，狄仁杰进拜内史，于同年九月病逝，追赠文昌右相，谥号文惠。唐朝复辟后，追赠司空、梁国公。`
  },
  '李林甫': {
    name: '李林甫',
    dynasty: '唐朝',
    from: '683年',
    to: '753年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/84.png',
    content: `字哥奴，祖籍陇西，唐朝宗室、宰相，长平王李叔良曾孙。李林甫出身于唐朝宗室郇王房，早年历任千牛直长、太子中允、太子谕德、国子司业、御史中丞、刑部侍郎、吏部侍郎、黄门侍郎，后以礼部尚书之职拜相，加授同三品。
    开元二十四年(736年)，李林甫接替张九龄，升任中书令(右相)，后进封晋国公，又兼尚书左仆射。天宝十一年十一月(753年1月)，李林甫病逝，追赠太尉、扬州大都督。后被杨国忠诬告谋反，遭削官改葬，抄没家产，子孙流放。
    李林甫担任宰相十九年，是玄宗时期在位时间最长的宰相。他大权独握，蔽塞言路，排斥贤才，导致纲纪紊乱，还建议重用胡将，使得安禄山做大，被认为是使唐朝由盛转衰的关键人物之一。`
  },
  '高力士': {
    name: '高力士',
    dynasty: '唐朝',
    from: '684年',
    to: '762年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/89.png',
    content: `本名冯元一，是中国唐代的著名宦官之一，是被周恩来总理誉为“中国巾帼英雄第一人”的岭南著名军政领袖--冼夫人的第六代孙。祖籍潘州（今广东省高州市），曾祖冯盎、祖父冯智玳、父为冯君衡，曾任潘州刺史。他幼年时入宫，由高延福收为养子，遂改名高力士，受到当时女皇帝武则天的赏识。在唐玄宗管治期间，其地位达到顶点，由于曾助唐玄宗平定韦皇后和太平公主之乱，故深得玄宗宠信，终于累官至骠骑大将军、进开府仪同三司。高力士一生忠心耿耿，与唐玄宗不离不弃，被誉为“千古贤宦第一人”。`
  },
  '郭子仪': {
    name: '郭子仪',
    dynasty: '唐朝',
    from: '697年',
    to: '781年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/85.png',
    content: `华州郑县(今陕西华县)人，祖籍山西太原，唐代政治家、军事家。郭子仪早年以武举高第入仕从军，积功至九原太守，一直未受重用。
    安史之乱爆发后，郭子仪任朔方节度使，率军勤王，收复河北、河东，拜兵部尚书、同中书门下平章事。公元757年，郭子仪与广平王李俶收复西京长安、东都洛阳，以功加司徒，封代国公。758年，进位中书令。759年，因承担相州兵败之责，被解除兵权，处于闲官。公元762年，太原、绛州兵变，郭子仪被封为汾阳王，出镇绛州，不久又被解除兵权。公元763年，仆固怀恩勾结吐蕃、回纥入侵，长安失陷。郭子仪被再度启用，任关内副元帅，再次收复长安。公元765年，吐蕃、回纥再度联兵内侵，郭子仪在泾阳单骑说退回纥，并击溃吐蕃，稳住关中。`
  },
  '冯道': {
    name: '冯道',
    dynasty: '五代十国',
    from: '882年',
    to: '954年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/90.png',
    content: `
    字可道，自号“长乐老”。五代瀛州景城（今中国中部河北交河东北）人。后唐（公元923年～公元934年）、后晋（公元936年～公元940年）时任宰相。契丹灭后晋，到契丹任太傅。后汉（公元947年～公元948年）时任太师。后周（公元951年～公元959年）时任太师、中书令。曾著《长乐老自叙》。
后唐长兴三年（公元932年），冯道为印行经籍标准文本，经皇帝批准由尚书屯田员外郎田敏等人任详勘官,李鹗、朱延熙等书写，依唐刻《开成石经》，并和经注合刊，开雕“九经”：《易》、《书》、《诗》、《春秋左氏传》、《春秋公羊传》、《春秋谷梁传》、《周礼》、《仪礼》和《礼记》，以端楷书写，能匠刊刻。`
  },
  '杨业': {
    name: '杨业',
    dynasty: '五代十国',
    from: '907年',
    to: '960年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail14.png',
    content: `
    原名重贵，被北汉世祖刘崇赐名刘继业 ，戏剧中常称杨继业，麟州新秦(今陕西省神木县)人(一说并州太原人，一说保德火山人)。 北宋名将，后汉麟州刺史杨弘信之子。
倜傥任侠，善于骑射，喜好打猎。忠烈武勇，甚有智谋。北汉建立后，追随北汉世祖刘崇，任保卫指挥使，以骁勇闻名远近。屡立战功，迁升建雄军节度使，号为"无敌"。 宋太宗灭亡北汉后，归顺宋朝，拜郑州刺史，授右领军卫大将军。累迁云州观察使、代州刺史兼三交驻泊兵马部署。
太平兴国五年(980年)，在雁门关之战中大破辽军，威震契丹。雍熙三年(986年)，随军北伐，为监军王侁威逼，毅然带兵出征，在陈家谷口力战而死。 追赠太尉、中书令、大同军节度使。`
  },
  '包拯': {
    name: '包拯',
    dynasty: '宋辽金夏',
    from: '960年',
    to: '1276年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail15.png',
    content: `
    字希仁，庐州合肥(今安徽合肥肥东)人，北宋名臣。
天圣五年(1027年)，包拯登进士第。累迁监察御史，曾建议练兵选将、充实边备。历任三司户部判官及京东、陕西、河北路转运使，后入朝担任三司户部副使，请求朝廷准许解盐通商买卖。知谏院时，多次论劾权贵。再授龙图阁直学士、河北都转运使，移知瀛、扬诸州，历权知开封府、权御史中丞、三司使等职。嘉佑六年(1061年)，升任枢密副使。因曾任天章阁待制、龙图阁直学士，故世称"包待制"、"包龙图"。嘉佑七年(1062年)，包拯逝世，年六十四。追赠礼部尚书，谥号"孝肃"，后世称其为"包孝肃"。有《包孝肃公奏议》传世。
包拯廉洁公正、立朝刚毅，不附权贵，铁面无私，且英明决断，敢于替百姓申不平，故有"包青天"及"包公"之名，京师有"关节不到，有阎罗包老"之语。后世将他奉为神明崇拜，认为他是奎星转世 ，由于民间传其黑面形象，亦被称为"包青天"。`
  },
  '石守信': {
    name: '石守信',
    dynasty: '宋辽金夏',
    from: '928年',
    to: '984年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/92.png',
    content: `字守信 ，开封浚仪(今河南开封市)人，北宋开国名将。
    初仕后周时，参与高平之战、淮南之战，累迁殿前都指挥使、义成军节度使，与赵匡胤结为异姓兄弟，成为"义社十兄弟"的成员。
    北宋建立后，率军讨平李筠、李重进叛乱，出任马步军副侍卫都指挥使、侍卫亲军马步都指挥使等职。自杯酒释兵权后，专事聚敛，积财巨万。
    宋太宗时期，随征辽国，迁镇安军节度使、守中书令，封卫国公。太平兴国九年(984年)，去世，享年五十七岁。追赠尚书令、秦王、封武威郡王，谥号武烈。`
  },
  '寇凖': {
    name: '寇凖',
    dynasty: '宋辽金夏',
    from: '961年',
    to: '1023年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/97.png',
    content: `即寇准，字平仲，汉族，华州下邽(今陕西渭南)人。北宋政治家﹑诗人。太平兴国（980年）五年进士，授大理评事、知归州巴东县，改大名府成安县。累迁殿中丞、通判郓州。召试学士院，授右正言、直史馆，为三司度支推官、转盐铁判官。历同知枢密院事、参知政事。后两度入相，一任枢密使，出为使相。乾兴元年(1022年)数被贬谪，终雷州司户参军，天圣元年 (1023年) 九月，病逝于雷州。
    皇佑四年(1053年)，宋仁宗诏翰林学士孙抃撰神道碑，谥"忠愍"，复爵"莱国公"，追赠中书令，仁宗亲篆其首曰"旌忠"。故后人多称"寇忠愍"或"寇莱公"。寇准善诗能文，七绝尤有韵味，有《寇忠愍诗集》三卷传世。与白居易、张仁愿并称渭南"三贤"。`
  },
  '司马光': {
    name: '司马光',
    dynasty: '宋辽金夏',
    from: '1019年',
    to: '1086年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/98.png',
    content: `字君实，号迂叟，陕州夏县涑水乡(今山西省夏县)人 ，世称涑水先生 。北宋政治家、史学家、文学家，自称西晋安平献王司马孚之后代。
    宋仁宗宝元元年(1038年)，进士及第，累迁龙图阁直学士。宋神宗时，反对王安石变法，离开朝廷十五年，主持编纂了编年体通史《资治通鉴》。历仕仁宗、英宗、神宗、哲宗四朝，官至尚书左仆射兼门下侍郎。元佑元年(1086年)，去世，追赠太师、温国公，谥号文正。名列"元佑党人"，配享宋哲宗庙廷，图形昭勋阁;从祀于孔庙，称"先儒司马子";从祀历代帝王庙。
    为人温良谦恭、刚正不阿;做事用功，刻苦勤奋。以"日力不足，继之以夜"自诩，堪称儒学教化下的典范。 生平著作甚多，主要《温国文正司马公文集》、《稽古录》、《涑水记闻》、《潜虚》等。`
  },
  '王安石': {
    name: '王安石',
    dynasty: '宋辽金夏',
    from: '1021年',
    to: '1086年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/94.png',
    content: `字介甫，号半山，汉族，临川（今江西抚州市临川区）人，北宋著名的思想家、政治家、文学家、改革家。王安石历任扬州签判、鄞县知县、舒州通判等职，政绩显著。熙宁二年（1069年），任参知政事，次年拜相，主持变法。因守旧派反对，熙宁七年（1074年）罢相。一年后，宋神宗再次起用，旋又罢相，退居江宁。元祐元年（1086年），保守派得势，新法皆废，郁然病逝于钟山（今江苏南京），赠太傅。绍圣元年（1094年），获谥“文”，故世称王文公。`
  },
  '秦桧': {
    name: '秦桧',
    dynasty: '宋辽金夏',
    from: '1090年',
    to: '1155年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/99.png',
    content: `字会之，生于黄州，籍贯江宁(今江苏南京)。南宋初年宰相、奸臣，主和派的代表人物。
    政和五年(1115年)，秦桧进士及第，中词学兼茂科，任太学学正。宋钦宗时，历任左司谏、御史中丞。靖康二年(1127年)，因上书金帅反对立张邦昌，随徽、钦二帝被俘至金，为挞懒信用。宋高宗建炎四年(1130年)，秦桧回到临安，力主宋金议和。绍兴元年(1131年)，擢参知政事，随后拜相，次年被劾落职，绍兴八年(1138年)再相，前后执政十九年，历封秦、魏二国公，深得高宗宠信。绍兴二十五年(1155年)，秦桧病逝，时年66岁，追赠申王，谥忠献。开禧二年(1206年)，宋宁宗追夺其王爵，改谥谬丑。嘉定元年(1208年)，史弥远执政后又恢复其王爵和谥号。`
  },
  '宋慈': {
    name: '宋慈',
    dynasty: '宋辽金夏',
    from: '1186年',
    to: '1249年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/95.png',
    content: `字惠父，汉族，建阳(今属福建南平)人，与理学大师朱熹同乡，祖籍河北邢台市南和县，唐相宋璟后人，生于南宋孝宗淳熙十三年(1186年)，南宋著名法医学家，中外法医界普遍认为是宋慈于公元1235年开创了"法医鉴定学"，因此宋慈被尊为世界法医学鼻祖。`
  },
  '贾似道': {
    name: '贾似道',
    dynasty: '宋辽金夏',
    from: '1213年',
    to: '1275',
    img: 'https://hmqn.zhijingyuntech.cn/officer/100.png',
    content: `字师宪，号悦生，南宋晚期权相。浙江天台屯桥松溪人。京湖制置使贾涉之子，生母胡氏是贾涉的小妾。贾涉死时，贾似道年仅11岁。
    端平元年(1234)以父荫为嘉兴司仓、籍田令。嘉熙二年(1238)登进士，为理宗所看重。淳佑初以宝章阁直学士为沿江制置副使，任江州知州，兼江南西路安抚使，再调京湖制置使，兼江陵知府。加宝文阁学士、京湖安抚制置大使。宝佑二年(1254)加同知枢密院事，临海郡开国公，后晋参知政事、知枢密院事，开庆初年于军中拜为右丞相兼枢密使，宋理宗以"师臣"相称，百官都称其为"周公"。宋理宗驾崩后，立理宗养子赵禥为帝，是为宋度宗，度宗即位后不久，贾似道升任太师、平章军国重事。`
  },
  '文天祥': {
    name: '文天祥',
    dynasty: '宋辽金夏',
    from: '1236年',
    to: '1283年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/96.png',
    content: `字宋瑞，又字履善。自号浮休道人、文山。江南西路吉州庐陵县(今江西省吉安市青原区富田镇 )人，南宋末年政治家、文学家，抗元名臣，民族英雄  ，与陆秀夫、张世杰并称为"宋末三杰"。
    宋理宗宝佑四年(1256年)，文天祥中进士第一，成为状元。一度掌理军器监兼权直学士院，因直言斥责宦官董宋臣，讥讽权相贾似道而遭到贬斥，数度沉浮，在三十七岁时自请致仕。德佑元年(1275年)，元军南下攻宋，文天祥散尽家财，招募士卒勤王，被任命为浙西、江东制置使兼知平江府。在援救常州时，因内部失和而退守余杭。随后升任右丞相兼枢密使，奉命与元军议和，因面斥元主帅伯颜被拘留，于押解北上途中逃归。不久后在福州参与拥立益王赵昰为帝，又自赴南剑州聚兵抗元。景炎二年(1277年)再攻江西，终因势孤力单败退广东。祥兴元年(1278年)卫王赵昺继位后，拜少保，封信国公。后在五坡岭被俘，押至元大都，被囚三年，屡经威逼利诱，仍誓死不屈。元至元十九年十二月(1283年1月)，文天祥从容就义，终年四十七岁。明代时追赐谥号"忠烈" 。`
  },
  '耶律楚材': {
    name: '耶律楚材',
    dynasty: '元朝',
    from: '1279年',
    to: '1368年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail16.png',
    content: `
    契丹族人，字晋卿，号湛然居士，又号玉泉老人。博学能文，生于燕京，为辽东丹王突欲的八世孙。蒙古军破燕京后，1218年成吉思汗于漠北召见，甚为赞赏，为左右员外郎，太宗时，拜中书令。1219年随成吉思汗大军西征。勇略过人，正直廉洁，在朝廷内外威信很高。生前要求葬在瓮山泊畔，乃颐和园的昆明湖。耶律楚材墓在明朝时被毁，清乾隆时修复，改建为祠。耶律楚材祠在颐和园昆明湖东岸，文昌阁之北，内有乾隆皇帝御诗墓碑，巨冢是耶律楚材及夫人合葬的坟墓。 成吉思汗定燕，召为相，历事两朝，凡蒙古陋风，悉为改革，元立国规模多出其手定博览群书，旁通天文、地理、律历、医卜及释道之学，并善诗文。著有《湛然居士文集》、《西游录》。 青年时代任金朝开州同知。金宣宗迁都后，完颜复兴留守中都，辟为左右司员外郎。蒙古军破中都后，成吉思汗于漠北召见，甚为赞赏，称为“吾图撒合理”（长髯人）。`
  },
  '木华黎': {
    name: '木华黎',
    dynasty: '元朝',
    from: '1170年',
    to: '1223年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/101.png',
    content: `又作木合里、摩和赉、穆呼哩 等，大蒙古国成吉思汗铁木真手下骁将、开国功臣，孔温窟洼第五子。生于阿难水东，早年被父亲送给铁木真做"梯己奴隶"。
    木华黎以沉毅多智、雄勇善战著称，与博尔术最受器重，被铁木真誉为"犹车之有辕，身之有臂。"四十年间追随铁木真，无役不从，辅佐铁木真统一蒙古诸部，战功卓著，与博尔术、博尔忽、赤老温并为"四杰"之一。成吉思汗元年(1206年)，封为左翼万户长，为征金大元帅、太师、国王，赐九斿白纛，代成吉思汗施行恩威。经过六年征战，先后征服了金朝大部分国土。
    成吉思汗十八年(1223年)，木华黎于凤翔之战结束后的班师途中病逝于闻喜县，时年五十四。至治元年(1321年)，追赠开国辅世佐命功臣、太师、开府仪同三司、上柱国、鲁国王，谥号"忠武"。`
  },
  '伯颜': {
    name: '伯颜',
    dynasty: '元朝',
    from: '1236年',
    to: '1295年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/102.png',
    content: `是中国元朝末年的军事和政治人物。伯颜的祖父曾随元宪宗伐南宋，父亲是隆福太后宫中宿卫的统领。元成宗时，伯颜被派为元武宗的侍从，1299年参与对海都汗的讨伐，因功元武宗赐与伯颜拔都儿的称号。元武宗即位后，任吏部尚书等高官，泰定帝去逝，权臣燕铁木儿欲从江陵迎立武宗之子怀王（即元文宗），伯颜时任河南行省平章政事，全力支持并护送怀王北行。文宗即位后，屡昇官至中书右丞相，元顺帝时燕铁木儿之子唐其势、塔剌汗两人涉嫌谋反，被杀，使伯颜得以逐渐独揽军政大权，大量引用亲信为高官，包括其侄子脱脱，但后来顺帝对伯颜有所不满，便联合脱脱，于1340年发动行动，将伯颜治罪降官至河南，同年再降至广东，后死于途中。`
  },
  '脱脱': {
    name: '脱脱',
    dynasty: '元朝',
    from: '1314年',
    to: '1356年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/105.png',
    content: `亦作托克托，蔑里乞氏，字大用，蒙古族。幼养于伯颜家，从浦江吴直方学。元朝元统二年（1334年），任同知宣政院事，迁中政使、同知枢密院事、御史大夫、中书右丞相。当时伯颜为中书右丞相，权倾朝野，向为顺帝所忌，脱脱恐受其累，与顺帝密谋除伯颜。后改伯颜旧政，复科举取士。曾参加镇压徐州芝麻红巾军起义，执意屠城，军事成就卓著，功封太师。至正十四年（1354年），讨伐高邮（今属江苏）张士诚起义军，被士诚击败。十五年（1355年），被流放云南，后被元顺帝派人毒死。二十二年（1362年），昭雪复官。至正三年（1343年），主编《辽史》《宋史》《金史》，任都总裁官。`
  },
  '王保保': {
    name: '王保保',
    dynasty: '元朝',
    from: '？',
    to: '1376年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/103.png',
    content: `扩廓帖木儿，蒙古语意为"青铁"，蒙古伯也台部人，生于光州固始县，汉名王保保。元朝末年将领。他的父亲是元翰林学士、太尉赛因赤答忽，母亲是元末将领察罕帖木儿的姐姐，后为舅舅察罕帖木儿收为养子。元末农民起义时，扩廓帖木儿跟从察罕帖木儿组织地主武装，镇压红巾军。至正二十二年(1362年)察罕帖木儿遇刺身亡后，他独当一面，并卷入元廷党争及军阀混战，曾被封为河南王、中书左丞相。至正二十八年(1368年)明朝攻占大都，扩廓帖木儿自山西退至甘肃，在沈儿峪被明军击败后于至正三十年(1370年)北奔和林，辅佐北元昭宗爱猷识理达腊，力图光复大元江山，在宣光二年(1372年)大破明军于漠北，被明太祖朱元璋誉为"天下奇男子"。后卒于哈剌那海之衙庭。`
  },
  '王守仁': {
    name: '王守仁',
    dynasty: '明朝',
    from: '1368年',
    to: '1644年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail17.png',
    content: `字伯安，别号阳明。浙江绍兴府余姚县（今属宁波余姚）人，因曾筑室于会稽山阳明洞，自号阳明子，学者称之为阳明先生，亦称王阳明。明代著名的思想家、文学家、哲学家和军事家，陆王心学之集大成者，精通儒家、道家、佛家。弘治十二年（1499年）进士，历任刑部主事、贵州龙场驿丞、庐陵知县、右佥都御史、南赣巡抚、两广总督等职，晚年官至南京兵部尚书、都察院左都御史。因平定宸濠之乱军功而被封为新建伯，隆庆年间追赠新建侯。谥文成，故后人又称王文成公。
    王守仁（心学集大成者）与孔子（儒学创始人）、孟子（儒学集大成者）、朱熹（理学集大成者）并称为孔、孟、朱、王。
    王守仁的学说思想王学（阳明学），是明代影响最大的哲学思想。其学术思想传至中国、日本、朝鲜半岛以及东南亚，立德、立言于一身，成就冠绝有明一代。弟子极众，世称姚江学派。其文章博大昌达，行墨间有俊爽之气。有《王文成公全书》。`
  },
  '常遇春': {
    name: '常遇春',
    dynasty: '明朝',
    from: '1330年',
    to: '1369年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/106.png',
    content: `字伯仁，号燕衡，南直隶凤阳府怀远县(今安徽省蚌埠市怀远县)人。元末红巾军杰出将领，明朝开国名将。
    元顺帝至正十五年(1355年)，归附朱元璋，自请为前锋，力战克敌，尝自言能将十万众，横行天下，军中称常十万，官至中书平章军国重事，兼太子少保，封鄂国公。洪武二年，北伐中原，暴卒军中，年仅四十，用宋太宗丧韩王赵普故事，追赠翊运推诚宣德靖远功臣、开府仪同三司、上柱国、太保、中书右丞相，追封开平王，谥号忠武，配享太庙。`
  },
  '刘基': {
    name: '刘基',
    dynasty: '明朝',
    from: '1311年',
    to: '1375年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/.png',
    content: `字伯温，浙江青田(今浙江文成)人。元末明初政治家、文学家，明朝开国元勋。
    元至顺年间，刘基举进士。至正十九年(1359年)，受朱元璋礼聘而至。他上书陈述时务十八策，倍受宠信。参与谋划平定张士诚、陈友谅与北伐中原等军事大计。吴元年(1367年)为太史令，进《戊申大统历》。奏请立法定制，以止滥杀。朱元璋即位后，他奏请设立军卫法，又请肃正纪纲，曾谏止建都于凤阳。洪武三年(1370年)，封诚意伯，故又称刘诚意。次年赐归。刘基居乡隐形韬迹，只饮酒弈棋，口不言功。因左丞相胡惟庸诬陷而被夺禄。入京谢罪后，不久即逝世。明武宗时赠太师，谥号"文成"。
    刘基精通天文、兵法、数理等，尤以诗文见长。诗文古朴雄放，不乏抨击统治者腐朽、同情民间疾苦之作。与宋濂、高启并称"明初诗文三大家"。著作均收入《诚意伯文集》。
    `
  },
  '李善长': {
    name: '李善长',
    dynasty: '明朝',
    from: '1314年',
    to: '1390年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/107.png',
    content: `字百室，濠州定远(今安徽省定远县)人。明朝开国功臣。李善长少时爱读书有智谋，后投靠朱元璋，跟随征战，出生入死，功劳颇多，比肩汉代丞相萧何。洪武初年任左丞相，后封宣国公，奉命监修《元史》，编写《太祖训录》、《大明集礼》等书。
    洪武三年(1370年)，授号"开国辅运推诚守正文臣"，晋升特进光禄大夫、左柱国、太师、中书左丞相，进爵韩国公，年禄四千石，子孙世袭，可谓位极人臣。
    洪武二十三年(1390年)，以胡惟庸党追问，朱元璋将李善长连同其妻女弟侄七十余人一并处死，时年七十七岁。南明弘光政权追谥襄愍。`
  },
  '胡惟庸': {
    name: '胡惟庸',
    dynasty: '明朝',
    from: '？',
    to: '1380年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/112.png',
    content: `明朝太监 ，原姓马，名和，小名三宝， 又作三保，云南昆阳(今晋宁昆阳街道)宝山乡知代村人。中国明朝航海家、外交家。
    郑和于明洪武四年(1371年)出生，是马哈只第二子，郑和有姐妹四人 。洪武十三年(1381年)冬明朝军队进攻云南，马和仅十岁，被明军副统帅蓝玉掠走至南京， 阉割成太监之后，进入朱棣的燕王府。永乐元年(1403年)，姚道衍和尚收马和为菩萨戒弟子 ，法名福吉祥 。
    永乐二年(1404年)，郑和立下赫赫战功。明成祖朱棣在南京御书"郑"字赐马和郑姓，以纪念战功，史称"郑和"。并升任为内官监太监，官至四品，地位仅次于司礼监。郑和有智略，知兵习战，明成祖对郑和十分信赖 。1405到1433年，郑和七下西洋，完成了人类历史上伟大的壮举，宣德八年(1433年)四月，郑和在印度西海岸古里国去世，赐葬南京牛首山。
    `
  },
  '徐达': {
    name: '徐达',
    dynasty: '明朝',
    from: '1332年',
    to: '1385年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/108.png',
    content: `字天德，濠州钟离(今安徽凤阳市)人，明朝开国军事统帅，淮西二十四将之一。
    徐达出身农家，元朝末年，徐达参加了朱元璋领导的起义军。至正二十三年(1363年)大败陈友谅。至正二十四年(1364年)，朱元璋以为左相国。二十七年(1367年)，率军消灭张士诚地方割据势力。同年，任征虏大将军，与副将常遇春一同挥师北伐，推翻元朝的统治。洪武元年(1368年)，攻入大都，灭亡元朝。以后，连年出兵打击元朝残余势力，官至太傅、中书右丞相、参军国事兼太子少傅，封魏国公。为人谨慎，善于治军，戎马一生，为明朝建立了不朽的功勋。`
  },
  '方孝孺': {
    name: '方孝孺',
    dynasty: '明朝',
    from: '1357年',
    to: '1402年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/113.png',
    content: `字希直，一字希古，号逊志，曾以"逊志"名其书斋，因其故里旧属缑城里，故称"缑城先生";又因在汉中府任教授时，蜀献王赐名其读书处为"正学"，亦称"正学先生"，浙江台州府宁海县人。明朝大臣、学者、文学家、散文家、思想家。
    方孝孺自幼聪明好学、机警敏捷，长大后拜大儒宋濂为师，为同辈人所推崇。洪武三十一年(1398年)，明太祖死，惠帝即位后，即遵照太祖遗训，召方孝孺入京委以重任，先后让他出任翰林侍讲及翰林学士。 燕王朱棣誓师"靖难"，挥军南下京师。惠帝亦派兵北伐，当时讨伐燕王的诏书檄文都出自方孝孺之手。 建文四年(1402年)五月，燕王进京后，文武百官多见风转舵，投降燕王。方孝孺拒不投降，结果被捕下狱。
    后因拒绝为发动"靖难之役"的燕王朱棣草拟即位诏书，方孝孺始终不屈。被施以凌迟杀害于南京聚宝门外， 时年四十六岁。南明弘光帝时追谥"文正"。`
  },
  '于谦': {
    name: '于谦',
    dynasty: '明朝',
    from: '？',
    to: '1457年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/109.png',
    content: `字廷益，号节庵，官至少保，世称于少保 ，汉族，浙江杭州府钱塘县(今浙江省杭州市上城区)人。明代大臣、民族英雄。
    永乐十九年(1421年)，于谦登进士第。宣德元年(1426年)，以御史职随明宣宗平定汉王朱高煦之乱，因严词斥责朱高煦而受宣宗赏识。后巡抚河南、山西。宣德五年(1430年)又以兵部右侍郎巡抚河南、山西等地。明英宗时因入京觐见时不向权臣王振送礼，遭诬陷下狱，因两省百姓、官吏乃至藩王力请而复任。土木之变后，英宗兵败被俘，他力排南迁之议，坚请固守，升任兵部尚书。明代宗即位，整饬兵备，部署要害，亲自督战，率师二十二万，列阵北京九门外，抵御瓦剌大军。瓦剌太师也先挟英宗逼和，他以"社稷为重，君为轻"，不许。也先无隙可乘，被迫释放英宗。和议后，于谦仍积极备战，挑选京军精锐分十团营操练，又遣兵出关屯守，边境得以安宁。当时朝务繁杂，于谦独运征调，合乎机宜。其号令明审，令行政达。他忧国忘身，口不言功，平素俭约，居所仅能遮蔽风雨。但因个性刚直，招致众人忌恨。`
  },
  '严嵩': {
    name: '严嵩',
    dynasty: '明朝',
    from: '1480年',
    to: '1567年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/110.png',
    content: `字惟中，号介溪，袁州府分宜介桥村(今江西省分宜县)人。 明孝宗弘治十八年(1505年)进士，累迁礼部尚书、翰林院学士。嘉靖二十一年(1542年)六十三岁时入阁，加少傅兼太子太师、谨身殿大学士，后改少师、华盖殿大学士，嘉靖二十七年(1548年)诬害夏言，再任内阁首辅，专擅国政近十五年之久。  
    严嵩在朝期间，陷害同僚，必置之死地而后快;同时他结党营私，贪赃纳贿，而他的党羽和子孙更是跋扈骄奢，横行朝廷。严嵩的专权乱政，使明王朝的国力衰弱，边疆防御受到严重破坏，人民惨遭蹂躏。晚年因事激怒嘉靖帝而失势，嘉靖四十一年(1562年)勒令致仕，嘉靖四十三年(1564年)严世蕃案发，其恶迹败露后，世宗下诏将他罢职，削籍为民，家产被抄，奸党与家人一一治罪。`
  },
  '张居正': {
    name: '张居正',
    dynasty: '明朝',
    from: '1525年',
    to: '1582年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/115.png',
    content: `字叔大，号太岳，汉族，幼名张白圭。江陵人，时人又称张江陵。明朝中后期政治家、改革家，万历时期的内阁首辅，辅佐万历皇帝朱翊钧开创了“万历新政”。 
    张居正5岁识字，7岁能通六经大义，12岁考中秀才，13岁时就参加了乡试，16岁中举人。1547年（嘉靖二十六年），23岁的张居正考中进士。1567年（隆庆元年）任吏部左侍郎兼东阁大学士。后迁任内阁次辅，为吏部尚书、建极殿大学士。隆庆六年，万历皇帝登基后，张居正代高拱为首辅。当时明神宗朱翊钧年幼，一切军政大事均由张居正主持裁决。 张居正在任内阁首辅10年中，实行了一系列改革措施。财政上清仗田地，推行“一条鞭法”，总括赋、役，皆以银缴，"太仓粟可支十年，周寺积金， 至四百余万"。军事上任用戚继光、李成梁等名将镇北边，用凌云翼、殷正茂等平定西南叛乱。吏治上实行综核名实，采取“考成法”考核各级官吏，“虽万里外，朝下而夕奉行”，政体为之肃然。 1582年（万历十年）7月9日（六月二十）卒，年五十八，赠上柱国，谥文忠（后均被褫夺），张居正也是明代唯一生前就被授予太傅、太师的大臣。为万历所忌，去世后被抄家，至明熹宗天启二年恢复名誉。著有《张太岳集》、《书经直解》、《帝鉴图说》等。`
  },
  '海瑞': {
    name: '海瑞',
    dynasty: '明朝',
    from: '1514年',
    to: '1587年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/226.png',
    content: `字汝贤，号刚峰，海南琼山(今海口市)人。明朝著名清官。海瑞一生，经历了正德、嘉靖、隆庆、万历四朝。
    嘉靖二十八年(1549年)海瑞参加乡试中举，初任福建南平教渝，后升浙江淳安和江西兴国知县，推行清丈、平赋税，并屡平冤假错案，打击贪官污吏，深得民心。历任州判官、户部主事、兵部主事、尚宝丞、两京左右通政、右佥都御史等职。他打击豪强，疏浚河道，修筑水利工程，力主严惩贪官污吏，禁止徇私受贿，并推行一条鞭法，强令贪官污吏退田还民，遂有"海青天"之誉。
    万历十五年(1587年)，海瑞病死于南京官邸。获赠太子太保，谥号忠介。海瑞死后，关于他的传说故事，民间广为流传。`
  },
  '左良玉': {
    name: '左良玉',
    dynasty: '明朝',
    from: '？',
    to: '1645年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/228.png',
    content: `字昆山，山东东昌府临清州(今山东临清)人。官至平贼将军、太子少保，封宁南侯。初在辽东与清军作战，曾受侯恂提拔。后在镇压农民军的战争中，不断扩大部队，日益骄横跋扈，拥兵自重。
    崇祯十七年(1644年)三月封宁南伯。南明福王朱由崧即位后，又晋为侯，镇守武昌。此时，弘光政权中马士英、阮大铖用事，排斥东林党人。他袒护东林党人，且怀有个人野心，于顺治二年(1645年)三月二十三日从武昌起兵，以清君侧为名，进军南京。未几，病死于九江舟中。子左梦庚率所部降清。`
  },
  '郑成功': {
    name: '郑成功',
    dynasty: '明朝',
    from: '1624年',
    to: '1662年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/227.png',
    content: `名森，表字明俨、大木，幼名福松，为东宁王朝的开国君王。郑成功原为中国南明政权的大将军，因蒙南明绍宗赐明朝国姓朱，赐名成功，世称“国姓爷”、“郑赐姓”、“郑国姓”、“朱成功”，又因蒙南明昭宗封延平王，称“郑延平”。尊称“延平郡王”、“开台尊王”、“开台圣王”等。1645年清军攻入江南，不久芝龙降清、田川氏在乱军中自尽；郑成功乃率领父亲旧部在中国东南沿海抗清，成为南明后期主要军事力量之一，一度由海路突袭、包围清江宁府（原明朝南京），但终遭清军击退，只能凭借海战优势固守海岛厦门、金门。1661年率军横渡台湾海峡，翌年击败荷兰东印度公司在台湾大员（今台湾台南市境内）的驻军，开启郑氏在台湾的统治，并大力发展生产，但不久即病死。郑成功死后，台湾民间陆续建立庙宇祭祀，其中以台南延平郡王祠最为重要。`
  },
  '刘伯温': {
    name: '刘伯温',
    dynasty: '明朝',
    from: '1311年',
    to: '1375年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/111.png',
    content: `字伯温，浙江青田(今浙江文成)人。元末明初政治家、文学家，明朝开国元勋。
    元至顺年间，刘基举进士。至正十九年(1359年)，受朱元璋礼聘而至。他上书陈述时务十八策，倍受宠信。参与谋划平定张士诚、陈友谅与北伐中原等军事大计。吴元年(1367年)为太史令，进《戊申大统历》。奏请立法定制，以止滥杀。朱元璋即位后，他奏请设立军卫法，又请肃正纪纲，曾谏止建都于凤阳。洪武三年(1370年)，封诚意伯，故又称刘诚意。次年赐归。刘基居乡隐形韬迹，只饮酒弈棋，口不言功。因左丞相胡惟庸诬陷而被夺禄。入京谢罪后，不久即逝世。明武宗时赠太师，谥号"文成"。
    刘基精通天文、兵法、数理等，尤以诗文见长。诗文古朴雄放，不乏抨击统治者腐朽、同情民间疾苦之作。与宋濂、高启并称"明初诗文三大家"。著作均收入《诚意伯文集》。`
  },
  '纪晓岚': {
    name: '纪晓岚',
    dynasty: '清朝',
    from: '1636年',
    to: '1912年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/detail18.png',
    content: `字晓岚，别字春帆，号石云，道号观弈道人、孤石老人，直隶河间府献县人，清代文学家、官员。
    清乾隆十九年(1754年)，考中进士，官至礼部尚书、协办大学士、太子少保。 曾任《四库全书》总纂官。
    嘉庆十年(1805年)，病逝，时年八十二岁，因其"敏而好学可为文，授之以政无不达"(嘉庆帝御赐碑文)，谥号"文达"。
    纪昀的仕宦生涯和学术活动展开在十八世纪中后期，正是中国思想文化史上一个重要的枢纽时期。纪昀一直是官方学术工作的领导人，凡有编辑之役、修书之事，他必在其间。他一生中领导和参与多部重要典籍编修。因此，纪昀是中国文化史上有重大贡献的学者。 一生悉付《四库全书》，其所著《阅微草堂笔记》和《纪文达公遗集》也流传下来。`
  },
  '多尔衮': {
    name: '爱新觉罗·多尔衮',
    dynasty: '清朝',
    from: '1612年',
    to: '1650年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/116.png',
    content: `清太祖努尔哈赤第十四子，阿巴亥第二子。明万历四十年（1612年）出生于赫图阿拉（今辽宁省新宾县老城）。清初杰出的政治家和军事家。
    天命十一年（1626年）封贝勒；天聪二年（1628年），17岁的多尔衮随皇太极出征，征讨蒙古察哈尔部。因为军功被赐号“墨尔根戴青”，成为正白旗旗主。天聪九年（1635年），多尔衮等率军前往收降蒙古林丹汗之子额哲并获得传国玉玺。崇德元年（1636年）因战功封和硕睿亲王，次年正月，皇太极令多尔衮追击朝鲜国王家属。崇德六年（1641年）至七年（1642年）的松锦大战中立下卓越战功。皇太极死后，多尔衮和济尔哈朗以辅政王身份辅佐皇太极第九子福临即帝位，称摄政王；顺治元年（1644年）指挥清军入关，清朝入主中原，先后封叔父摄政王、皇叔父摄政王、皇父摄政王。顺治七年（1650年）冬死于塞北狩猎途中，追封为“清成宗”，谥懋德修远广业定功安民立政诚敬义皇帝。两个月后，于顺治八年（1651年）二月剥夺多尔衮的封号，并掘其墓。乾隆四十三年（1778年），乾隆帝为其平反，恢复睿亲王封号，评价其“定国开基，成一统之业，厥功最著”。`
  },
  '洪承畴': {
    name: '洪承畴',
    dynasty: '清朝',
    from: '1593年',
    to: '1665年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/122.png',
    content: `字彦演，号亨九，福建泉州南安英都(今英都镇良山村霞美)人。 万历四十四年(1616年)进士，累官至陕西布政使参政，在明末农民起义的战事中屡立战功，升任陕西三边总督。崇祯年间转任蓟辽总督，松锦之战后投清朝，深受皇太极重视。
    清军入关后，顺治帝对洪承畴极为器重，拔擢他为大学士，负责南方战事。洪承畴采取"以抚为主，以剿为辅"的进军策略，以较少代价平定了江南。同时，洪承畴建议满人"习汉文，晓汉语"，了解汉人礼俗，倡导儒家学说，淡化了满汉之间的差异。也曾针对顺治皇帝迎达赖喇嘛提出意见。其意见甚多，大多被清廷信纳，加以推行，在洪承畴的推动下，传统文化的延续性得以保障，各民族逐渐和睦相处。
    顺治十年(1653年)受命经略湖广、广东、广西、云南、贵州等处，总督军务兼理粮饷。顺治十六年(1659年)督清军攻占云南后回北京。康熙四年(1665年)洪承畴逝世，康熙帝颁布御诏，赠少师，谥文襄，赐葬京师车道沟，立御碑。`
  },
  '范文程': {
    name: '范文程',
    dynasty: '清朝',
    from: '1597年',
    to: '1666年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/117.png',
    content: `字宪斗，号辉岳，辽东沈阳(今沈阳)人。清朝初期政治家、谋略家。曾事清太祖、清太宗、清世祖、清圣祖四代帝王，是清初一代重臣，清朝开国时的规制大多出自其手，更被视为文臣之首。
    范文程少好读书，于万历四十三年(1615年)在沈阳县学考取了秀才，时年18岁。万历四十六年(1618年)，后金八旗军攻下抚顺，范文程与兄范文寀主动求见努尔哈赤，成为清朝开国元勋之一。清太宗时期，他深受倚赖， 凡讨伐明朝的策略、策反明朝官员、进攻朝鲜、抚定蒙古、国家制度的建设等等，他都参与决策。康熙五年(1666年)，范文程去世，终年70岁。 康熙亲撰祭文，赐葬于怀柔县之红螺山，谥文肃。康熙皇帝亲笔书写"元辅高风"四个字，作为对他的最高评价。`
  },
  '鳌拜': {
    name: '鳌拜',
    dynasty: '清朝',
    from: '1610年',
    to: '1669年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/123.png',
    content: `瓜尔佳氏，满洲镶黄旗人。清朝三代元勋、权臣，苏完部落首领索尔果之孙，后金开国元勋费英东之侄，八门提督卫齐第三子。
    出身将门，精通骑射。跟随皇太极征战四方，攻克皮岛，参加松锦之战，平定农民起义，立下赫赫战功，成为皇太极最信任的武将，号称"满洲第一勇士"。皇太极病逝后，拥戴皇九子福临即位，成为议政大臣，位极人臣。顺治帝去世后，接受遗诏成为顾命辅政大臣，操握权柄、结党营私。康熙八年(1669)，康熙帝在索额图、黄锡衮、王弘祚等人支持下，逮捕鳌拜下狱论罪，囚死于牢中。
    康熙五十二年(1713)，念其旧劳，追赐一等阿思哈尼哈番。雍正时期，赐予祭葬，复一等公，加封号"超武"，世袭罔替。乾隆四十五年(1780)，追覆鳌拜功罪，命停袭公爵，仍袭一等男。`
  },
  '吴三桂': {
    name: '吴三桂',
    dynasty: '清朝',
    from: '1612年',
    to: '1678年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/118.png',
    content: `字长伯，一字月所，明朝辽东人，祖籍江南高邮(今江苏省高邮市)，锦州总兵吴襄之子，祖大寿外甥。明末清初著名的政治、军事人物。明崇祯时为辽东总兵，封平西伯，镇守山海关。崇祯皇帝登基，开武科取士，吴三桂夺得武科举人。不久，吴三桂又以父荫为都督指挥 。
    崇祯十七年(1644年)降清，在山海关大战中大败李自成，封平西王。顺治十六年(1659年)，吴三桂镇守云南，引兵入缅甸，迫缅甸王交出南明永历帝。康熙元年(1662年)，吴三桂杀南明永历帝于昆明。同年，晋封为平西亲王，与福建靖南王耿精忠、广东平南王尚可喜并称三藩。 康熙十二年(1673年)，下令撤藩。吴三桂自称周王、总统天下水陆大元帅、兴明讨虏大将军，发布檄文，史称“三藩之乱”。`
  },
  '纳兰明珠': {
    name: '纳兰明珠',
    dynasty: '清朝',
    from: '1635年',
    to: '1708年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/124.png',
    content: `叶赫那拉氏，字端范，满洲正黄旗人，康熙朝权臣，历任内务府总管、刑部尚书、兵部尚书、都察院左都御史、武英殿大学士、太子太傅等要职。纳兰明珠对康熙议撤三藩、统一台湾以及抗御外敌等重大事件中起到积极作用。康熙二十七年(1688年)因朋党之罪被罢黜，后虽官复原职但不再受到重用。康熙四十七年(1708年)病故。`
  },
  '年羹尧': {
    name: '年羹尧',
    dynasty: '清朝',
    from: '1679年',
    to: '1726年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/118.png',
    content: `字亮工，号双峰，安徽凤阳府怀远(今安徽省怀远县)人，后改隶汉军镶黄旗，清朝名将。
    康熙三十九年(1700年)进士，官至四川总督、川陕总督、抚远大将军，加封太保、一等公。他运筹帷幄，驰骋疆场，曾配合各军平定西藏乱事，率清军平息青海罗卜藏丹津，立下赫赫战功。
    雍正二年(1724年)入京，得到雍正帝特殊宠遇，但翌年十二月，风云骤变，被雍正帝削官夺爵，列大罪九十二条，赐令自尽。`
  },
  '隆科多': {
    name: '隆科多',
    dynasty: '清朝',
    from: '？',
    to: '1728年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/125.png',
    content: `字竹筠，满洲镶黄旗人，清圣祖孝懿仁皇后之弟，一等公佟国维次子，清朝大臣。
    在有清一代，被皇帝公开以"舅舅"相称呼的，大概只有隆科多一人。就是这个隆科多，在康熙帝晚年诸皇子之间扑朔迷离、明争暗斗的皇位大战中地位非同一般，是康熙、雍正两朝皇权交替之际最为关键的核心人物。这与他在雍正即位之后飞黄腾达、显赫一时有着直接关系;他最终为雍正所猜忌，屡遭打击，直至被圈禁而死，实际上其根源也在于此。`
  },
  '鄂尔泰': {
    name: '鄂尔泰',
    dynasty: '清朝',
    from: '1677年',
    to: '1745年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/120.png',
    content: `字毅庵，满洲镶蓝旗人。清朝中期名臣，国子祭酒鄂拜之子，与田文镜、李卫并为雍正帝心腹。
    鄂尔泰先人投归清太祖，为世管佐领。祖父图彦突官户部郎中。康熙三十六年(1697年)，鄂尔泰二十岁中举，进入仕途。二十一岁，袭佐领世职，充任侍卫，累任内务府员外郎。鄂尔泰官运的转机是在雍正继位之时。雍正三年(1725年)，拜广西巡抚。雍正四年(1726年)调任云贵总督，兼辖广西，他在云南实行设置州县、改土归流，加强中央对西南地区的统治。雍正十三年(1735年)，雍正帝驾崩，与张廷玉等同受遗命辅政，担任总理事务大臣，历任军机大臣、领侍卫内大臣、议政大臣、经筵讲官，管翰林院掌院事，加衔太子太傅，充国史馆、三礼馆、玉牒馆总裁，赐号襄勤伯。`
  },
  '张廷玉': {
    name: '张廷玉',
    dynasty: '清朝',
    from: '1672年',
    to: '1755年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/126.png',
    content: `字衡臣，号砚斋， 安徽桐城人。清朝杰出政治家，大学士张英次子。
    康熙三十九年(1700年)进士，改庶吉士，授检讨，入值南书房，进入权力中枢。康熙朝，官至刑部左侍郎，整饬吏治。雍正帝即位后，历任礼部尚书、户部尚书、吏部尚书，拜保和殿大学士(内阁首辅)、首席军机大臣等职，完善了军机处制度。乾隆帝即位后，君臣渐生嫌疑，晚景凄凉，致仕归家。乾隆二十年(1755年)，卒于家中，年八十四，谥号"文和"，配享太庙，是整个清朝唯一一个配享太庙的汉臣。
    张廷玉先后任《亲征平定朔北方略》纂修官，《省方盛典》、《清圣祖实录》副总裁官，《明史》、《四朝国史》、《大清会典》、《世宗实录》总裁官。`
  },
  '刘墉': {
    name: '刘墉',
    dynasty: '清朝',
    from: '1720年',
    to: '1804年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/121.png',
    content: `字崇如，号石庵，山东诸城 人，清代政治家、书法家，首席军机大臣刘统勋长子。
    乾隆十六年(1751年)，考中进士，先后历任安徽学政、江苏学政、太原知府、冀宁道台、江宁知府、江西盐驿道、陕西按察使、内阁学士、湖南巡抚。乾隆四十七年(1782年)初调入京师后，历任都察院左都御史、工部尚书兼吏部尚书、吏部尚书兼兵部尚书、协办大学士兼吏部尚书。尚书房总师傅、管理国子监事务大臣等职。官至吏部尚书、体仁阁大学士、太子太保 。刘墉以为官清廉著称，深得百姓信赖，早在任江宁知府时就获赞誉 "少时知江宁府，颇以清介持躬，名播海内，妇人女子无不服其品谊，至以包孝肃比之"，朝鲜使臣称赞。以奉公守法、清正廉洁闻名于世。`
  },
  '和珅': {
    name: '和珅',
    dynasty: '清朝',
    from: '1750年',
    to: '1799年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/229.png',
    content: `钮祜禄氏，本名善保，字致斋，自号嘉乐堂、十笏园、绿野亭主人，奉天府开原县(今辽宁省清原县)人，满洲正红旗。清朝中期权臣、商人。
    和珅门荫入仕，精明强干。通过李侍尧案，巩固身份地位，深得乾隆帝宠信，并将十公主嫁给和珅长子丰绅殷德，促使和珅大权在握，成为皇亲国戚。先后担任和兼任众多关键职务，主要包括内阁首席大学士、领班军机大臣、吏部尚书、户部尚书、刑部尚书、理藩院尚书，兼任内务府总管、翰林院掌院学士、《四库全书》正总裁官、领侍卫内大臣、步军统领等数十个重要职务，拜文华殿大学士，封一等忠襄公。随着权力地位的成长，私欲日益膨胀。利用职务之便，结党营私，聚敛钱财，打击政敌。亲自经营工商业，开设当铺七十五间，设大小银号三百多间，建立英国东印度公司、广东十三行的商业往来。`
  },
  '林则徐': {
    name: '林则徐',
    dynasty: '清朝',
    from: '1785年',
    to: '1850年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/236.png',
    content: `福建省侯官人，字元抚，又字少穆、石麟，晚号俟村老人、俟村退叟、七十二峰退叟、瓶泉居士、栎社散人等，是清朝时期的政治家、思想家和诗人，官至一品，曾任湖广总督、陕甘总督和云贵总督，两次受命钦差大臣;因其主张严禁鸦片，在中国有民族英雄之誉。
    1839年，林则徐于广东禁烟时，派人明察暗访，强迫外国鸦片商人交出鸦片，并将没收鸦片于1839年6月3日在虎门销毁。虎门销烟使中英关系陷入极度紧张状态，成为第一次鸦片战争，英国入侵中国的借口。尽管林则徐一生力抗西方入侵，但对于西方的文化、科技和贸易则持开放态度，主张学其优而用之。根据文献记载，他至少略通英、葡两种外语，且着力翻译西方报刊和书籍。晚清思想家魏源将林则徐及幕僚翻译的文书合编为《海国图志》，此书对晚清的洋务运动乃至日本的明治维新都具有启发作用。1850年11月22日，林则徐在普宁老县城病逝。`
  },
  '肃顺': {
    name: '爱新觉罗·肃顺',
    dynasty: '清朝',
    from: '1816年',
    to: '1861年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/230.png',
    content: `满洲镶蓝旗人，晚清宗室、权臣，字雨亭，郑献亲王济尔哈朗七世孙，郑慎亲王乌尔恭阿第六子。自道光中期历任御前大臣、总管内务府大臣、户部尚书、协办大学士等职。深为咸丰帝信用，与其兄郑亲王端华及怡亲王载垣相互倚重，煊赫一时。咸丰十一年(1861年)七月，咸丰帝驾崩前受命为赞襄政务王大臣。是年十月二日夜，肃顺在护咸丰帝梓宫回京途中，行至密云被捕，随后被斩于菜市口，年四十五。`
  },
  '僧格林沁': {
    name: '僧格林沁',
    dynasty: '清朝',
    from: '？',
    to: '1865年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/237.png',
    content: `僧格林沁是成吉思汗二弟哈布图哈萨尔的二十六代孙，嘉庆十六年(1811年)六月五日出生在科尔沁左翼后旗哈日额日格苏木百兴图嘎查一普通台吉家庭，幼年的僧格林沁因家境贫寒，曾随父亲布和德力格尔为富人放牧。十二岁时被送到昌图老城文昌宫读书。
    咸丰五年(1855年)正月，僧格林沁战太平军，破东连镇木城，太平军冒死冲突，僧格林沁尽歼之，生擒太平天国北伐军统帅林凤祥。 因此殊功，咸丰帝于二月加封僧格林沁为博多勒噶台亲王，赏朝珠一盘、四团龙补褂一件。四月，诏世袭罔替，俸银加倍。六月，在山东冯官屯剿灭太平天国李开芳部，生擒李开芳。 林凤祥、李开芳都是太平天国的名将，骁勇善战，僧格林沁在两年之中，大小数百战，全部殄灭，无一漏网，因此威名震于海内。`
  },
  '曾国藩': {
    name: '曾国藩',
    dynasty: '清朝',
    from: '1811年',
    to: '1872年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/231.png',
    content: `初名子城，字伯涵，号涤生，宗圣曾子七十世孙。中国近代政治家、战略家、理学家、文学家，湘军的创立者和统帅。与胡林翼并称曾胡，与李鸿章、左宗棠、张之洞并称"晚清四大名臣"。官至两江总督、直隶总督、武英殿大学士，封一等毅勇侯，谥曰文正。
    曾国藩出生于晚清一个地主家庭，自幼勤奋好学，6岁入塾读书。8岁能读四书、诵五经，14岁能读《周礼》《史记》文选。道光十八年(1838)中进士，入翰林院，为军机大臣穆彰阿门生。累迁内阁学士，礼部侍郎，署兵、工、刑、吏部侍郎。与大学士倭仁、徽宁道何桂珍等为密友，以"实学"相砥砺。太平天国运动时，曾国藩组建湘军，力挽狂澜，经过多年鏖战后攻灭太平天国。`
  },
  '左宗棠': {
    name: '左宗棠',
    dynasty: '清朝',
    from: '1812年',
    to: '1885年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/238.png',
    content: `字季高， 号湘上农人。湖南湘阴人。晚清政治家、军事家、民族英雄 ，洋务派代表人物之一，与曾国藩等人并称"晚清中兴四大名臣"。
    左宗棠曾就读于长沙城南书院，二十岁乡试中举，虽此后在会试中屡试不第，但留意农事，遍读群书，钻研舆地、兵法。后由幕友而起，参与平定太平天国运动、兴办洋务运动、镇压捻军，又主持平定陕甘同治回乱、收复新疆并推动新疆置省，其间他历任闽浙总督、陕甘总督、两江总督，官至东阁大学士、军机大臣，封二等恪靖侯。中法战争时，自请赴福建督师，1885年(光绪十一年)在福州病逝，享年七十四岁。 清廷追赠太傅，谥号"文襄"，并入祀昭忠祠、贤良祠。`
  },
  '奕': {
    name: '奕',
    dynasty: '清朝',
    from: '1833年',
    to: '1898年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/232.png',
    content: `爱新觉罗·奕訢，号乐道堂主人，清末政治家、洋务运动主要领导者，清朝十二家铁帽子王之一。道光帝第六子，咸丰帝同父异母兄弟，生母为孝静成皇后博尔济吉特氏，道光帝遗诏封"恭亲王"。咸丰年间，奕訢于1853年到1855年之间担任领班军机大臣。在第二次鸦片战争中，奕訢授命为全权钦差大臣，负责与英、法、俄谈判，并且签订了《北京条约》。1861年，咸丰帝过世，奕訢与两宫太后联合发动辛酉政变，成功夺取了政权，被授予议政王之衔。
    从1861年到1884年，奕訢任领班军机大臣与领班总理衙门大臣，期间虽在1865年遭慈禧太后猜忌被革除议政王头衔，但依旧身处权力中心。1884年终于因中法战争失利被罢黜，一直到1894年以善后中日甲午战争失败，才再度被起用。从1894年到1898年任领班军机大臣与领班总理衙门大臣。1898年逝世，谥号为"忠"。`
  },
  '李鸿章': {
    name: '李鸿章',
    dynasty: '清朝',
    from: '1823年',
    to: '1901年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/239.png',
    content: `晚清名臣，洋务运动的主要领导人之一，安徽省合肥人，世人多称“李中堂”，因行二，故民间又称“李二先生”。本名章铜，字渐甫或子黻[fú]，号少荃(泉)，晚年自号仪叟，别号省心。
    李鸿章是淮军、北洋水师的创始人和统帅、洋务运动的领袖、晚清重臣，建立了中国第一支西式海军北洋水师。官至东宫三师、文华殿大学士、北洋通商大臣、直隶总督，爵位一等肃毅伯。其一生中参与一系列重大历史事件，包括镇压太平天国运动、镇压捻军起义、洋务运动、甲午战争等，代表清政府签订了《越南条约》《马关条约》《中法简明条约》《辛丑条约》等一系列不平等条约。
    日本首相伊藤博文视其为“大清帝国中唯一有能耐可和世界列强一争长短之人”，德国海军大臣柯纳德称其为“东方俾斯麦”，慈禧太后视其为“再造玄黄之人”。与曾国藩、张之洞、左宗棠并称为“中兴四大名臣”。死后追赠太傅，晋一等肃毅侯，谥文忠。著作收于《李文忠公全集》。
    `
  },
  '荣禄': {
    name: '荣禄',
    dynasty: '清朝',
    from: '1836年',
    to: '1903年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/233.png',
    content: `字仲华，号略园，瓜尔佳氏， 满洲正白旗人，晚清大臣。
    出身于世代军官家庭，以荫生晋工部员外郎，后任内务府大臣，工部尚书，出为西安将军。因为受到慈禧太后的青睐，留京任步军统领，总理衙门大臣，兵部尚书。辛酉政变后，为慈禧太后和恭亲王奕欣赏识，官至总管内务府大臣，加太子太保，转文华殿大学士。光绪二十九年，卒，赠太傅，谥文忠，晋一等男爵。编有《武毅公事略》、《荣文忠公集》、《荣禄存札》。其女瓜尔佳·幼兰是末代皇帝溥仪的生母，被慈禧太后收为养女。`
  },
  '张之洞': {
    name: '张之洞',
    dynasty: '清朝',
    from: '1837年',
    to: '1909年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/240.png',
    content: `字孝达，号香涛，时为总督，称"帅"，故时人皆呼之为"张香帅"。 晚清名臣、清代洋务派代表人物，祖籍直隶南皮，出生于贵州兴义府(今安龙县 )。咸丰二年(1852年)十六岁中顺天府解元，同治二年(1863年)二十七岁中进士第三名探花，授翰林院编修，历任教习、侍读、侍讲、内阁学士、山西巡抚、两广总督、湖广总督、两江总督(多次署理，从未实授)、军机大臣等职，官至体仁阁大学士。
    张之洞早年是清流派首领，后成为洋务派的主要代表人物。教育方面，他创办了自强学堂(今武汉大学前身)、三江师范学堂(今南京大学前身)、湖北农务学堂(今华中农业大学前身) 、湖北武昌蒙养院、湖北工艺学堂、慈恩学堂(南皮县第一中学)、广雅书院等。 政治上主张"中学为体，西学为用"。工业上创办汉阳铁厂、大冶铁矿、湖北枪炮厂等。八国联军入侵时，大沽炮台失守，张之洞会同两江总督刘坤一与驻上海各国领事议订"东南互保"，并镇压维新派的唐才常、林圭、秦力山等自立军起义，光绪三十四年(1908年)11月，以顾命重臣晋太子太保，次年病卒，谥文襄。有《张文襄公全集》。张之洞与曾国藩、李鸿章、左宗棠并称"晚清中兴四大名臣"。`
  },
  '袁世凯': {
    name: '袁世凯',
    dynasty: '清朝',
    from: '1859年',
    to: '1916年',
    img: 'https://hmqn.zhijingyuntech.cn/officer/234.png',
    content: `号容庵、洗心亭主人，汉族，河南项城人，故人称"袁项城"。早年发迹于朝鲜，归国后在天津小站训练新军。清末新政期间积极推动近代化改革。辛亥革命期间逼清帝溥仪退位，以和平的方式推翻清朝，成为中华民国临时大总统。1913年镇压二次革命，同年当选为首任中华民国大总统，1914年颁布《中华民国约法》，1915年12月宣布自称皇帝，改国号为中华帝国，建元洪宪，史称"洪宪帝制"。此举遭到各方反对，引发护国运动，袁世凯不得不在做了83天皇帝之后宣布取消帝制。1916年6月6日因尿毒症不治而亡，归葬于河南安阳。
    袁世凯的荣辱功过各有评说，有人说他是"独夫民贼" 、"窃国大盗" ，也有人认为他对中国的近代化做出贡献，是真正的改革家。 总之，袁世凯是中国近代史上最具争议的人物之一。`
  },
}