export default {
  '商': {
    time: '前1600-前1046',
    list: [
      {
        time: '-1419',
        content: `
        商朝(约公元前1600年-约公元前1046年)，是中国历史上的第二个朝代，是中国第一个有直接的同时期的文字记载的王朝。商朝经历了三个大的阶段。第一阶段是"先商";第二阶段是"早商";第三阶段是"晚商"，前后相传17世31王，延续500余年。
      商的先世商族是兴起于黄河中下游的一个部落，传说它的始祖契与禹同时。夏朝方国商国君主商汤率方国于鸣条之战灭夏后，以"商"为国号 ，在亳 建立商朝。之后，商朝国都频繁迁移，至其后裔盘庚迁殷后，国都才稳定下来，在殷建都达273年，因此商朝又被后世称为"殷"或"殷商"。  盘庚死后，王位由其弟小辛继立。小辛死后，传弟小乙。小乙死后，继立的是自己的儿子武丁。在武丁统治的五十几年间，是商王朝最为强盛的时期。 商朝的末代君主帝辛于牧野之战被周武王击败后自焚而亡。`
      }
    ]
  },
  '西周': {
    time: '前1046-前770',
    list: [
      {
        time: '-892',
        content: `
        公元前892年

周室中衰

戎狭侵周
      `
      }
    ]
  },
  '东汉': {
    time: '24-220',
    list: [
      {
        time: '215',
        content: `
        公元215年（建安二十年），农历乙未。

三月，曹操亲率大军十万，进攻汉中的张鲁，至十一月，张鲁归降，曹操收汉中﹐统一北方。

五月，韩遂死，凉州(今甘肃张家川)将曲演、蒋石等斩杀韩遂，将其首级献与曹操。

七月，孙权与刘备为荆州拥有权爆发冲突，最后刘备向孙权提出和议，两家复结盟约，以湖水为界中分荆州。

八月，孙权乘曹操远征张鲁之机，率十万大军亲征合肥，守将张辽、李典、乐进奋战，孙权此战损兵折将，无功而返，为第二次合肥之战
      `
      }
    ]
  },
  '三国': {
    time: '220-265',
    list: [
      {
        time: '255',
        content: `
        
        公元255年，农历乙亥猪年，曹魏正元二年，蜀汉延熙十八年，东吴五凤二年。

        毋丘俭与文钦讨伐司马师
        
        吴国丞相孙峻率领骠骑将军吕据、左将军会稽人留赞袭击寿春
        
        姜维第八次北伐、文钦投降吴国。
                        `
      }
    ]
  },
}