export default [
  {
    name: "上古",
    title: "",
    width: "100%",
    height: "200",
    left: "0",
    top: "0",
    color: "#609393",
    from: "",
    to: "",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%281%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    史前文化是指没有文字记录之前的人类社会所产生的文化。考古学上的中国史前社会从发现古人类开始，下限为发现甲骨文的殷墟年代，也就是商代盘庚迁殷之前的历史时期；
     历史学所指的中国史前社会是有了文献记载之前的历史时期，即西周有了共和纪年之前的阶段。
　　中国史前文化按照考古年代主要分为旧石器时代、新石器时代、金石并用时期以及青铜时代。史前考古学着重从史前文化遗址的地质、器物、古人类、古生物遗存来研究，历史考古学则通过文字、铭刻、古建筑等方面考察古人类的历史。

`,
  },
  {
    name: "夏",
    title: "",
    width: "100%",
    height: "540",
    left: "0",
    top: `200`,
    color: "#97ca67",
    from: "-2070",
    to: "-1660",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%282%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
  
    夏朝(约前2070~前1600  )是中国史书中记载的第一个世袭制朝代。 一般认为夏朝共传14代，17后 (夏统治者在位称"后"，去世后称"帝")，延续约471年 ，为商朝所灭。
    根据史书记载，禹本来传位于伯益，但伯益却让位给禹的儿子启，这段历史被看作是中国历史上"家天下"的开始 。从夏朝的建立开始。夏的十一支姒姓部落与夏后氏中央王室在血缘上有宗法关系，政治上有分封关系，经济上有贡赋关系，大致构成夏王朝的核心领土范围。夏西起河南省西部、山西省南部，东至河南省、山东省和河北省三省交界处，南达湖北省北部，北及河北省南部。这个区域的地理中心是今河南偃师、登封、新密、禹州一带。
              
`,
  },
  {
    name: "商",
    title: "",
    width: "100%",
    height: "600",
    left: "0",
    top: `${200 + 540}`,
    color: "#fdca34",
    from: "-1600",
    to: "-1046",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%283%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2823%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    商朝(约公元前1600年-约公元前1046年)，是中国历史上的第二个朝代，是中国第一个有直接的同时期的文字记载的王朝。商朝经历了三个大的阶段。第一阶段是"先商";第二阶段是"早商";第三阶段是"晚商"，前后相传17世31王，延续500余年。
    商的先世商族是兴起于黄河中下游的一个部落，传说它的始祖契与禹同时。夏朝方国商国君主商汤率方国于鸣条之战灭夏后，以"商"为国号 ，在亳 建立商朝。之后，商朝国都频繁迁移，至其后裔盘庚迁殷后，国都才稳定下来，在殷建都达273年，因此商朝又被后世称为"殷"或"殷商"。  盘庚死后，王位由其弟小辛继立。小辛死后，传弟小乙。小乙死后，继立的是自己的儿子武丁。在武丁统治的五十几年间，是商王朝最为强盛的时期。 商朝的末代君主帝辛于牧野之战被周武王击败后自焚而亡。
`,
  },
  {
    name: "西周",
    title: "",
    width: "100%",
    height: "300",
    left: "0",
    top: `${200 + 540 + 600}`,
    color: "#ca97ca",
    from: "-1046",
    to: "-770",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%284%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2824%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    西周(前1046~前771年)，中国历史上的朝代。公元前十一世纪周武王灭商，建国号为周，定都于镐(陕西长安沣河以东)，周成王亲政后，营造新都成周(河南洛阳)，宅兹中国、大封诸侯，还命周公东征、制礼作乐，加强了西周王朝的统治 。周成王、周康王统治期间，社会安定、百姓和睦、"刑错四十余年不用"，史称"成康之治"。周懿王继位后政治日趋腐败，国势不断衰落，由于西戎屡次进攻，被迫将都城迁犬丘(陕西兴平东南) 。周厉王前后， 私有土地日益发展， 公元前841年的国人暴动预示着奴隶制危机的到来， 王权从此衰落。周宣王不籍千亩， 标志着井田制在王畿内的崩溃。公元前771年周幽王被犬戎和申侯杀死，次年周平王东迁洛邑。历史上把平王东迁之前称之为西周，西周从武王灭商到幽王亡国， 共传12王11代。

`,
  },
  {
    name: "春秋",
    title: "",
    width: "100%",
    height: "280",
    left: "0",
    top: `${200 + 540 + 600 + 300}`,
    color: "#9767ca",
    from: "-770",
    to: "-476",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%285%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    春秋，通常用来指中国东周前半期历史阶段，史称"春秋时期"，即自公元前770年至公元前476年这段历史时期。 据说是由于鲁国史官把当时各国重大事件，按年、季、月、日记录下来，一年分春、夏、秋、冬四季记录，简括起来就把这部编年史名为《春秋》。
    春秋时期开始于公元前770年(周平王元年)周平王东迁东周开始的一年，止于公元前476年(周元王元年)，战国前夕，总共295年。一说止于公元前453年，韩、赵、魏灭智氏，一说止于公元前403年，三家分晋。
`,
  },
  {
    name: "战国",
    title: "",
    width: "100%",
    height: "300",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280}`,
    color: "#663398",
    from: "-445",
    to: "-221",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%286%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    战国时代指公元前475年－公元前221年（另有一说认为具体时间应该是从韩赵魏三家分晋开始算起直到秦始皇统一天下为止，即公元前403年－公元前221年）。

战国时代是中国古代重要的历史时期之一，其主体时间线处于东周末期。战国时代是华夏历史上分裂对抗最严重且最持久的时代之一。以三家分晋的结果为标志，奠定了战国七雄的格局。
`,
  },
  {
    name: "秦",
    title: "",
    width: "100%",
    height: "44",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300}`,
    color: "#fe6633",
    from: "-221",
    to: "-207",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%287%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    战国时代指公元前475年－公元前221年（另有一说认为具体时间应该是从韩赵魏三家分晋开始算起直到秦始皇统一天下为止，即公元前403年－公元前221年）。

战国时代是中国古代重要的历史时期之一，其主体时间线处于东周末期。战国时代是华夏历史上分裂对抗最严重且最持久的时代之一。以三家分晋的结果为标志，奠定了战国七雄的格局。
`,
  },
  // { name: '西楚', title: '', width: '', height: '', left: '', top: '', color: '#fe6633', from: '', to: '', kings: [{ name: '', age: '' }], describtion: '' },
  {
    name: "西汉",
    title: "",
    width: "100%",
    height: "220",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44}`,
    color: "#fecb00",
    from: "-206",
    to: "8",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%288%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    西汉是中国历史上的大一统王朝，共历十二帝 ，享国二百一十年，即公元前202年至公元8年 ，又称为前汉。
    秦末时期,天下揭竿而起，经过楚汉之争，刘邦击败项羽 ，公元前202年刘邦在山东定陶 称帝，定都长安。 西汉诸多制度上承袭秦制，汉初实行轻徭薄赋、休养生息的国策，社会经济迅速恢复。
    汉武帝继位后，推行推恩令、独尊儒术、加强中央集权。 对外开拓朝鲜、南据越南、西逾葱岭、北达阴山 ，奠定汉朝基本疆域;派张骞出使西域、沟通中原与西域各国的联系。西汉自武帝之后，皆以外戚辅政。汉昭帝继位后，霍光辅政。汉宣帝时期，设置西域都护府，正式将西域纳入版图 。汉元帝即位后，皇权旁落、外戚与宦官势力兴起，西汉开始走向衰败，又历经汉成帝、汉哀帝、汉平帝。公元8年王莽废除孺子婴太子之位，建立新朝，西汉灭亡。
`,
  },
  {
    name: "新",
    title: "",
    width: "100%",
    height: "26",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220}`,
    color: "#fe6600",
    from: "9",
    to: "23",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%289%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    新朝(9年1月15日-23年10月6日)，是继西汉之后由西汉外戚王莽建立的朝代。初始元年十二月癸酉朔(9年1月15日)，王莽废汉孺子(刘婴)为安定公，改汉历寅正为丑正，改元始建国，改国号为新，建都常安(今西安汉长安城遗址)，史称新莽。
      王莽称帝后进行了多项改革，包括:推行王田制，限制私有土地持有，超出部分为国有，无土地者由国家分配，一夫百亩，目的是解决西汉后期以来土地兼并严重的问题，但是完全无法执行;禁赏奴婢;推广国营事业;改革币制等。唯新朝政令繁琐，且朝令夕改，改革最终失败，导致新朝急速灭亡。
      新朝开创了中国历史上通过禅让称帝成功的先河，因为传统史观相对于通过战争革命取得政权，比较鄙弃禅位这种移转政权的方式，所以王莽一直被中国史学家误认为是"伪君子"。中国古代史学家对新朝的评价几乎都是负面的，尤其是《汉书》视王莽为逆臣贼子。后世亦是按汉书观点评价王莽，直到清末之后，评价才有所改变。
`,
  },
  // { name: '玄汉', title: '', width: '100%', height: '', left: '', top: '', color: '#fe6600', from: '', to: '', kings: [{ name: '', age: '' }], describtion: '' },
  {
    name: "东汉",
    title: "",
    width: "100%",
    height: "100",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26}`,
    color: "#98cb00",
    from: "24",
    to: "220",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2810%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2825%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    东汉(25年-220年)，是中国历史上继西汉之后又一个大一统的中原王朝，传八世共十四帝，享国一百九十五年，与西汉统称两汉。新朝末年爆发绿林赤眉起义，西汉宗室刘秀趁势而起。公元25年，刘秀称帝于鄗城，后定都于雒阳 ，延续"汉"的国号，史称东汉。 东汉时，三公权力被大幅削弱，尚书台权力得到提升。 汉明帝、汉章帝在位期间，东汉王朝进入鼎盛时期，史称明章之治。 汉章帝后期，外戚日益跋扈。汉和帝继位以后，扫灭外戚，使东汉国力达到极盛，史称之为永元之隆。
      东汉中后期太后称制、外戚干政，幼君多借助宦官才能亲政，史称戚宦之争，朝政日益腐败，豪强势力大肆兼并土地。汉桓帝、汉灵帝在位时期，昏庸无道、横征暴敛、卖官鬻爵，农民在多重残酷压榨下不堪重负，公元184年爆发黄巾之乱，朝廷令各州郡自行募兵，方将民变基本平定，却导致地方豪强拥兵自重。初平元年(190年)，董卓挟献帝迁都长安 ，自此朝廷大权旁落，揭开了东汉末年军阀混战的序幕。 董卓被杀死后，建安元年西归(196年) ，曹操迎汉献帝迁都许昌。 公元220年，曹丕篡汉，东汉覆灭，进入三国割据时期。
`,
  },
  {
    name: "魏",
    title: "三国",
    width: "110",
    height: "40",
    left: "120",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100}`,
    color: "#fe3300",
    from: "220",
    to: "265",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2811%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2826%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: ` 三国(220年-280年)是中国历史上位于汉朝之后、晋朝之前的一段历史时期。这一个时期，先后出现了曹魏、蜀汉、东吴三个主要政权。
    220年，汉朝丞相曹丕迫使汉献帝禅让帝位，定都洛阳，国号"魏"，史称曹魏，标志着汉朝时代的正式结束。221年刘备称帝，定都成都，史称蜀汉。229年孙权称帝，定都建邺，国号"吴"，史称东吴。
    190年，汉朝的中央集权制度崩溃，军阀四起，天下大乱。到208年的赤壁之战时，曹操被孙刘联军击败，从此，奠定了三国鼎立的雏型。此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。曹魏后期的实权渐被司马懿掌控。263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。
266年2月8日，魏国权臣司马炎迫使魏元帝禅让帝位，建国号为"晋"，史称西晋，三国时代结束，晋朝时代开始。280年，晋灭东吴，统一全国。至此，三家归晋。`,
  },
  {
    name: "",
    title: "三国",
    width: "120",
    height: "40",
    left: "60f",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100}`,
    color: "#fe3300",
    from: "220",
    to: "265",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2811%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2826%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: ` 三国(220年-280年)是中国历史上位于汉朝之后、晋朝之前的一段历史时期。这一个时期，先后出现了曹魏、蜀汉、东吴三个主要政权。
    220年，汉朝丞相曹丕迫使汉献帝禅让帝位，定都洛阳，国号"魏"，史称曹魏，标志着汉朝时代的正式结束。221年刘备称帝，定都成都，史称蜀汉。229年孙权称帝，定都建邺，国号"吴"，史称东吴。
    190年，汉朝的中央集权制度崩溃，军阀四起，天下大乱。到208年的赤壁之战时，曹操被孙刘联军击败，从此，奠定了三国鼎立的雏型。此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。曹魏后期的实权渐被司马懿掌控。263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。
266年2月8日，魏国权臣司马炎迫使魏元帝禅让帝位，建国号为"晋"，史称西晋，三国时代结束，晋朝时代开始。280年，晋灭东吴，统一全国。至此，三家归晋。`,
  },
  {
    name: "吴",
    title: "三国",
    width: "60",
    height: "46",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100}`,
    color: "#3333fe",
    from: "220",
    to: "265",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2811%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2826%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: ` 三国(220年-280年)是中国历史上位于汉朝之后、晋朝之前的一段历史时期。这一个时期，先后出现了曹魏、蜀汉、东吴三个主要政权。
    220年，汉朝丞相曹丕迫使汉献帝禅让帝位，定都洛阳，国号"魏"，史称曹魏，标志着汉朝时代的正式结束。221年刘备称帝，定都成都，史称蜀汉。229年孙权称帝，定都建邺，国号"吴"，史称东吴。
    190年，汉朝的中央集权制度崩溃，军阀四起，天下大乱。到208年的赤壁之战时，曹操被孙刘联军击败，从此，奠定了三国鼎立的雏型。此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。曹魏后期的实权渐被司马懿掌控。263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。
266年2月8日，魏国权臣司马炎迫使魏元帝禅让帝位，建国号为"晋"，史称西晋，三国时代结束，晋朝时代开始。280年，晋灭东吴，统一全国。至此，三家归晋。`,
  },
  {
    name: "蜀",
    title: "三国",
    width: "80",
    height: "34",
    left: "60",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100}`,
    color: "#fecb00",
    from: "220",
    to: "265",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2811%29.png', 'https://hmqn.zhijingyuntech.cn/map/map%20%2826%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: ` 三国(220年-280年)是中国历史上位于汉朝之后、晋朝之前的一段历史时期。这一个时期，先后出现了曹魏、蜀汉、东吴三个主要政权。
    220年，汉朝丞相曹丕迫使汉献帝禅让帝位，定都洛阳，国号"魏"，史称曹魏，标志着汉朝时代的正式结束。221年刘备称帝，定都成都，史称蜀汉。229年孙权称帝，定都建邺，国号"吴"，史称东吴。
    190年，汉朝的中央集权制度崩溃，军阀四起，天下大乱。到208年的赤壁之战时，曹操被孙刘联军击败，从此，奠定了三国鼎立的雏型。此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。曹魏后期的实权渐被司马懿掌控。263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。
266年2月8日，魏国权臣司马炎迫使魏元帝禅让帝位，建国号为"晋"，史称西晋，三国时代结束，晋朝时代开始。280年，晋灭东吴，统一全国。至此，三家归晋。`,
  },
  {
    name: "西晋",
    title: "",
    width: "100%",
    height: "72",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100 + 40}`,
    color: "#cb66cb",
    from: "265",
    to: "316",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2812%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `西晋(266年 -316年 )，是中国历史上三国时期之后的统一王朝，首都洛阳。从晋武帝建国开始，传四帝，国祚51年，与后来的东晋合称晋朝。 西晋是魏晋南北朝长期分裂时期中的短暂统一，所谓"昙花一现"。
    三国末期，司马懿与司马师、司马昭二子都是曹魏权臣。司马昭死后，其子司马炎于265年取代曹魏建立新政权，改国号为晋， 定都洛阳。晋280年灭孙吴，结束了三国鼎立的分裂局面，重新统一中国。据现代学者推测，永康元年(公元300年)中国人口已恢复回3500万人,形成"太康盛世"的局面。 。
    西晋时期面临的外部局势是大量游牧部落内迁，关中和凉州的外族已占当地人口一半，这些外族被世族收作奴婢  。 灭吴后，西晋举国沉浸在奢侈腐败的气象之中。晋武帝出身世族，其家族经过长期发展，早就形成庞大的权贵集团，政风黑暗，贪赃枉法，贿赂风行， 为西晋亡国和五胡十六国埋下伏笔。八王之乱后西晋元气大伤，内迁的诸民族乘机举兵，造成五胡乱华的局面，大量百姓与世族开始南渡。313年晋愍帝迁都长安，316年长安失守，西晋灭亡。次年，皇族司马睿在建康称帝，史称东晋。
`,
  },
  {
    name: "东晋",
    title: "东晋十六国",
    width: "110",
    height: "100",
    left: "0",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100 + 40 + 72}`,
    color: "#fecb98",
    from: "317",
    to: "420",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2813%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `东晋(317年~420年)，是由西晋皇族司马睿南迁后建立起来的王朝。此外，史书中又仿东汉称中汉，称东晋为中晋，寓以晋室中兴之意;又东晋统治地区大部分在江东，古称江左，因此以江左代指东晋。
    东晋是门阀士族政治，与北方的五胡十六国并存，这一历史时期又称东晋十六国。东晋时代，也曾经内部四分五裂。东晋与之前的孙吴以及其后的宋、齐、梁、陈，合称为六朝。
    东晋曾多次试图北伐，但由于内部不团结，除了最后篡晋的刘裕取得一定成果外，其余都无建树。祖逖本有希望恢复旧土，但他被司马睿挟制，郁郁而终。桓温的北伐则先后被苻雄、慕容垂击败。太元八年(383年)，前秦天王苻坚率兵南侵，东晋宰相谢安力主抗击，派谢石、谢玄率军，在淝水之战大获全胜，苻坚只身逃回北方，南北分立之势从此而成。后有桓玄叛乱，废安帝，自立为天子，后为大将刘裕所平，拥恭帝，然大权落裕。
    元熙二年(420年)，宋公刘裕废除晋恭帝，建立刘宋，东晋灭亡，中国历史进入南北朝时期。`,
  },
  {
    name: "十六国",
    title: "东晋十六国",
    width: "120",
    height: "120",
    left: "110",
    top: `${200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100 + 40 + 72}`,
    color: "#9898fe",
    from: "317",
    to: "420",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2813%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `东晋(317年~420年)，是由西晋皇族司马睿南迁后建立起来的王朝。此外，史书中又仿东汉称中汉，称东晋为中晋，寓以晋室中兴之意;又东晋统治地区大部分在江东，古称江左，因此以江左代指东晋。
    东晋是门阀士族政治，与北方的五胡十六国并存，这一历史时期又称东晋十六国。东晋时代，也曾经内部四分五裂。东晋与之前的孙吴以及其后的宋、齐、梁、陈，合称为六朝。
    东晋曾多次试图北伐，但由于内部不团结，除了最后篡晋的刘裕取得一定成果外，其余都无建树。祖逖本有希望恢复旧土，但他被司马睿挟制，郁郁而终。桓温的北伐则先后被苻雄、慕容垂击败。太元八年(383年)，前秦天王苻坚率兵南侵，东晋宰相谢安力主抗击，派谢石、谢玄率军，在淝水之战大获全胜，苻坚只身逃回北方，南北分立之势从此而成。后有桓玄叛乱，废安帝，自立为天子，后为大将刘裕所平，拥恭帝，然大权落裕。
    元熙二年(420年)，宋公刘裕废除晋恭帝，建立刘宋，东晋灭亡，中国历史进入南北朝时期。`,
  },
  {
    name: "宋",
    title: "南北朝",
    width: "110",
    height: "80",
    left: "0",
    top: `${
      200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100 + 40 + 72 + 100
    }`,
    color: "#cb9833",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "齐",
    title: "南北朝",
    width: "110",
    height: "40",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80
    }`,
    color: "#cbcb66",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "梁",
    title: "南北朝",
    width: "110",
    height: "70",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40
    }`,
    color: "#b4cced",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "北魏",
    title: "南北朝",
    width: "120",
    height: "130",
    left: "110",
    top: `${
      200 + 540 + 600 + 300 + 280 + 300 + 44 + 220 + 26 + 100 + 40 + 72 + 120
    }`,
    color: "#6698cb",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "西魏",
    title: "南北朝",
    width: "60",
    height: "40",
    left: "110",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      120 +
      130
    }`,
    color: "#c28baa",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "东魏",
    title: "南北朝",
    width: "60",
    height: "40",
    left: "170",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      120 +
      130
    }`,
    color: "#66cbfe",
    from: "420",
    to: "589",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2814%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `南北朝(420年~589年 )是南朝和北朝的统称。南北朝时期中国南方和北方处于分裂状态，自东晋十六国至隋朝，始于420年刘裕建立南朝宋，止于589年隋灭南朝陈。
    南朝(420-589)承自东晋，由汉族建立，有南朝宋、南朝齐、南朝梁、南朝陈四朝，均以建康(今南京)为都;北朝(386-581)承自十六国，由鲜卑族建立，有北魏、东魏、西魏、北齐和北周五朝，北魏分裂为东魏、西魏，北齐取代东魏，北周取代西魏，北周灭北齐。出身于北周八柱国之一的李唐宗室修《晋书》奉北朝共为正统，司马光的《资治通鉴》则奉南朝为正统。
     南北朝前期仍是世族政治，社会阶层分为世族、齐民编户、依附户及奴婢，对外交流也很兴旺，东到日本和朝鲜半岛，西到西域、中亚、西亚，南到东南亚与南亚。此时也出现民族大融合的趋势，比如北魏孝文帝改革，进一步加速少数民族汉化的步伐，在北魏孝文帝以后，北朝官制模仿南朝，并沿至唐代。`,
  },
  {
    name: "隋",
    title: "",
    width: "100%",
    height: "54",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30
    }`,
    color: "#66cbcb",
    from: "581",
    to: "618",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2815%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `隋朝(581年~618年)是中国历史上承南北朝，下启唐朝的大统一朝代，享国三十七年。
    公元581年二月，北周静帝禅让于丞相杨坚，北周覆亡。隋文帝杨坚定国号为"隋"，定都大兴城(今陕西省西安市)。公元589年，隋军南下灭陈朝，统一中国，结束了自西晋末年以来中国长达近300年的分裂局面。隋文帝励精图治，开创了开皇之治繁荣局面。
    公元604年，隋炀帝杨广即位营建东都(今河南省洛阳市)， 又修建贯通南北的大运河，开创了万国来朝的"大业盛世"。 然而内外举措过度消耗国力，引发隋末民变。618年宇文化及等人在外发动兵变杀死隋炀帝;李渊逼杨侑禅让，国号"唐"。619年王世充逼杨侗禅位，国号"郑"， 隋朝彻底灭亡。
    隋朝在政治、经济、文化和外交等领域进行大改革。政治初创三省六部制，巩固中央集权，正式推行科举制，选拔优秀人才，弱化世族垄断仕官的现象，建立政事堂议事制、监察制、考绩制，强化了政府机制，根据南北朝的经验改革政治，兴建隋唐大运河以及驰道改善水陆交通线。 军事上继续推行完善府兵制，经济上实行均田制并改定赋役，减轻农民生产压力，又采取大索貌阅和输籍定样等清查户口措施增加财政收入。`,
  },
  {
    name: "陈",
    title: "隋",
    width: "80",
    height: "46",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70
    }`,
    color: "#c28baa",
    from: "581",
    to: "618",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2815%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `隋朝(581年~618年)是中国历史上承南北朝，下启唐朝的大统一朝代，享国三十七年。
    公元581年二月，北周静帝禅让于丞相杨坚，北周覆亡。隋文帝杨坚定国号为"隋"，定都大兴城(今陕西省西安市)。公元589年，隋军南下灭陈朝，统一中国，结束了自西晋末年以来中国长达近300年的分裂局面。隋文帝励精图治，开创了开皇之治繁荣局面。
    公元604年，隋炀帝杨广即位营建东都(今河南省洛阳市)， 又修建贯通南北的大运河，开创了万国来朝的"大业盛世"。 然而内外举措过度消耗国力，引发隋末民变。618年宇文化及等人在外发动兵变杀死隋炀帝;李渊逼杨侑禅让，国号"唐"。619年王世充逼杨侗禅位，国号"郑"， 隋朝彻底灭亡。
    隋朝在政治、经济、文化和外交等领域进行大改革。政治初创三省六部制，巩固中央集权，正式推行科举制，选拔优秀人才，弱化世族垄断仕官的现象，建立政事堂议事制、监察制、考绩制，强化了政府机制，根据南北朝的经验改革政治，兴建隋唐大运河以及驰道改善水陆交通线。 军事上继续推行完善府兵制，经济上实行均田制并改定赋役，减轻农民生产压力，又采取大索貌阅和输籍定样等清查户口措施增加财政收入。`,
  },
  {
    name: "北周",
    title: "隋",
    width: "80",
    height: "38",
    left: "80",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70
    }`,
    color: "#98cb98",
    from: "581",
    to: "618",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2815%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `隋朝(581年~618年)是中国历史上承南北朝，下启唐朝的大统一朝代，享国三十七年。
    公元581年二月，北周静帝禅让于丞相杨坚，北周覆亡。隋文帝杨坚定国号为"隋"，定都大兴城(今陕西省西安市)。公元589年，隋军南下灭陈朝，统一中国，结束了自西晋末年以来中国长达近300年的分裂局面。隋文帝励精图治，开创了开皇之治繁荣局面。
    公元604年，隋炀帝杨广即位营建东都(今河南省洛阳市)， 又修建贯通南北的大运河，开创了万国来朝的"大业盛世"。 然而内外举措过度消耗国力，引发隋末民变。618年宇文化及等人在外发动兵变杀死隋炀帝;李渊逼杨侑禅让，国号"唐"。619年王世充逼杨侗禅位，国号"郑"， 隋朝彻底灭亡。
    隋朝在政治、经济、文化和外交等领域进行大改革。政治初创三省六部制，巩固中央集权，正式推行科举制，选拔优秀人才，弱化世族垄断仕官的现象，建立政事堂议事制、监察制、考绩制，强化了政府机制，根据南北朝的经验改革政治，兴建隋唐大运河以及驰道改善水陆交通线。 军事上继续推行完善府兵制，经济上实行均田制并改定赋役，减轻农民生产压力，又采取大索貌阅和输籍定样等清查户口措施增加财政收入。`,
  },
  {
    name: "",
    title: "",
    width: "70",
    height: "38",
    left: "160",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70
    }`,
    color: "#98cb98",
    from: "",
    to: "",
    kings: [{ name: "", age: "" }],
    describtion: "",
  },
  {
    name: "北齐",
    title: "隋",
    width: "70",
    height: "30",
    left: "160",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70
    }`,
    color: "#98fecb",
    from: "581",
    to: "618",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2815%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `隋朝(581年~618年)是中国历史上承南北朝，下启唐朝的大统一朝代，享国三十七年。
    公元581年二月，北周静帝禅让于丞相杨坚，北周覆亡。隋文帝杨坚定国号为"隋"，定都大兴城(今陕西省西安市)。公元589年，隋军南下灭陈朝，统一中国，结束了自西晋末年以来中国长达近300年的分裂局面。隋文帝励精图治，开创了开皇之治繁荣局面。
    公元604年，隋炀帝杨广即位营建东都(今河南省洛阳市)， 又修建贯通南北的大运河，开创了万国来朝的"大业盛世"。 然而内外举措过度消耗国力，引发隋末民变。618年宇文化及等人在外发动兵变杀死隋炀帝;李渊逼杨侑禅让，国号"唐"。619年王世充逼杨侗禅位，国号"郑"， 隋朝彻底灭亡。
    隋朝在政治、经济、文化和外交等领域进行大改革。政治初创三省六部制，巩固中央集权，正式推行科举制，选拔优秀人才，弱化世族垄断仕官的现象，建立政事堂议事制、监察制、考绩制，强化了政府机制，根据南北朝的经验改革政治，兴建隋唐大运河以及驰道改善水陆交通线。 军事上继续推行完善府兵制，经济上实行均田制并改定赋役，减轻农民生产压力，又采取大索貌阅和输籍定样等清查户口措施增加财政收入。`,
  },
  {
    name: "唐",
    title: "",
    width: "100%",
    height: "300",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46
    }`,
    color: "#983398",
    from: "618",
    to: "907",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "唐",
    title: "",
    width: "100%",
    height: "80",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46
    }`,
    color: "#983398",
    from: "618",
    to: "907",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "武周",
    title: "唐",
    width: "100%",
    height: "24",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      80
    }`,
    color: "#fd97fd",
    from: "618",
    to: "907",
    kings: [{ name: "", age: "" }],
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "吐蕃",
    title: "唐",
    width: "25",
    height: "200",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46
    }`,
    color: "#fd9797",
    from: "618",
    to: "907",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "元",
    title: "",
    width: "100%",
    height: "210",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      90 +
      160
    }`,
    color: "#fdca67",
    from: "1271",
    to: "1368",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2819%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    元朝(1271年-1368年 )，是中国历史上首次由少数民族建立的大一统王朝，统治者为蒙古孛儿只斤氏。传五世十一帝，从1206年成吉思汗建立蒙古政权始为162年，从忽必烈定国号元开始历时98年。 元朝退出中原后的北元政权一直持续到1402年。
      1206年，成吉思汗统一蒙古各部，建立大蒙古国。先后攻灭西辽、西夏、花剌子模、金朝等政权。蒙哥汗去世后，引发了阿里不哥与忽必烈的汗位之争，促使大蒙古国分裂。1260年忽必烈即位称帝，建元"中统"，定都开平府(上都)。 1271年，忽必烈取《易经》"大哉乾元"之意改国号为"大元"，次年定都大都。1279年，彻底灭亡南宋流亡政权，结束了自唐末以来长期的混乱局面。 之后元朝持续对外扩张，进攻日本、缅甸、越南、爪哇等，但均遭失败。元朝中期皇位继承紊乱、政变频繁，政治始终未上正轨，而且汉化迟滞，发展不前。后期政治腐败，权臣干政，民族矛盾与阶级矛盾日益加剧，导致元末农民起义。 1368年，朱元璋建立明朝，随后北伐驱逐元廷攻占大都。此后元廷退居漠北，史称北元。1402年，元臣鬼力赤篡夺政权建立鞑靼，北元灭亡。
      元朝时期统一多民族国家进一步巩固，疆域超越历代。元朝废除尚书省和门下省，保留中书省与枢密院、御史台分掌政、军、监察三权，地方实行行省制度，开中国行省制度之先河。`,
  },
  {
    name: "吐蕃",
    title: "",
    show: false,
    width: "25",
    height: "450",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      200
    }`,
    color: "#ca97fd",
    from: "",
    to: "",
    kings: [{ name: "", age: "" }],
    describtion: ``,
  },
  {
    name: "南诏",
    title: "唐",
    width: "30",
    height: "130",
    left: "25",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      150
    }`,
    color: "#67fdca",
    from: "618",
    to: "907",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "回鹤",
    title: "唐",
    width: "25",
    height: "200",
    left: "206",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      50
    }`,
    color: "#663399",
    from: "618",
    to: "907",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2816%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `唐朝(618年-907年)，是继隋朝之后的大一统中原王朝，共历二十一帝，享国二百八十九年。

    隋末天下群雄并起，617年唐国公李渊于晋阳起兵，次年称帝建立唐朝，定都长安。唐太宗继位后开创贞观之治，为盛唐奠定基础。唐高宗承贞观遗风开创"永徽之治"，并于657年建东都洛阳 。690年，武则天改国号为周， 705年神龙革命后，恢复唐国号。 唐玄宗即位后缔造全盛的开元盛世，  天宝末全国人口达八千万左右。 安史之乱后藩镇割据、宦官专权导致国力渐衰;中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年爆发黄巢起义破坏了唐朝统治根基，907年朱温篡唐，唐朝覆亡。
    
    唐朝时万国来朝， 疆域空前辽阔，极盛时东起日本海、南据安南、西抵咸海、北逾贝加尔湖，是中国自秦以来第一个未修据胡长城的大一统王朝。 唐朝攻灭东突厥、薛延陀后，唐太宗被四夷各族尊为天可汗 。又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，并让日本、南诏、新罗、渤海国等藩属国学习自身的文化与制度。
    
    唐朝接纳各国交流学习，经济、社会、文化、艺术呈现出多元化、开放性等特点 ，诗、书、画、乐等方面涌现出大量名家，如诗仙李白、诗圣杜甫、诗魔白居易，书法家颜真卿，画圣吴道子，音乐家李龟年等。`,
  },
  {
    name: "十国",
    title: "五代十国",
    width: "90",
    height: "60",
    left: "55",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300
    }`,
    color: "#67cafd",
    from: "902",
    to: "979",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2817%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `五代十国(902年-979年) 是中国历史上的一段大分裂时期。这一称谓出自《新五代史》，是对五代(907年-960年 )与十国(902年-979年 )的合称。
    五代是指唐天佑四年(907年)唐朝灭亡后依次定都于中原地区的五个政权，即后梁、后唐、后晋、后汉和后周。天佑四年(907年)四月，梁王朱晃(本名温，唐帝赐名全忠，受禅前夕改名晃)接受唐哀帝李柷禅让，在中原地区建立后梁，定都东京开封府(今河南开封)，五代十国开始。 后周显德七年(960年)正月，赵匡胤发动陈桥兵变，黄袍加身， 接受周恭帝禅让，建立北宋，五代结束。
    在唐末、五代及宋初，中原地区之外存在过杨吴、桀燕等许多割据政权，其中前蜀、后蜀、南吴(杨吴)、南唐、吴越、闽国、南楚(马楚)、南汉、南平(荆南)、北汉等十个割据政权被《新五代史》及后世史学家统称十国。北宋建立后先后统一了尚存的南平、武平、后蜀、南汉、南唐、平海军、吴越、北汉等地方割据政权，形成了与契丹(辽)对峙的局面。`,
  },
  {
    name: "五代",
    title: "五代十国",
    width: "86",
    height: "60",
    left: "145",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300
    }`,
    color: "#019797",
    from: "902",
    to: "979",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2817%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `五代十国(902年-979年) 是中国历史上的一段大分裂时期。这一称谓出自《新五代史》，是对五代(907年-960年 )与十国(902年-979年 )的合称。
    五代是指唐天佑四年(907年)唐朝灭亡后依次定都于中原地区的五个政权，即后梁、后唐、后晋、后汉和后周。天佑四年(907年)四月，梁王朱晃(本名温，唐帝赐名全忠，受禅前夕改名晃)接受唐哀帝李柷禅让，在中原地区建立后梁，定都东京开封府(今河南开封)，五代十国开始。 后周显德七年(960年)正月，赵匡胤发动陈桥兵变，黄袍加身， 接受周恭帝禅让，建立北宋，五代结束。
    在唐末、五代及宋初，中原地区之外存在过杨吴、桀燕等许多割据政权，其中前蜀、后蜀、南吴(杨吴)、南唐、吴越、闽国、南楚(马楚)、南汉、南平(荆南)、北汉等十个割据政权被《新五代史》及后世史学家统称十国。北宋建立后先后统一了尚存的南平、武平、后蜀、南汉、南唐、平海军、吴越、北汉等地方割据政权，形成了与契丹(辽)对峙的局面。`,
  },
  {
    name: "北宋",
    title: "北宋,辽",
    width: "100",
    height: "150",
    left: "55",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60
    }`,
    color: "#ca9767",
    from: "960",
    to: "1127",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2817%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    北宋与辽是同一时期并存的两个朝代，分治南北。
      北宋(960年-1127年)，是中国历史上继五代十国之后的朝代，传九位皇帝，享国167年。与南宋合称宋朝，又称两宋，因皇室姓赵，也称赵宋。
      显德七年(960年)，后周诸将发动陈桥兵变，拥立赵匡胤为帝，建立宋朝，定都东京开封府(河南开封) ，改元建隆。后通过杯酒释兵权，将兵权与财政权集中于中央，避免了中晚唐藩镇割据的乱象。 但也导致宋朝与辽国、西夏、金国的战争中失利。靖康元年(1126年)发生靖康之难，次年被金国灭亡。宋朝政治体制大体沿袭唐朝，采用分化事权方式，宰相职位由多人担任，还实行官衔与实际职务分离的官吏任用制度，对维护国家统一起了重要的作用，但也造成"积贫积弱"的局面。
      辽朝(907年-1125年 )，是中国历史上由契丹族建立的朝代，共传九帝，享国二百一十八年。
      907年，辽太祖耶律阿保机成为契丹可汗，916年始建年号，建国号"契丹"，定都上京临潢府(今内蒙古赤峰市巴林左旗) 。947年，辽太宗耶律德光率军南下中原，攻占汴京(今河南开封)，于汴京登基称帝，改国号"大辽"，改年号为"大同" 。983年复更名"大契丹"。1007年辽圣宗耶律隆绪迁都中京大定府(今内蒙古赤峰市宁城县)。1066年辽道宗耶律洪基复国号"大辽"。1125年被金朝所灭 。
辽末，辽宣宗耶律淳建立北辽，与西夏共同抗金，后被金灭 。辽朝亡后，辽德宗耶律大石西迁到中亚楚河流域建立西辽，定都虎思斡耳朵，1218年被蒙古所灭 。辽朝宗室耶律留哥与其弟耶律厮不分别建立了东辽和后辽，最后东辽灭后辽，东辽则于1269年被蒙古所灭。1222年西辽贵族在今伊朗地区建立了小政权后西辽，1309年被伊尔汗国吞并。辽强盛时期疆域东到日本海，西至阿尔泰山，北到额尔古纳河、外兴安岭一带，南到河北中部的白沟河 。
`,
  },
  {
    name: "南宋",
    title: "南宋,金,西夏",
    width: "80",
    height: "150",
    left: "55",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      150
    }`,
    color: "#fdcafd",
    from: "1127",
    to: "1176",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2818%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    南宋与金朝、西辽、大理国、西夏及13世纪初兴起的蒙古帝国/元朝为并存政权，约一百多年。
      南宋(1127年6月12日-1279年3月19日)是宋朝的其中一个时期，与北宋合称"两宋"。北宋以开封被金人攻入及占领而结束，1127年6月12日，宋徽宗第九子康王赵构南逃至南京应天府(今河南商丘)即位，是为宋高宗，改元建炎。
      因宋朝的五行德运为"火"，改元"建炎"意味着重建王朝的火德。因以临安(今浙江杭州)为都城，史称南宋，以别于北宋。绍兴和议后，大部分时间与金朝东沿淮水(今淮河)，西以大散关为界。由于未能收复中原，南宋的统治范围被迫限于秦岭淮河线以南地区，与金国长期军事对峙，但是亦刺激了南宋发展经济、手工业、航运贸易、武器制造及科技。
      金朝(1115年-1234年)，是中国历史上由女真族建立的统治中国北方和东北地区的封建王朝，完颜阿骨打(完颜旻)所建。西与西夏、蒙古等接壤，南与南宋对峙。共传十帝，享国119年。金太祖完颜阿骨打(完颜旻)统一女真诸部后起兵反辽。1115年在上京会宁府(今黑龙江省哈尔滨市阿城区 )立国，国号金，建元"收国"。 1125年灭辽朝，1127年又发动靖康之变灭北宋。1130年，宋高宗赵构向金帝上降表称臣。 1153年，海陵王完颜亮迁都中都(今北京)。金世宗、金章宗统治时期政治文化达到巅峰，金章宗在位后期急剧由盛转衰。金宣宗继位后，内部政治腐败、民不聊生，外受大蒙古国南侵，被迫迁都汴京(今河南开封)。 1234年，金在南宋和蒙古南北夹击下覆亡于蔡州。
      金朝初期采取贵族合议的勃极烈制度，后逐渐由二元政治走向单一汉制 。军事上采行军民合一的猛安谋克制度 。金朝是历史上第一次提出了"中华一统"的朝代。
      西夏(1038年-1227年)，是中国历史上由党项人在中国西北部建立的朝代，自称邦泥定国或大白高国 。因其在西北，故称之为西夏。 前期和辽、北宋，后期与金朝并立。历经十帝，享国189年。从881年李思恭任定难军节度使起，李氏政权共计346年。
唐末党项拓跋首领李思恭因平定黄巢有功被封为定难军节度使，赐封五州之地。党项先后臣服于唐朝、五代诸政权与北宋。五州之地被北宋并吞后，李继迁出走创业，990年被辽朝封为夏国王。 陆续占领河西走廊诸州。1038年，李元昊称帝建国。 西夏在宋夏战争与辽夏战争中获胜，形成三国鼎立的局面。夏毅宗到崇宗时期，大权掌握在梁氏母党手中。西夏因为皇党与母党的对峙而内乱。金朝崛起后，西夏改臣服金朝。夏仁宗期间发生天灾与任得敬分国事件，但经过改革后，到天盛年间出现盛世。 漠北的大蒙古国崛起，西夏最后于西夏保义二年(1227)亡于蒙古。
`,
  },
  {
    name: "辽",
    title: "北宋,辽",
    width: "76",
    height: "150",
    left: "155",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60
    }`,
    color: "#d0bd94",
    from: "960",
    to: "1129",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2817%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    北宋与辽是同一时期并存的两个朝代，分治南北。
      北宋(960年-1127年)，是中国历史上继五代十国之后的朝代，传九位皇帝，享国167年。与南宋合称宋朝，又称两宋，因皇室姓赵，也称赵宋。
      显德七年(960年)，后周诸将发动陈桥兵变，拥立赵匡胤为帝，建立宋朝，定都东京开封府(河南开封) ，改元建隆。后通过杯酒释兵权，将兵权与财政权集中于中央，避免了中晚唐藩镇割据的乱象。 但也导致宋朝与辽国、西夏、金国的战争中失利。靖康元年(1126年)发生靖康之难，次年被金国灭亡。宋朝政治体制大体沿袭唐朝，采用分化事权方式，宰相职位由多人担任，还实行官衔与实际职务分离的官吏任用制度，对维护国家统一起了重要的作用，但也造成"积贫积弱"的局面。
      辽朝(907年-1125年 )，是中国历史上由契丹族建立的朝代，共传九帝，享国二百一十八年。
      907年，辽太祖耶律阿保机成为契丹可汗，916年始建年号，建国号"契丹"，定都上京临潢府(今内蒙古赤峰市巴林左旗) 。947年，辽太宗耶律德光率军南下中原，攻占汴京(今河南开封)，于汴京登基称帝，改国号"大辽"，改年号为"大同" 。983年复更名"大契丹"。1007年辽圣宗耶律隆绪迁都中京大定府(今内蒙古赤峰市宁城县)。1066年辽道宗耶律洪基复国号"大辽"。1125年被金朝所灭 。
辽末，辽宣宗耶律淳建立北辽，与西夏共同抗金，后被金灭 。辽朝亡后，辽德宗耶律大石西迁到中亚楚河流域建立西辽，定都虎思斡耳朵，1218年被蒙古所灭 。辽朝宗室耶律留哥与其弟耶律厮不分别建立了东辽和后辽，最后东辽灭后辽，东辽则于1269年被蒙古所灭。1222年西辽贵族在今伊朗地区建立了小政权后西辽，1309年被伊尔汗国吞并。辽强盛时期疆域东到日本海，西至阿尔泰山，北到额尔古纳河、外兴安岭一带，南到河北中部的白沟河 。`,
  },
  {
    name: "金",
    title: "南宋,金,西夏",
    width: "60",
    height: "140",
    left: "135",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      120
    }`,
    color: "#caca34",
    from: "1127",
    to: "1279",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2818%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    南宋与金朝、西辽、大理国、西夏及13世纪初兴起的蒙古帝国/元朝为并存政权，约一百多年。
      南宋(1127年6月12日-1279年3月19日)是宋朝的其中一个时期，与北宋合称"两宋"。北宋以开封被金人攻入及占领而结束，1127年6月12日，宋徽宗第九子康王赵构南逃至南京应天府(今河南商丘)即位，是为宋高宗，改元建炎。
      因宋朝的五行德运为"火"，改元"建炎"意味着重建王朝的火德。因以临安(今浙江杭州)为都城，史称南宋，以别于北宋。绍兴和议后，大部分时间与金朝东沿淮水(今淮河)，西以大散关为界。由于未能收复中原，南宋的统治范围被迫限于秦岭淮河线以南地区，与金国长期军事对峙，但是亦刺激了南宋发展经济、手工业、航运贸易、武器制造及科技。
      金朝(1115年-1234年)，是中国历史上由女真族建立的统治中国北方和东北地区的封建王朝，完颜阿骨打(完颜旻)所建。西与西夏、蒙古等接壤，南与南宋对峙。共传十帝，享国119年。金太祖完颜阿骨打(完颜旻)统一女真诸部后起兵反辽。1115年在上京会宁府(今黑龙江省哈尔滨市阿城区 )立国，国号金，建元"收国"。 1125年灭辽朝，1127年又发动靖康之变灭北宋。1130年，宋高宗赵构向金帝上降表称臣。 1153年，海陵王完颜亮迁都中都(今北京)。金世宗、金章宗统治时期政治文化达到巅峰，金章宗在位后期急剧由盛转衰。金宣宗继位后，内部政治腐败、民不聊生，外受大蒙古国南侵，被迫迁都汴京(今河南开封)。 1234年，金在南宋和蒙古南北夹击下覆亡于蔡州。
      金朝初期采取贵族合议的勃极烈制度，后逐渐由二元政治走向单一汉制 。军事上采行军民合一的猛安谋克制度 。金朝是历史上第一次提出了"中华一统"的朝代。
      西夏(1038年-1227年)，是中国历史上由党项人在中国西北部建立的朝代，自称邦泥定国或大白高国 。因其在西北，故称之为西夏。 前期和辽、北宋，后期与金朝并立。历经十帝，享国189年。从881年李思恭任定难军节度使起，李氏政权共计346年。
唐末党项拓跋首领李思恭因平定黄巢有功被封为定难军节度使，赐封五州之地。党项先后臣服于唐朝、五代诸政权与北宋。五州之地被北宋并吞后，李继迁出走创业，990年被辽朝封为夏国王。 陆续占领河西走廊诸州。1038年，李元昊称帝建国。 西夏在宋夏战争与辽夏战争中获胜，形成三国鼎立的局面。夏毅宗到崇宗时期，大权掌握在梁氏母党手中。西夏因为皇党与母党的对峙而内乱。金朝崛起后，西夏改臣服金朝。夏仁宗期间发生天灾与任得敬分国事件，但经过改革后，到天盛年间出现盛世。 漠北的大蒙古国崛起，西夏最后于西夏保义二年(1227)亡于蒙古。`,
  },
  {
    name: "西夏",
    title: "南宋,金,西夏",
    width: "36",
    height: "160",
    left: "195",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      90
    }`,
    color: "#fd6797",
    from: "1127",
    to: "1179",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2818%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    南宋与金朝、西辽、大理国、西夏及13世纪初兴起的蒙古帝国/元朝为并存政权，约一百多年。
      南宋(1127年6月12日-1279年3月19日)是宋朝的其中一个时期，与北宋合称"两宋"。北宋以开封被金人攻入及占领而结束，1127年6月12日，宋徽宗第九子康王赵构南逃至南京应天府(今河南商丘)即位，是为宋高宗，改元建炎。
      因宋朝的五行德运为"火"，改元"建炎"意味着重建王朝的火德。因以临安(今浙江杭州)为都城，史称南宋，以别于北宋。绍兴和议后，大部分时间与金朝东沿淮水(今淮河)，西以大散关为界。由于未能收复中原，南宋的统治范围被迫限于秦岭淮河线以南地区，与金国长期军事对峙，但是亦刺激了南宋发展经济、手工业、航运贸易、武器制造及科技。
      金朝(1115年-1234年)，是中国历史上由女真族建立的统治中国北方和东北地区的封建王朝，完颜阿骨打(完颜旻)所建。西与西夏、蒙古等接壤，南与南宋对峙。共传十帝，享国119年。金太祖完颜阿骨打(完颜旻)统一女真诸部后起兵反辽。1115年在上京会宁府(今黑龙江省哈尔滨市阿城区 )立国，国号金，建元"收国"。 1125年灭辽朝，1127年又发动靖康之变灭北宋。1130年，宋高宗赵构向金帝上降表称臣。 1153年，海陵王完颜亮迁都中都(今北京)。金世宗、金章宗统治时期政治文化达到巅峰，金章宗在位后期急剧由盛转衰。金宣宗继位后，内部政治腐败、民不聊生，外受大蒙古国南侵，被迫迁都汴京(今河南开封)。 1234年，金在南宋和蒙古南北夹击下覆亡于蔡州。
      金朝初期采取贵族合议的勃极烈制度，后逐渐由二元政治走向单一汉制 。军事上采行军民合一的猛安谋克制度 。金朝是历史上第一次提出了"中华一统"的朝代。
      西夏(1038年-1227年)，是中国历史上由党项人在中国西北部建立的朝代，自称邦泥定国或大白高国 。因其在西北，故称之为西夏。 前期和辽、北宋，后期与金朝并立。历经十帝，享国189年。从881年李思恭任定难军节度使起，李氏政权共计346年。
唐末党项拓跋首领李思恭因平定黄巢有功被封为定难军节度使，赐封五州之地。党项先后臣服于唐朝、五代诸政权与北宋。五州之地被北宋并吞后，李继迁出走创业，990年被辽朝封为夏国王。 陆续占领河西走廊诸州。1038年，李元昊称帝建国。 西夏在宋夏战争与辽夏战争中获胜，形成三国鼎立的局面。夏毅宗到崇宗时期，大权掌握在梁氏母党手中。西夏因为皇党与母党的对峙而内乱。金朝崛起后，西夏改臣服金朝。夏仁宗期间发生天灾与任得敬分国事件，但经过改革后，到天盛年间出现盛世。 漠北的大蒙古国崛起，西夏最后于西夏保义二年(1227)亡于蒙古。`,
  },
  {
    name: "大理",
    title: "",
    show: false,
    width: "30",
    height: "350",
    left: "25",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      150 +
      130
    }`,
    color: "#34ca97",
    from: "",
    to: "",
    kings: [{ name: "", age: "" }],
    describtion: "",
  },
  {
    name: "渤海国",
    title: "",
    width: "30",
    height: "210",
    left: "176",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      80 +
      24
    }`,
    color: "#6666cb",
    from: "",
    to: "",
    kings: [{ name: "", age: "" }],
    describtion: "",
  },
  {
    name: "明",
    title: "",
    width: "100%",
    height: "300",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      90 +
      160 +
      210
    }`,
    color: "#ca6767",
    from: "1368",
    to: "1644",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2821%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    明朝（1368年―1644年）是中国历史上最后一个由汉族建立的大一统中原王朝，共传十二世，历经十六帝，享国276年。
      元末爆发红巾起义，朱元璋加入郭子兴队伍。1364年朱元璋称吴王，建立西吴。1368年朱元璋称帝，国号为大明，因皇室姓朱，又称朱明，定都于应天府；1420年朱棣迁都至顺天府，以应天府为陪都。明初历经洪武之治、永乐盛世、仁宣之治等治世，政治清明、国力强盛。中期经土木之变由盛转衰，后经弘治中兴、嘉靖中兴、万历中兴国势复振，晚明因东林党争和天灾外患导致国力衰退，爆发明末农民起义。1644年李自成攻入北京，崇祯帝自缢殉国。明朝宗室在江南建立南明，随后清朝趁乱入关，击败大顺、大西、南明诸政权；1662年永历帝被杀，南明灭亡。1683年清军攻占台湾，奉明正朔的明郑告终。
      明代疆域囊括汉地，东北抵日本海、外兴安岭，后缩为辽河流域；北达戈壁沙漠一带，后撤至明长城；西北至新疆哈密，后退守嘉峪关；西南临孟加拉湾，后折回约今云南境；并在青藏地区设有羁縻卫所，还曾收复安南，明代极盛国土面积约达一千万平方公里。
      明朝是继汉唐之后黄金时期。明代无汉之外戚、唐之藩镇、宋之岁币，天子守国门，君王死社稷。清朝官方评价明朝为“治隆唐宋”、“远迈汉唐”。
`,
  },
  {
    name: "清",
    title: "",
    width: "100%",
    height: "340",
    left: "0",
    top: `${
      200 +
      540 +
      600 +
      300 +
      280 +
      300 +
      44 +
      220 +
      26 +
      100 +
      40 +
      72 +
      100 +
      80 +
      40 +
      70 +
      30 +
      46 +
      300 +
      60 +
      90 +
      160 +
      210 +
      300
    }`,
    color: "#67caca",
    from: "1639",
    to: "1912",
    imgs: ['https://hmqn.zhijingyuntech.cn/map/map%20%2822%29.png'],
    kings: [{ name: "", age: "" }],
    describtion: `
    清朝(1636年 -1912年 )，是中国历史上最后一个封建王朝，共传十二帝 ，统治者为爱新觉罗氏。从努尔哈赤建立后金起，总计296年。 从皇太极改国号为清起，国祚276年。 从清兵入关，建立全国性政权算起为268年。
      1616年，建州女真首领努尔哈赤建立后金。 1636年，汉满蒙三族共呈劝进表，皇太极称帝，改国号为大清。 1644年，驻守山海关的明将吴三桂降清，多尔衮率领清兵入关。入关后20年时间里，平定大顺、大西、南明等政权。 后又平定三藩之乱、统一台湾，完成全国统一。 康雍乾三朝走向鼎盛，在此期间，中国的传统社会取得了前所未有的发展成就。土地增垦，物产盈丰，小农经济的社会生活繁荣稳定，综合国力远胜于汉唐。 鸦片战争后多遭列强入侵，进行了洋务运动和戊戌变法等近代化的探索和改革。1912年2月12日，北洋大臣袁世凯诱使清帝溥仪逊位，颁布了清帝退位诏书，清朝从此结束。
      清朝时期，统一多民族国家得到巩固和发展，清朝统治者统一蒙古诸部，将新疆和西藏纳入版图，积极维护国家领土主权的完整。乾隆年间，中国作为统一的多民族世界大国的格局最终确定。极盛时期的清朝，西抵葱岭和巴尔喀什湖，西北包括唐努乌梁海，北至漠北和西伯利亚，东到太平洋(包括库页岛)，南达南沙群岛。包括50多个民族，国家空前统一。
      期间中国古代的专制主义也推向了最高峰。 清朝前期农业和商业发达，江南出现了密集的商业城市，并在全国出现了大商帮。在此基础上，人口突破四亿大关，占世界总人口十亿的近一半。`,
  },
];
