<template>
  <view class="detail">
    <view class="detail-header">
      <img class="detail-header-img" :src="headerData[activeIndex]" alt="" />
    </view>
    <view class="detail-content">
      <view v-for="(item, index) in dataList[activeIndex]" class="detail-c-item" :key="index">
        {{item}}
      </view>
    </view>
  </view>
</template>

<script>
export default {
  data() {
    return {
      headerData: [
        "https://hmqn.zhijingyuntech.cn/swiper1.png",
        "https://hmqn.zhijingyuntech.cn/swiper2.png",
        "https://hmqn.zhijingyuntech.cn/swiper3.png",
      ],
      activeIndex: 0,
      dataList: [
        [
          "从公元前633年晋文公作三军设六卿起，六卿一直把握着晋国的军政大权。到晋平公时，韩、赵、魏、智、范、中行氏六卿相互倾轧。后来赵把范、中行氏灭掉后，公元前453年又联合韩﹑魏灭掉了智氏，晋国公室名存实亡。公元前403年周威烈王命韩虔﹑赵籍﹑魏斯为诸侯。到公元前376年，魏武侯﹑韩哀侯﹑赵敬侯瓜分了晋国王室。",
          "从公元前633年晋文公作三军设六卿起，六卿一直把握着晋国的军政大权。到晋平公时，韩、赵、魏、智、范、中行氏六卿相互倾轧。后来赵把范、中行氏灭掉后，公元前453年又联合韩﹑魏灭掉了智氏，晋国公室名存实亡。",
          "晋国只剩下智、赵、韩、魏四家卿大夫，其中以智氏最强。专擅晋国国政的智伯瑶恃强向韩康子、魏桓子索得土地，在向赵襄子索地遭拒后，于周贞定王十四年前455年攻打赵氏，并胁迫韩、魏两家出兵。赵襄子退居晋阳固守。智伯围困晋阳两年而不能下，引晋水淹灌晋阳城。危急中，赵襄子派张孟谈说服韩、魏两家倒戈，放水倒灌智伯军营，大破智伯军，擒杀智伯瑶，此战即晋阳之战，为日后“三家分晋”奠定了基础。",
          "晋国只剩下智、赵、韩、魏四家卿大夫，其中以智氏最强。专擅晋国国政的智伯瑶恃强向韩康子、魏桓子索得土地，在向赵襄子索地遭拒后，于周贞定王十四年前455年攻打赵氏，并胁迫韩、魏两家出兵。赵襄子退居晋阳固守。智伯围困晋阳两年而不能下，引晋水淹灌晋阳城。危急中，赵襄子派张孟谈说服韩、魏两家倒戈，放水倒灌智伯军营，大破智伯军，擒杀智伯瑶，此战即晋阳之战，为日后“三家分晋”奠定了基础。",
          "公元前403年，韩、赵、魏三家打发使者上洛邑去见周威烈王，要求周天子把他们三家封为诸侯。周威烈王想，不承认也没有用，不如做个顺水人情，就把三家正式封为诸侯。打那以后，韩（都城在今河南禹县，后迁至今河南新郑）、赵（都城在今山西太原东南，后迁至今河北邯郸）、魏（都城在今山西夏县西北，后迁至今河南开封）都成为中原大国，加上秦、齐、楚、燕四个大国，历史上称为“战国七雄”",
        ],
        [
          "中华文明是一种独特的文明，其文字也是非常独特的。在世界上所有的国家中，只有中国由于其民族文化强大的包容性与同化性而始终没有间断过的文化传承，这使汉字成为世界上较少的没有间断过的文字形式。约公元前14世纪殷商后期出现的甲骨文被广泛认为是汉字的第一种形式，一直发展到今日，有三四千年的历史，后来，综艺体、整块体、浮云体、变体等各种字体纷纷诞生，中国文化的繁荣展现在世人面前，也是汉字发展的必然结果。",
          '西南师范大学中文系刘又辛教授负责的国家社会科学基金项目"汉字发展史纲要"，其最终成果是中国大百科全书出版社出版的专著《汉字发展史纲要》，这项成果从以下几个方面提出了一些值得关注的新的观点。',
          "1、关于汉字发展史的三个阶段",
          "第一阶段是图画文字阶段。商代以前的文字都属于这个阶段。第二阶段是以表形文字为基础，以表音文字为主体的表音文字阶段。从甲骨文到秦代的文字都属于这个阶段。第三阶段是以形声字为主体，还保留了一些表形字和表音字的形音文字阶段，从秦汉到现代汉字都属于这个阶段。",
          "2、关于汉字的优缺点",
          '汉字的优点。汉字的最大优点，是他的超方言性。中国是地域广阔、方言复杂的国家。在古代不可能做到语言规范化，就是现在推广普通话，也还不能在短期内完成。但是汉字却是全国通行的书面语言交际工具。语言不同，以笔代口写出字来，却完全一样。如果是文字拼音化，就会出现广东文、闽南文、上海文、北京文等，妨碍人们思想交流。汉字的另一优点，是它的有理性。文字是一种符号体系，它可分为有理性文字和无理性文字两大类。所谓无理性，是指纯表音文字，如假借字、音节文字、字母文字等，这种文字纯系一种符号，与要表达的事物没有直接联系。所谓有理性文字如汉字，它除了表示词的读音，还是代表事物形类的标志。如"水"字，是从象形文字水的形状演变而来的。它有表形和表音两个作用。再如"汪"、"洋"两字，用"水"表示类属，用"王"、"羊"表示读音，叫做形声字，是汉字的主体，这种形声兼顾的特点，便于识别和记忆。',
          '汉字在表音方面的缺点。汉字表形字中，有一小部分长期被当作假借字使用，这是汉字中的表音字。由于它的数目不大，且多为常用字，可以不谈。在这里，只讲形声字的表音功能。形声字的声符大都是可以单独使用的表形字，用以当作表音的声符，不如字母表音准确。汉字在表音功能方面有不少缺点，而主要是以下三点:a,形声字的声符不能区分声调的差异，同一个声符往往表示不同的调.如"胡"字是阳平字，但"糊涂"的"糊"读阳平，"糊弄"的"糊"读去声。b,形声字的声符，往往因语言的变易，而丧失或减弱了表音功能。如"尚"读"shang"的第四声，但以"尚"为声符的"倘"、"躺"读"tang"的第三声，"党"读"dang"的第三声，"徜"、"常"读"chang"的第二声，"敞"读"chang"的第三声。c,汉字的一字多读的重音现象。如"参"字，在"参加"、"参观"等词中读"can"的第一声，在"人参"一词中读"shen"的第一声，在"参差不齐"一词中读"cen"的第一声，共有三个重音。',
          "3、关于汉字的简化问题",
          '汉字是从图画文字演变发展而来的，若画成其物，笔画就多。从汉字发展史来看，简省笔画一直是汉字演变的明显倾向。1956年公布汉字简化方案，1964年又扩大了简化字的范围和字数，这是两千多年来第一次大规模的汉字改革。经过四十几年的实践证明，在普及教育和书写等方面发挥了很大作用。从另一方面看，简化字也并非全无可议之处。如"邓"、"欢"、"难"、"树"、"戏"、"对"等字，其部件"又"，代替了"登"等声韵不同的声符，有些草书楷化的写法同楷书的结构不同，有些同音代替字也有可斟酌之处。但文字的规范一经确定，就不能朝令夕改，也不能各行其是，放任自流。汉字是中国优秀文化的载体，也是中国文化的一个重要方面。对待汉字也要像对待中国传统文化一样，一是要继承传统而不能割断传统，二是要改革，按照汉字本身的发展规律进行改革，使之成为更好的交际工具。由于中国国际地位的提高，经济的发展，使得学习汉语汉字的人越来越多。在各国教汉语的教师中，有的来自台湾，有的来自大陆，在教汉字时自然就会出现繁简两套教法。对这两套教法是否统一，或如何统一，有待海峡两岸及海外有关人士和专家学者聚集一堂，共同讨论解决。',
          "4、关于汉字不能走拼音文字的道路",
          '1958年国家公布了汉语拼音方案。它的作用是作为推广普通话的工具，以及给汉字注音。拼音方案的应用范围还有扩大的可能。如小学生在写作文时，遇到不会写的汉字，可以用拼音写这个字，书刊中的难字僻字可以加上拼音，在引用外国的人名、地名时，有人主张用拼音方案拼译等。可以预测，这套方案将会同汉字一样长期生存下去。但曾有人认为，人类语言的书面符号都应走向拼音文字的道路，不符合这个标准的文字一概视为落后文字。这是毫无科学根据的偏见。',
          '5、关于汉字的教学问题',
          '按照汉字的教学方法教学汉字，这个原则是对的。但是，陈腐的"六书"说(指事、象形、形声、会意、转注、假借六种造字方法)必须改革。这项成果根据比较文字学的研究，并在唐兰先生"三书"论的基础上，提出了表形、借音、形声这个"新三书"说。它包括了"六书"中的合理部分，淘汰了"转注"。表形字包括"六书"中的象形、指事、会意这三书;借音字就是假借。改称借音字或表音字，是因为有些人认为假借中还有一种借形字，无中生有，徒乱人意。在唐兰先生的"三书"中，把假借字排除在外，把用表形法造的字勉强分为象形和象意两类，都不妥当。"新三书"中，既吸取了前人的研究成果，也纠正了前辈的不足之处。掌握"新三书"的划分标准，对于汉字教学可以发挥很大的作用。'
        ],
        [
          "秦汉时期是中国秦汉两朝大一统时期的合称。公元前221年秦灭六国，首次完成了真正意义上的中国统一，秦王政改号称皇帝，建立起中国历史上第一个中央集权制的秦朝。秦始皇废封建，立郡县，开始实行全面的统一。然而由于缺乏历史经验，秦朝经二世而亡。在经过短暂的分裂之后，汉朝继之而起，并基本延续秦的制度，史称'汉承秦制'。秦汉时期是中国历史上第一个大统一时期。也是统一多民族国家的奠基时期。",
          "公元前221年秦灭其他六国后统一了中国主体部分，成为了中国历史上第一个统一的帝国，定都咸阳（今西安附近）。由于秦王嬴政自认“功盖三皇，德过五帝”，于是改用皇帝称号，自封始皇帝，人称秦始皇，传位后的皇帝称二世，直至千世万世。他对国家进行了许多项改革，包括了中央集权的确立，取代了周朝的诸侯分封制；统一了文字，方便官方行文；统一度量衡，便于工程上的计算。秦始皇还大力修筑驰道，并连接了战国时赵国、燕国和秦国的北面围城，筑成了西起临洮、东至辽东的万里长城以抵御北方来自匈奴，东胡等游牧民族的侵袭。秦始皇推崇法治，重用法家的李斯作为丞相，并听其意见，下令焚书坑儒（有部分学者对这一行为是否确实存在有争议），收缴天下兵器，役使七十万人修筑阿房宫以及自己的陵墓——包括兵马俑等。部分史学家对以上事件存有怀疑，认为由于秦始皇的一系列激进改革得罪了贵族，平民无法适应，才在史书上留此一笔。",
          "前210年秦始皇病死于出巡途中，胡亥（即秦二世）杀害太子扶苏即位。但十个月后，陈胜、吴广在大泽乡揭竿而起，包括六国遗臣等野心家乘势作乱，前206年刘邦围攻咸阳，秦王子婴自缚出城投降，秦亡。此后，汉王刘邦与西楚霸王项羽展开了争夺天下的楚汉战争。 前202年十二月，项羽被汉军围困于垓下（今安徽灵壁），四面楚歌。项羽在乌江自刎而死。楚汉之争至此结束。汉高祖刘邦登基，定都长安（今陕西西安），西汉开始。到了汉武帝时，西汉到达鼎盛。并与罗马，安息(帕提亚），贵霜并称为四大帝国。武帝实行推恩令，彻底削弱了封国势力，强化监察制度，实现中央集权；他派遣卫青、霍去病、李广等大将北伐，成功地击溃了匈奴，控制了西域，还派遣张骞出使西域，开拓了著名的丝绸之路，发展了对外贸易，使中国真正了解了外面的世界，促进中西文化交流。儒家学说也被确立为官方的主流意识形态，成为了占统治地位的思想。其他艺术与文化也蒸蒸日上。同时期还出现了第一部通史性质的巨著——《史记》，同时这时的中国出现造纸术，大大推动了文化发展。",
          "西汉发展到了一世纪左右开始逐渐衰败。公元9年，外戚王莽夺权，宣布进行一系列的改革，改国号为新。然而这些改革却往往不切实际，最终导致农民纷纷起义。公元25年刘秀复辟了汉朝，定都洛阳，史称东汉，而他就是汉光武帝。东汉的发展延续了西汉的传统，此时出现了天文学家张衡。汉的文化吸取了秦的教训，显得相当开明，当时佛教通过西域到达中国，在河南洛阳修建了中国的第一座佛教寺庙——白马寺，佛教正式传入中国。"
        ]
      ],
    };
  },
  onLoad(option) {
    if (option.type) {
      this.activeIndex = option.type;
    }
  }
};
</script>

<style lang="scss">
.detail-header {
  width: 100%;
  .detail-header-img {
    width: 100%;
  }
}
.detail-content {
  background: #fff;
  padding: 60upx 80upx;
  color: #707070;
  font-size: 30upx;
  line-height: 50upx;
  .detail-c-item {
    text-indent: 60upx;
  }
}
.detail-content::first-letter {
  color: #707070;
  font-size: 50upx;
  font-weight: bold;
}
</style>