{
    "赵": {
        "url": "zhao",
        "content": "赵姓主要源自：嬴姓。",
        "list": [{
                "title": "赵姓起源一",
                "content": ["汉族赵姓出自嬴姓，嬴姓的出现是因为舜帝（姚姓，后代以姚为姓）赐姓给他的女婿伯益（颛顼帝孙）为“嬴”，并把自己的姚姓的女儿嫁给他。虽然使用嬴姓的祖先是伯益，但赵姓的具体始祖是造父。"]
            },
            {
                "title": "赵姓起源二",
                "content": ["周孝王传至周幽王时，因幽王无道，造父的7世孙赵叔带离周仕晋，从此赵氏子孙世代为晋大夫，掌握晋国大权。到战国初年，赵氏联合韩、魏二卿击败智氏，瓜分智氏封地，继而赵敬侯赵襄子联合魏武侯、韩哀侯三家分晋，建立赵国。至他的孙子赵籍时，正式获得了周威烈王的承认，与韩、魏两家并列为诸侯。公元前222年，赵国为秦国所灭，赵国王室纷纷散落民间。因为造父是秦人和赵人的共同祖先，而且自造父开始姓赵，所以秦国公族也姓赵，比如秦始皇嬴政又称赵政。秦国公族也以赵为氏，有“诸赵”的说法。"]
            },
            {
                "title": "赵姓起源三",
                "content": ["源于帝王赐姓或外族改姓。先后匈奴人、女真人、党项人、鲜卑人的李姓、穆姓、隆姓、宇文姓、拓跋姓的历史人物，被赐姓赵，如汉代有赵安稽（匈奴人），赵曳夫（“南蛮”人），五代有赵国珍（牂牁酋长的后裔）。再有蒙古族人成吉思汗三弟合赤温后裔避乱于甘肃陕西等地，随母姓改汉姓赵。"]
            },
            {
                "title": "赵姓起源四",
                "content": ["源于冒姓。因避祸、姻亲、过继、入赘等原因改姓的情况很多，这在姓氏学上称之为“冒姓”。赵氏中也有不少这样的情景。其中多数为：清王朝覆灭后，清官职人者及家中子女岌岌可危，因害怕被压迫多年的其他民族复仇，伊尔根觉罗、爱新觉罗等满姓氏者迫于压力改名换姓，不少人便改的是“赵”姓。"]
            },
            {
                "title": "赵姓分布",
                "content": ["2008年，赵姓人口单位面积内密度最高的地区在山东半岛和淮河流域，每平方公里的赵姓人口达到7.5人以上，有的地区达到11人以上；其次在河南、河北、东北三省、安徽北部、江苏北部、陕西中部、四川北部，每平方公里的赵姓人口达到6人以上。赵姓分布密度示意图表明：密度最高的（6人以上/平方公里）地区仅仅占国土面积的16.9%，赵姓人口大约1176万；4.5—6人/平方公里的地区占国土面积的13 .7 % ，赵姓人口大约704万； 1.5— 4.5 人 / 平方公里的地区占国土面积的26 .8 % ，赵姓人口大约715万； 不足1 .5 人 / 平方公里的地区占国土面积的42 .6 % ，赵姓人口大约153万。赵姓分布很广， 但不均衡。 赵姓在北方地区是常见的姓氏之一， 沿黄河流域的省区是赵姓分布的主要地区。 赵姓在人群中分布频率示意图表明： 在河北、 冀鲁大部、 山西、 陕甘宁大部、 内蒙古中部， 赵姓一般占当地人口的比例在3 .2 % 以上， 中心地区可达5 % 以上， 覆盖面积占了总国土面积的11 .8 % ；在沿鲁、 苏、 皖、 豫、 鄂、 陕至四川北部一条宽百余公里的地段， 四川中西部、 云南西南、 沿川、 青、 甘、 宁至内蒙古一条宽120公里的地段， 东北地区， 赵姓占当地人口的比例一般达2 .4 % —3.2 % ，覆盖面积占了总国土面积的22 % ；在皖苏南部、 浙江、 赣闽北部、 湖北南部、 湖南北部、 贵州、 四川东南、 云南东部、 青海东部、 甘肃中部、 新疆西北， 赵姓一般占当地人口的比例在0 .8 % —2.4 % ，覆盖面积占了总国土面积的28 .4 % ；在其他地区， 赵姓一般占当地人口的比例不足0 .8 % ，覆盖面积占了总国土面积的37 .8 % ，其中比例不足0 .5 % 的地区占了16 % 。"]
            }
        ]
    },
    "钱": {
        "url": "qian",
        "content": "",
        "list": [{
                "title": "钱姓起源一",
                "content": "据《通志·氏族略》、《姓谱》等书记载，钱氏源自彭祖篯铿。黄帝之孙颛顼在伯父少昊去世后继为天子，掌管中原地区。据《大戴礼记》记载，颛顼的曾孙陆终氏娶于鬼方氏，鬼方氏之妹谓之女隤，氏产六子；孕而不粥，三年，启其左胁，六人出焉。其一曰己樊，是为昆吾；其二曰惠连，是为参胡；其三曰篯铿，是为彭祖；其四曰莱言，是为郐人；其五曰晏安，是为曹姓；其六曰季连，是为楚之先。《史记·楚世家》：“彭祖姓篯名铿，尧封於彭城，为大彭国始祖”，他被后人尊称为彭祖。篯铿是中国古代最著名的长寿者，也是民间神话中寿星的原型。周文王时，彭祖裔孙篯孚为周文王师，官拜泉府上士（泉府，掌管全国的税收和钱粮；上士，周代宰夫级官阶之一）。因泉通钱，而篯字恰是钱字上有个竹头，为纪念篯铿氏族再次复兴，篯孚的子孙便去篯字竹头简为钱姓。在如今的鲁南苏北地区仍有少量的篯氏以及讹音简化的尖姓生活着。"
            },
            {
                "title": "钱姓起源二",
                "content": "中国钱姓血脉比较纯正，较少发生外族和外姓的融入。但在元明清时，钱姓开始出现与周边民族融合的现象，今回族、苗族、壮族、傣族、藏族、黎族、土家族、哈尼族、布依族、纳西族等少数民族中，均有少量钱氏族人分布。其来源大多为改土归流运动中，流改为汉姓钱氏。明清云南地区的哈尼族钱姓土司是来自临安的钱姓汉族，其后裔在当地都拥有很大的影响。中国当前还有不少的少数民族钱姓是通过同音转译等形式改姓钱的，据《中国人的姓名》等书记载，蒙古族、彝族、满族钱姓的源流为同音转译。历史上，曾经另有一些汉族钱姓源于帝王赐姓为氏。《宋史·吴越钱氏世家》称，吴越王钱镠“与战士多赐己姓”，至忠懿王钱弘俶纳土归宋，这些因赐姓而改姓钱氏之人“皆称同宗”。淳化三年（公元992年），宋太宗赵光义诏令恢复本姓，所以赐姓的钱氏基本已不复存在。如今这种赐姓的钱姓人只见于台湾高山族土著中，据《台湾姓氏源流》记载，清乾隆二十三年（1758年），台湾高山族土著七姓中有一支因忠于朝廷，有功于国家，被乾隆帝赐姓为“钱”。"
            },
            {
                "title": "钱姓分布",
                "content": [
                    "宋朝时期，钱姓大约有35万人，约占全国人口的0.45%（宋朝时期全国人口为7700万左右），钱姓人口排在第四十位。浙江为钱姓第一大省，占浙江总人口的1.5%。该时期，钱姓在全国的分布主要集中于浙江、江苏、山东，这三省钱姓占钱姓总人口的54%，其次分布于河南、四川、安徽、江西、陕西，这五省集中了33%的钱姓人口。全国形成了鲁、浙、苏密集钱姓区。",
                    "明朝初期，钱姓大约有53万人，约占全国人口的0.8%（据《明实录》载，洪武十四年，全国有59873305人，约6000万），为当时人口第三十八位的姓氏。明朝时期，浙江仍为钱姓第一大省，约居住有钱姓人口的42%；该时期，钱姓在全国的分布主要集中于浙江、江苏、江西，这三省集中了80%的钱姓人口。",
                    "从明朝至2018年，钱姓人口由53万增加到270多万，但是钱姓人口的增长速度却远远低于全国人口的增长速度，自宋朝至2018年一千年中钱姓人口增加率是呈A形的态势。在全国的分布主要集中于江苏、浙江、安徽、上海、广东、云南等省市，大约占钱姓总人口的68%，其余钱姓以聚落形式分布在江西、福建、山东、湖北、湖南、河北、河南、四川、重庆、贵州、广西、陕西、山西、甘肃、宁夏、内蒙古、辽宁、吉林、黑龙江等省份，遍布全国。在近600年的时间里，钱姓人口流动方向的主流是向东南和南方移民，但也存在向华中、华北回迁的情况。钱姓在当今中国大陆姓氏排行榜上名列第八十九位，在台湾省名列第九十二位，人口约三百万，占全国人口总数的0.22%左右。",
                    "《中国人名大辞典》收入了钱姓历代名人310名，占总名人数的0.68%，排在名人姓氏的第二十六位；钱姓的著名文学家占中国历代文学家总数的0.5%，排在四十八位；钱姓的著名医学家占中国历代医学家总数的1%，排在第二十一位；钱姓的著名美术家占中国历代美术家总数的1.05%，排在第二十一位。"
                ]
            }
        ]
    },
    "孙": {
        "url": "sun",
        "content": "孙姓主要源自：子姓、姬姓、妫姓、芈姓、荀姓、姚姓。",
        "list": [{
                "title": "",
                "content": [
                    "1、源于子姓。商朝末，纣王叔父比干，商之贤臣，因直谏而被杀，子孙避难改姓，其中一支以本为王族子孙之故，遂姓孙氏。",
                    "2、源于姬姓。公元前1055年，周公姬旦封康叔於卫（今河南淇县），建立卫国。春秋时，他的八世孙姬和因为攻灭西戎有功，被周平王赐为公爵，史称卫武公。卫武公有一个儿子名叫惠孙，惠孙的孙子名乙，字武仲，又叫武仲乙，把祖父惠孙的字作为姓氏，姓孙。因此武仲乙又称孙乙，他的后代就以孙为姓。孙武、孙膑、孙权也是孙乙的后裔。",
                    "3、源于妫姓和姚姓。《新唐书·宰相世系》：”舜后胡公妫满封陈，至敬仲仕齐，又为田氏。王莽封田丰为代眭侯，后丰子田恢为避王莽之乱，过江徙居吴郡，改为妫姓。其五代孙妫敷，又改为姚氏。“《古今姓氏书辩证》记载：”舜因生于姚墟而姓姚，因居妫水而姓妫，故姚恢改姓为妫，妫皓又改姓为姚，知姚与妫可通......武王时有虞遏父者，以奉虞帝之祀，是为胡公”。北宋景佑年间刊本：邵思著《姓解》记载：”“虞舜生于姚，故因生地为姓，后世有以姚为氏。“《元和姓纂》载：“姚，虞帝生于姚墟，子孙以姚为氏。”《尚书·尧典》记，舜“厘降二女于妫汭，嫔于虞。舜在当帝之前，四岳（四方部族首领）曾向帝尧推荐过舜，尧把自己的两个女儿嫁给他，让他们居住在妫河边。他们的子孙有留在妫河边居住的，便以妫为姓。南宋的《通志·氏族略》记载：“姚姓，虞之姓也，虞帝生于姚墟，故因生以为姓”，舜因生在姚墟，其后子孙即以地为氏，称为姚氏。可见舜文化、虞舜文化和世界舜裔宗亲联谊会（世界舜裔联谊会），《古今姓氏书辩证》：“春秋时齐厉公之子田完之四世孙为须无，无宇之少子名书，字子占，为齐大夫，伐莒有功，齐景公赐姓孙氏，食采乐安，孙武为其后。”公元前1046年，周灭商，周武王封舜帝的直系后裔妫满于陈国。公元前672年，陈厉公妫跃之子陈完逃奔齐国，改陈氏为田氏。齐景公时，陈完四世孙是须无，须无孙田桓子，即齐大夫田无宇，其子田书因伐莒有功，齐景公封田书于乐安，古城在今山东 惠民县，并赐姓孙氏。",
                    "4、源于芈姓。春秋初，楚王蚣冒之孙蒍贾，蒍贾之子蒍艾腊，也称孙叔敖，孙叔为其字，出任楚庄王的令尹，其子孙以其字为氏。",
                    "5、源于荀姓。汉朝时，因汉皇室成员刘询当了皇帝，即汉宣帝，为了要避“询”音之讳，他下令荀姓子孙不得再姓荀，一律改为孙氏，并将战国时代的荀卿都改为孙卿。由是荀姓也成为汉朝“孙”姓支脉的一个源头。",
                    "6、源于冒姓，属于因故改姓为氏。夏侯婴，与刘邦是少时朋友，夏侯婴做过“滕令奉车”官职。等到其曾孙夏侯颇娶公主为妻，该公主随母亲外家的姓，称“孙公主”，这使夏侯颇的子女也跟随母亲外家的姓为孙。",
                    "7、源于其他赐姓、改姓：",
                    "①属于以王侯赐姓为氏。",
                    "三国时期东吴将领俞河因功而被赐姓孙，因称孙河。孙河，本姓俞，年少时即随孙坚征讨沙场，孙坚视他作心腹。后又随孙策平定江东，多立战功，孙策赐姓予他为孙，因而改姓。",
                    "②属于避难改姓为氏。",
                    "⑴山东《郓城县志》据李集乡军李村《李氏族谱》记载，李氏原姓轩辕氏，先祖轩辕斌，明初在朝为官，奉命往梁山平乱，便落籍郓城。后因奸臣陷害，为避灭门之祸，遂将轩辕氏改为孙、轩、李三姓，隐居四方。",
                    "⑵史籍《明史》记载，明朝中叶，有一名士叫孙一元，原来是安化王的宗族后裔，本为朱氏。明永乐十九年（公元1492年），庆靖王朱栴的第四子朱寘鐇承袭了安化的封地（今陕西庆阳与甘肃安化一带）。这个朱寘鐇曾一直认为自己是皇位当选人。事后，朱一元怕受株连，所以变姓名为孙一元，携家避难躲入太白山中隐居。在朱一元的后裔子孙中，皆沿袭祖先所改之姓氏，称孙氏，世代相传。",
                    "③源于各民族变姓，属于汉化改姓为氏。",
                    "《晋书》记载前燕孙氏，鲜卑族。羯族有孙氏。",
                    "⑴新罗初期，高丽汉文学家金富轼撰著的《三国史记》中记述了孙氏的起源。新罗初期，朝鲜遗民分居山谷之间，分别为阏川杨山部、茂山大树部等六部，均以朴为姓。到新罗第三代王朴儒理尼师改六部名称，并分别赐姓，其中的茂山大树部改名渐梁部，并赐姓孙。",
                    "⑵唐朝时期，安禄山的部将孙孝哲，官至大将军，安禄山僭位后拜殿中少监，为契丹族人。五代时期契丹和大贺氏结盟时候，契丹审密氏被赐姓孙。",
                    "⑶元代时期，曾任大都督的塔海，其后世子孙改姓孙，定居于山西省唯一的蒙古族聚居村——盂县秀水镇东白水村。",
                    "⑷明朝初年，朱元 璋禁止臣民使用胡姓，胡姓多为复姓，如公孙、叔孙，长孙，土孙、王孙、孟孙、仲孙、季孙、室孙、宫孙之类的复姓也在被禁之例，这类含“孙”字的复姓不得不省字而改孙氏。",
                    "⑸清朝时期，满洲八旗姓孙佳氏全族改孙氏。满族建立清朝之后，仿汉姓成普遍现象，孙佳氏取其首音，选“孙”作为姓。另有鲁布哩氏改姓孙氏。",
                    "⑹在景颇族的二十六个大姓中，格亮姓是景颇族的祖先，其他各姓都是由她繁衍而出的，格亮姓汉化为孙氏。另有木如氏、堵引氏等小姓的汉姓也都改为孙氏。另外，佤族中的木依库氏音译为孙氏。在今苗族、阿昌族、哈尼族、土家族、黎族、傣族等少数民族中，均有孙氏族人分布，其来源大多是在唐、宋、元、明、清时期中央政府推行的羁糜政策及改土归流运动中，流改为汉姓孙氏，世代相传至今。"
                ]
            },
            {
                "title": "孙姓分布",
                "content": ["孙姓自商末周初立姓之后，一直活跃在河南和山东一带。自春秋战国以来，孙姓发生了几次大的迁徙，其特点是自北而南，甚至出现了跨海域、跨国度的迁徙。根据《史记》记载，文中没有提到过“孙书（陈书、田书）”的名字。《左传·昭公十九年》当中分两处提到了“孙书”和“子占”。"]
            },
            {
                "title": "孙氏名人",
                "content": [
                    "春秋初，姬姓孙氏一直世袭卫国的上卿，权倾一国，孙姓在河南地区发展很快，到春秋末，孙氏在卫国失宠，北迁晋国、东迁齐国，齐国孙氏发展得蓬蓬勃勃，尤其在战国时期出了一位军事家孙武，其子孙明因父功而封富春侯，封地在今浙江富阳，形成了孙氏的南方著名郡望吴郡。",
                    "秦汉以后，由山东向四周拓展，西进山西太原，南达浙江南部，向西南达到湖北。三国时，孙坚父子在江南建立了吴国，孙氏的发展达到了顶峰。",
                    "在魏晋南北朝时，北方、中原和江南的孙氏都得到了迅速发展，出现一批孙氏名家大族。"
                ]
            }
        ]
    },
    "李": {
        "url": "li",
        "content": "李姓主要源自：嬴姓、姬姓。",
        "list": [{
                "title": "",
                "content": [
                    "1、源出嬴姓说。",
                    "即认为李氏源出嬴姓，血缘先祖为东夷族首领皋陶（一作咎繇，偃姓或赢姓），皋陶曾被任命为舜的大理（掌管刑法的官），遂以官命族为理氏（“理”“李”古字相通 ），先为理氏，后为李氏。得姓始祖为李利，李耳为十一世。",
                    "2、李树图腾说。即认为李姓起源于图腾崇拜，以李树为图腾。",
                    "李氏因大理之官而得姓为理，后因理徵避难以木子为食而姓李。因其所食为野生李，故由理氏培育成为家生李树，并以李树为神树，亦即图腾树。故凡李氏子孙，常于宅旁种李以为象征，至今还保存这个习惯。入李白家有桃李园，唐朝皇宫苑园多植李树。",
                    "3、源出姬姓（虎图腾）说。",
                    "商朝时期，有周的同姓后裔，名巴人，居钟离山（今湖北长阳西北一带）。周武王灭商后，封巴人于巴（今重庆的巴南区）称巴子国。公元306年，巴人在四川建立大成国，史称成汉，这是李姓在中国所建的第一个王朝。有一种观点认为李氏图腾不是李树，而是老虎。老子李耳生地陈楚地区的图腾是老虎，且“李耳”即楚语“老虎”。巴人以虎为图腾，巴语读虎为李，当虎图腾演化为姓时，巴人崇仰汉人之姓，遂依音用李姓。",
                    "4、源于封赏赐姓与恢复李氏。",
                    "蜀汉时期，诸葛亮平哀牢夷后，赐当地少数民族赵、张、杨、李等姓；",
                    "汉晋时期，北方游牧的少数民族内附，部分匈奴人和鲜卑人随之被赐为刘、李等姓；",
                    "北魏时期，孝文迁都洛阳后，实行文化上全面汉化政策，鲜卑族有复姓叱李氏被封为李氏。北魏皇室鲜卑拓跋氏实为汉将李陵后裔。",
                    "西夏皇室拓跋李氏，唐末时被赐为李氏，名义上是赐姓，实际是恢复李姓，因为西夏皇族拓跋氏为汉将李陵后裔。",
                    "唐朝时期，皇室赐予大臣或武将为国姓，先是徐、邴、安、杜、胡、弘、郭、麻、鲜于、张、阿布、阿跌、舍利、朱邪、董、罗等氏，因建国有功从李唐皇族姓李，稍后大食国人李诃末将军、李彦升和波斯人李铉、李珣均被王侯赐姓，再后来沙陀、氐、回纥、契丹、高车、吐蕃以及犹太、安息、高句丽、党项等外来少数族裔因功或者内附，多被封赏为李姓。"
                ]
            },
            {
                "title": "李姓分布",
                "content": [
                    "宋朝时期，李姓大约有560万人，约占全国人口的7.2%，排在王姓之后，为宋朝第二大姓。李姓第一大省是河北，约占全国李姓总人口的11.6%。在全国的分布主要集中于河北、四川、河南、山东，这四省李姓大约占全国李姓总人口的44%。其次分布于陕西、江西、山西、湖南等地。全国形成了围绕中原地区的新月形李姓聚集地带，这个地带由冀豫鲁、晋陕、川湘赣三大李姓聚集中心组成。",
                    "明朝时期，李姓大约有510万人，约占全国人口的5.5%，仅排王、张之后，为明朝第三大姓。宋元明时期，李姓人口不但没有增长，反而减少，600年中李姓总人口减少了10%。这与北方地区长期战乱，尤其是元朝的野蛮统治有密切关系。面对战乱和屠杀的受害群体首先是大姓汉族人群，李姓是北方地区的大姓，自然受到最惨重的损失。明朝时期，江西为李姓第一大省，约占全国李姓总人口的13.3%。在全国分布主要集中于江西、山西、山东三地，大约占全国李姓总人口的32.7%。其次分布于浙江、江苏、河北、福建、河南等地。宋元明期间，李姓的分布总格局变化较大，除了人口急剧减少以外，其人口主要由北方向东南迁移。全国重新形成了东南的赣苏浙闽、华北的晋冀豫鲁两大块李姓人口聚集地区。",
                    "当代李姓的人口已达9200多万，大约占全国人口的7.38%。从明确至今500年中李姓人口由510万激增到近9200万，近18倍。李姓人口的增长速度高于全国人口的增长速度。在全国的分布目前主要集中于河南、山东、四川、河北四省，大约占全国李姓总人口的32%。其次分布于广东、湖南、湖北、云南、安徽五省，约占李姓人口的25%。东北三省的李姓密度也较高，大约占10%。河南为李姓第一大省，大约占李姓总人口的10.3%。全国形成了中原、华北、云川、东北四大块李姓高密度聚居区。",
                    "李姓分布很广，但不均衡。李姓在西南、华北是最常见的姓氏。李姓在人群中分布频率示意图表明：在云南、四川南部、豫冀鲁晋大部、甘肃中部、吉黑大部，李姓一般占当地人口的比例在8.8%以上，覆盖面积约占了国图面积的18%，大约30%的李姓人口居住于此；陕甘宁蒙大部、川东、重庆、黔湘鄂、桂粤大部、苏皖北部、山东东部、辽宁等地，李姓一般占当地人口的比例在6.6%—8.8%，约占了国图面积的36%，大约51%的李姓人口居住于此；赣浙闽台、苏皖大部、桂南、海南、粤东、新疆西北、甘西等地，李姓一般占当地人口的比例在2.2%—6.6%，约占了国土面积的21.6%，大约19%的李姓人口居住于此。"
                ]
            }
        ]
    },
    "周": {
        "url": "zhou",
        "content": "周姓在《百家姓》中排第5位，周姓是一个多民族、多源流的古老姓氏，主要源于姬姓，台湾土著族、瑶族、东乡族、彝族、布朗族、白族、蒙古族、回族、土家族、保安族、黎族、壮族、羌族、朝鲜族等民族均有此姓。当代周姓的人口已达2400多万，为全国第九大姓，大约占全国人口的2.02%。在全国的分布:湖南、四川、江苏、湖北四省，大约占周姓总人口的34%。湖南居住了周姓总人口的10%，为周姓第一大省。",
        "list": [{
                "title": "",
                "content": [
                    "源于周昌,周姓的最早出现，可追溯到远古的黄帝时期。据《姓氏考略》所载，相传黄帝时就有一位叫周昌的大将，至商代又有一名叫周任的太史，这两个人的后代都以周为姓氏。",
                    "源于姬姓,出自姬姓，其始祖为周文王姬昌。黄帝的后代后稷，姓姬，是周族的始祖。周公东征胜利后，大规模分封诸侯，其中姬姓国就有53个。这些姬姓国的后人大多改以国名、地名及祖父名号为姓氏。公元前256年周被秦国所灭后，其中有相当一部分周宗室子孙及周朝遗民以周为氏。这一支通常被认为是中国周姓来源的主要部分。",
                    "源于少数民族",
                    "①南北朝时，北魏献帝的第二个哥哥，原姓普，后改姓周。《魏书·官氏志》记载：“献帝以兄为纥骨氏，后改为胡氏。次兄为普氏，后改为周氏。”献帝时，把北魏国拓跋氏分为七份，以七兄弟统率之。由此可知，拓跋氏改姓周氏的，不只献文帝的次兄一人，还有次兄统率的那一部分国人。周氏，是北魏国兴旺的七族之一。魏拓跋氏改姓周氏的后代，有隋朝名将周摇。周摇（约 507--590），字世安，是北魏献帝次兄普乃氏（普氏）的后代。",
                    "②唐朝上元年间，少数民族有“暨佐时”（音译）三字姓的，改为周氏。",
                    "③代北（今山西省东北部）的复姓“贺鲁”氏，改为周氏，贺鲁氏是由“夷”（少数民族）变为周姓。",
                    "源于其他姓氏",
                    "一是唐朝先天、开元年间，姬姓改为周姓。唐玄宗名叫李隆基，“姬”与“基”声音相近，当时长安姬姓，为避唐玄宗名讳，改为周姓。",
                    "二是五代后梁，成油的子孙改姓周。成油（仙锐），是唐朝末年的荆南节度使，他是淮西人，成油生前本姓成，并未姓周，他是死后才被梁太祖朱温赐姓周的。",
                    "三是元朝末年，福建泉州苏姓改姓周。唐朝末年，苏益人福建，定居同安，裔孙昌盛，成为南方大族之一。苏益的六代孙居住福建泉州卓源乡新康里，因遭粮累，财产没官，族人还受元朝官军围剿，各自逃难，其侄苏可安改姓周。自此以后，这支周氏族人繁衍，并迁移入台湾新竹县。",
                    "四是清朝初年，明朝长沙藩王吉王的子孙改姓周。明朝第一代吉王朱见浚，为明英宗第七子，成化十三年（1477年）就藩长沙。第四代吉王称为吉端王，吉端王的嫡子袭封，死后无嗣，吉端二子又袭封。明朝亡后，袭封的吉王逃往广东，死于缅甸。吉端王的第三子朱翊铤（yan延），封长沙郡王。朱翊铤的庶子朱万世，在明亡后，逃往宁乡周家，为避祸，改姓周，其子孙一直姓周。"
                ]
            },
            {
                "title": "周姓分布",
                "content": [
                    "周朝时期的迁徙,周姓最初发源于今陕西渭河平原地区。周初，大规模分封诸侯国，这些诸侯国广布于黄河中下游及江淮地区。周姓由西向东迁徙繁衍，与周王朝都城由陕西向河南东迁有着密切的关系。自平王东迁洛阳后，周氏得到了大举的繁衍，一度成为巨族。",
                    "战国秦汉时期的迁徙,周姓主要繁衍播迁于中国北方的广大地区，且以河南、陕西为两大中心。战国秦汉时期，秦灭六国时对各国贵族的迁徙，以及秦末战乱，为周姓的发展、扩散提供了条件。秦代的郡县制、汉代的郡国制，又使周姓有了形成郡望的机会。这一时期，周姓迁徙到今河南南部、江苏北部等地，并在当地形成望族，即汝南周氏、沛国周氏。两汉时期，河南、山东一带，是中国人口最多的地区。从西汉元始二年（公元2年）到隋朝大业五年（609年），600年间，河南人口约占全国人口五分之一。",
                    "魏晋南北朝时期的迁徙,魏晋南北朝之时，因北方长年战乱，出现了第一次民族大迁徙，周姓族人也随从中原的士族大举南迁。两晋时期，汝南安成周氏周浚一门三封，此后出现了周浚。周颤，周嵩。周馥等著名人物。",
                    "隋唐至宋时期的迁徙,隋唐前后，周姓又有大规模发展，唐末五代连续几十年的军阀混乱，特别是北宋末年金兵南下与南宋末年蒙古兵南下，这几次大战逼使河南、山东一带的中原周姓大量南迁，主要迁往福建、浙江、广东。唐宋战乱，中原周姓南迁闽浙粤。"
                ]
            },
            {
                "title": "当代分布",
                "content": [
                    "周姓分布密度示意图表明：周姓人口",
                    "单位面积内密度最高的地区在四川中部和江苏东南部和上海，每平方公里的周姓人口达到10人以上，最高可达到14人以上；其次在四川大部、贵州北部、湖北、湖南北部、安徽、山东东南、江苏北部、浙江大部，每平方公里的周姓人口达到6—10人。密度最高的（6人以上/平方公里）地区仅仅占国土面积的12.7%，周姓人口大约915万；2—6人/平方公里的地区占国土面积的36.4%，周姓人口大约1336万；不足2人/平方公里的地区占国土面积的50.9%，周姓人口大约293万。",
                    "周姓分布很广，但不均衡。周姓在人群中分布频率示意图表明：周姓在西南地区和长江流域地区中是最常见的姓氏之一。周姓在沿长江的西部和中部，即四川、贵州、湖南地区，一般占当地人口的比例达最高，在2.8%以上，有的达到4.2%以上；而在长江的下游地区周姓在人群中的频率一般在2.1%以上，江苏南部和上海地区达到2.8%以上。以上的覆盖面积占了总国土面积的21.8%。在东北三省、内蒙古东部、华北、陕甘宁、闽台、海南、两广等地区，周姓分布频率在0.7%—2.1%，其覆盖面积占了总国土面积的40.5%。其余地区周姓人口比较少，周姓分布频率不足0.7%，周姓分布的覆盖面积占了总国土面积的37.7%。"
                ]
            }
        ]
    },
    "吴": {
        "url": "wu",
        "content": "吴姓主要源自：姜姓、姬姓、姚姓。",
        "list": [{
                "title": "吴姓源流发展",
                "content": [
                    "与其他姓氏有所不同的，吴姓的起源稍稍有点复杂，涉炎帝、黄帝，还有少数民族。总的来说，大致有5个起源。"
                ]
            },
            {
                "title": "源于姜姓",
                "content": [
                    "吴姓第一个起源，是源自炎帝姜姓。早在黄帝之前，有一个属于姜姓的部落，这个部落以驺虞为图腾。",
                    "上古时，虞和吴同音，后来转为谐音，且字形相近，可以通用，到战国时期，虞、吴才开始区别。所以这支部落把图腾解释为吴，把吴作为部落的名字。",
                    "夏朝时，吴部落迁徙到观津（今河北武邑东）。夏王少康时期，吴部落有个人叫吴贺，以善射著称，曾和当时的神箭手后羿比射。这个姜姓吴部落的人，后来就以吴为姓氏，至今有5000年以上的历史。"
                ]
            },
            {
                "title": "源于姬姓泰伯",
                "content": [
                    "吴姓第二个起源，是出自黄帝姬姓。这个起源的吴姓，在历史上最有名气、对后世的影响最深远、人丁也最旺盛，是目前大多数吴姓人公认的吴姓起源。",
                    "商朝末期，黄帝后裔古公亶父带领部落在岐山下的周原（今陕西岐山一带）定居下来。他有3个儿子：太伯（又称泰伯）、仲雍和季历，季历儿子姬昌很有才能，古公想让季历做他的继承人，那样就可传给昌。太伯为了让位，与仲雍带着家眷远走南方的吴越一带，建立了吴国。 ", "《中国人名大辞典》收入了钱姓历代名人310名，占总名人数的0.68%，排在名人姓氏的第二十六位；钱姓的著名文学家占中国历代文学家总数的0.5%，排在四十八位；钱姓的著名医学家占中国历代医学家总数的1%，排在第二十一位；钱姓的著名美术家占中国历代美术家总数的1.05%，排在第二十一位。",
                    "春秋后期，吴国崛起，后来被越国所灭，吴国的遗民就以国为姓。这支吴姓至今有2600多年的历史。太伯没有儿子，他去世后，弟弟仲雍继立为吴君。仲雍接任国君后，继续开拓太伯奠定的基业。在吴姓的发展史上，仲雍的地位仅次于太伯。仲雍下传3代到周章。周章因不忘自己是周人后裔，故名为周章。周章继位时，周武王已灭掉商朝，建立了周朝。周武王大封天下诸侯，派人寻找太伯、仲雍的后裔。由于周章已当上吴君，就因地正式封周章为句吴国君，周章的弟弟仲，被封在周原附近的虞（今山西平陆境内），建立虞国，仲被称为虞仲。周武王又追封太伯为吴伯。太伯，被后世吴姓人称为开氏始祖。仲雍，被称为吴姓传代血缘始祖。"
                ]
            },
            {
                "title": "源于吴回",
                "content": [
                    "吴姓第三个起源，源自吴回。颛顼的孙子老童，有两个儿子：重黎和吴回。吴回的氏族，住在姜姓吴部落的故地。当时正处于舜的时代，舜把掌管火种的光荣使命交给重黎。后来，重黎因罪被舜杀了，让吴回继任祝融氏",
                    "夏朝时，吴回的氏族迁到山西平陆的吴山。",
                    "商朝时，这支氏族迁到山东临朐，史称王吴。商朝末期，有个叫吴伯的人，就是吴回氏族的后裔。算下来，这支吴姓的历史有4000多年。"
                ]
            },
            {
                "title": "源于姚姓",
                "content": [
                    "吴姓第四个起源，出自姚姓。舜是地处偏远地区的东夷族的一支部落的首领，接替尧的位置后，把部落迁到古吴之地（今陕西平陆吴山旁边的历山），史称有虞氏。",
                    "禹的儿子启建立夏朝后，封舜的儿子商均在虞地（今河南虞城），成为方国虞国。虞国的虞思，把两个女儿嫁给少康，还帮少康复兴夏朝。",
                    "商朝建立后，虞国衰落灭亡，虞国的遗民以吴为氏。秦末农民起义的首领之一吴广，就是姚姓吴姓的后裔。这支吴姓至今有3500多年的历史。"
                ]
            },
            {
                "title": "吴姓分布",
                "content": [
                    "自公元前473年吴国灭亡至今两千余年，吴姓子孙不仅在祖国内陆往复迁徙，而且还远播国外。早期吴姓主要迁往邻国越南、日本、朝鲜，后来又陆续迁往南洋诸岛繁衍生息。近代由于西方列强入侵，中国国门被打开，中西经济文化的往来加强，一部分吴姓子孙远迁欧美各国。而今随着全球一体化的浪潮，吴姓子孙已遍布全球。"
                ]
            }
        ]
    },
    "郑": {
        "url": "zheng",
        "content": "郑姓主要源自：姬姓、子姓、姜姓。",
        "list": [{
            "title": "主要源流",
            "content": [
                "1、源于姬姓，以国号为氏。出自周宣王之弟姬友的封地郑国，远祖为郑桓公。公元前375年，郑国被韩国所灭。郑国灭亡后，散居于京（今河南荥阳京襄城）、制（今荥阳西）、祭（今河南郑州东）、陈（今河南淮阳）、宋（今河南商丘）等地，为纪念故国，郑国人相继改姓为郑，自此，郑姓诞生。",
                "2、源自子姓。出自商王武丁之子子奠之后，子奠也称奠侯，以主持祭奠用酒而得名，为商朝一方国。公元前1046年，周灭商，子姓郑国也随之灭亡，周人迁子姓郑人到渭水上游，约在今陕西宝鸡附近。",
                "3、源自姜姓。出自姜太公之后。周灭商后，周武王封姜太公之少子井叔于郑，以统治子姓郑人，史称西郑，故城在今陕西凤翔县。周穆王夺西郑为下都，姜姓郑国灭亡。国人姓奠井氏，或为郑井氏，亦即郑氏。",
                "4、源于地名，以居邑名称为氏。出自古褒国附庸之邑南郑。韩哀侯灭了郑国后，郑国王族、国民逃迁至陕西汉中地区，以故国之名再建了一个小方国，史称南郑，并以故国名为姓氏，称郑氏。",
                "5、源于改姓而来：",
                "①朝鲜族改郑姓：朝鲜半岛上的新罗国第三代国王朴儒理执政时期，开始仿汉制分封授姓，其中的珍支部被封郑氏。",
                "②蒙古族改郑姓：属于以帝王赐姓为氏。蒙古族宝里吉特氏，世居喀喇沁（今内蒙古赤峰喀喇沁旗），清朝中叶以后所冠汉姓多为郑氏、宝氏、李氏、吉氏等；蒙古族正讷鲁特氏，世居察哈尔（今河北张家口一带），清朝中叶以后所冠汉姓即为郑氏。",
                "③裕固族改姓郑姓：裕固族增斯恩氏，原称增斯恩氏、赠坷斯氏，因姓氏过于繁复，后多简化成汉姓为郑氏。",
                "④哈尼族改姓郑姓：明朝弘治初年，知府陈晟把《百家姓》中开始两句的“赵钱孙李，周吴郑王”八个姓氏分别让当地的土司使用，哈尼族从此才有了郑氏。后来，一些哈尼族人在与汉族的交往中，受汉文化的影响，也在自己的名字前加上汉字“郑”，成为哈尼族郑氏的新成员。",
                "⑤满族改姓郑姓：满族济礼氏，亦称纪里氏，世居驽宜（今俄罗斯萨哈林岛）、长白山区、占尼河（今吉林梨树叶赫河支流）等地，后多冠汉姓为郑氏；郑佳氏，祖先原为汉族，东汉末期被辽东鲜卑乌桓部虏携，后逐渐融入鲜卑族，后逐渐演化为辽东女真，世居沈阳，清朝中叶以后所冠汉姓即为郑氏；弼噜氏，亦称碧鲁氏、必禄氏，世居叶赫（今吉林梨树叶赫乡）、乌喇（今吉林永吉）、扎库木（今辽宁新宾伊勒登河西岸）、黑龙江沿岸等地，后多冠汉姓为郑氏。"
            ]
        }, {
            "title": "得姓始祖",
            "content": ["郑桓公（?-前771年），西周时郑国的建立者，姓姬名友，周宣王之弟。周幽王当政时，郑桓公预感到西周将亡，听从太史伯建议，于周幽王九年（前773年），部族、家属等东迁到雒邑以东，建立新郑国（都城在今河南省新郑）。犬戎攻破西周时被杀。先秦时期，男子称氏，女子称姓，诸侯以国为氏，因此郑桓公被认为是姬姓郑氏始祖。"]
        }, {
            "title": "郑姓分布",
            "content": ["宋朝时期，郑姓大约有75万人，约占中国人口的0.97%，排在第二十位。福建为郑姓的第一大省，约占全国郑姓总人口的25%。在全国的分布主要集中于福建、河南、浙江三省，这三省郑姓占郑姓总人口的50%，其次分布于江苏、广东、江西、湖北等。中国郑姓的分布主要集中在东南沿海、豫鄂两块郑姓聚集区。",
                "明朝时期，郑姓大约有120万人，约占全国人口的1.21%，排在第十五位。浙江为郑姓第一大省，约占郑姓总人口的25%。在全国的分布仍集中于浙江、江西、福建，这三省郑姓大约占郑姓总人口的50%。其次分布于广东、广西、江苏、安徽等。中国郑姓的分布总格局变化较大，其人口主要向东南迁移，以浙江为中心的郑姓聚集区开始形成。",
                "当代郑姓人口分布频率，单位面积内密度最高的地区在浙东，每平方公里人口达到4.5人以上。其次在浙江大部、福建北部、江西东部、安徽中部、江苏中部、上海、吉林，每平方公里的人口达到2.7-4.5人。密度最高的（2.7人以上/平方公里）地区占国土面积的5.9%，郑姓人口大约181万；0.9-2.7人/平方公里的地区占国土面积的46%，郑姓人口大约608万；不足0.9人/平方公里的地区占国土面积的52.5%，郑姓人口大约148万。郑姓在浙江、福建、台湾，一般占当地人口的比例在1.5%以上，这部分高比例地区的覆盖面积约占了中国总面积的2.8%；在广东东部、湖南北部、赣鄂豫皖苏五省、山东南部、四川大部、贵州北部、陕西南部、内蒙古中部、陕甘宁北部、东北三省，郑姓人口比例通常在0.5%-1.5%，其覆盖面积约占了中国总面积的34.9%；其他广大地区，郑姓人口比例不足0.5%，其覆盖面积约占了中国总面积的62.3%，其中人口比例在0.1%以下的部分占国土面积的25%。"
            ]
        }]
    },
    "王": {
        "url": "wang",
        "content": "王姓主要源自：姬姓、子姓、妫姓",
        "list": [{
                "title": "",
                "content": [
                    "王姓，中华姓氏之一，主要源自姬姓，部分源自子姓、妫姓和少数民族改姓。",
                    "王由三横一竖构成，三横代表天、地、人，一竖贯通天、地、人，这就是天、地、人都要归“王”管的不二哲学。上古时期夏、商、周三代的最高统治者被称为“王”。“王”作为姓氏即来源于“王”这个至尊之位；东周时期的姬晋为王姓始祖。",
                    "根据国家统计局2014年公布的官方数据显示，中国大陆王姓人口达到9468万人，占全国总人口的7.1%，为全国第一大姓。",
                    "在中国，截至2014年，东部地区占了王姓总人口的38.3%，中部占了王姓人口的26.0%，西部占了王姓人口23.5%，东北占了王姓人口的12.2%。全国形成了以长江为界的高比率的北方王姓区和低比率的南方王姓区。"
                ]
            },
            {
                "title": "主要源流",
                "content": [
                    "1、源出姬姓。周灵王之子太子晋，",
                    "称王子晋，因值谏而被废为平民。其子宗敬仍在朝中任司徒之职，时人因其是王族的后代便称为“王家”，这支族人遂以王为氏。先秦时期，这支王姓一直活跃于河南洛阳一带，秦末汉初，王离之子王元和王威，为避战乱分别迁徙至山东琅琊、山西太原，最终发展成琅琊王氏和太原王氏的两大王姓望族。",
                    "姬姓王有三个分支",
                    "①源出东周毕公之后。周武王之弟毕公高封于毕国，春秋时其裔孙毕万任晋国司徒，受封于魏，战国时魏、韩、赵三家瓜分晋国。秦灭魏后，后裔魏无忌之孙魏卑子逃入山东泰山，汉初，魏卑子奉诏做官，被封于兰陵郡。因其是王家之后，故称其族为“王家”，从此以王为姓。",
                    "②源出春秋初周平王之后。周平王在位51年，太子早夭，周平王死后，由其孙姬赤继位，但姬赤的胞弟姬林夺了王位，史称周桓王。姬赤出奔晋国，子孙以其曾为王者而改姓王。一直到唐朝，这支姬姓王一直生活在山西临猗一带，史称河东猗氏王姓。",
                    "③源出周考王胞弟桓公揭之后。桓公揭封于王城，古城在今洛阳王城公园。其封地虽小但处于东周王城的西部，史称其为西周桓公。国亡之后，子孙迁到河南伊川和昭汝，以居王城改姓王，后来称为王城王氏。"
                ]
            },
            {
                "title": "部分源流",
                "content": [
                    "1、源出子姓。商朝末年，纣王荒淫无道，比干多次犯颜强谏，反遭杀害，其子孙因为比干原是王子，就以王为氏。从先秦至汉唐，子姓王氏一直居于河南地区，形成著名的汲郡王姓望族，后来散播到甘肃、山东、河北和山西等地。",
                    "2、源出妫姓。奉虞舜为祖先的妫姓王是王姓中重要的一支。武王灭商后，虞舜的后代妫满被封于陈，至陈完在齐国任官后，改为田氏。秦灭齐后，齐王田建之子田升、田桓由田姓改为王姓。这支王姓以北海和青州为郡望，汉朝王莽就源自此支王姓。",
                    "3、源出燕国太子丹之后。西汉末年，王莽篡汉自立，建立新朝称帝。燕太子丹玄孙名嘉，上献符命，为王莽所宠，赐姓王氏。",
                    "4、出自少数民族改姓。王姓大家族中融入了大量的少数民族的血液，少数民族用王姓的主要有：汉时匈奴人，西羌钳耳氏族，南北朝时高丽人，鲜卑族人，隋唐时月氏人，唐朝时回纥族阿布思氏族，契丹人，金朝时女真人，北宋时西夏党项人，元朝时蒙古人，清朝时满洲人等。这些少数民族王姓随着时间同化为汉族王姓。我国北方地区多王姓与北方民族改用汉姓时优先使用王姓有密切关系。"
                ]
            },
            {
                "title": "王姓分布",
                "content": [
                    "古代",
                    "宋朝时期，王姓大约有590万人，约占全国人口的7.7%，为宋朝第一大姓。王姓第一大省是山东，约占全国王姓总人口的14.7%。在全国的分布主要集中于山东、河北、四川、河南、山西，这五省王姓大约占王姓总人口的55%，其次分布于江西、陕西、浙江，这三省的王姓又集中了25.5%。全国形成了陕晋冀豫鲁、赣浙以及四川三大块王姓人口聚集中心。",
                    "明朝时期，王姓大约有620万人，约占全国人口的6.7%，仍为第一大姓。在全国的分布主要集中于浙江、江苏、山东，这三省王姓大约占王姓总人口的40%，其次分布于江西和山西，这二省又集中了17%。浙江一跃成为王姓第一大省，约占全国王姓总人口的13.7%。南方王姓在宋元明600年中有了大的发展，两广和福建的王姓人口已经大大超过了宋朝。而宋朝的王姓大省河北、河南和四川，这个比率已经降了一半。全国重新形成了赣浙苏皖、鲁豫晋冀陕两大块王姓人口聚集地区。",
                    "当代",
                    "截至2014年，王姓的人口已达到9468万人，大约占全国人口的7.1%。",
                    "在全国的分布主要集中于山东、河南、河北三省，大约占王姓总人口的28%；其次分布于四川、安徽、江苏、辽宁、黑龙江、山西、湖北、陕西、浙江、甘肃十省，王姓又集中了42%。山东居住了王姓总人口的10.5%。",
                    "全国形成了以长江为界的高比率的北方王姓区和低比率的南方王姓区。而北方区又以太行山为分水岭，东部为高密度的王姓地区。西部为低密度的王姓区。王姓分布很广，但很不均衡。",
                    "王姓在人群中分布在王姓在东北、内蒙古大部、山东、河北、北京、天津、河南大部、宁夏、陕西北部、甘肃东部和西中部、新疆喀什地区、海南大部，王姓占当地人口的比例在8.8%以上，有的达到16%，其覆盖面积仅占了总国土面积的29%，大约54%的王姓人口居住于此。",
                    "长江以北其他地区、青海东部、新疆北部、云贵川、广西西部，也是王姓常见的区域，王姓在人群中的分布比例为4.4--8.8%，其覆盖面积占了总国土面积的36.3%，大约36%的王姓人口居住于此。"
                ]
            }
        ]
    },
    "陈": {
        "url": "chen",
        "content": "陈姓主要源自：姚姓、妫姓。",
        "list": [{
                "title": "陈姓起源一",
                "content": ["出自舜帝姚重华裔孙陈胡公妫满，属于以先祖封地为氏。周武王将长女太姬嫁给满，备以三恪，奉祀虞舜。陈国始建都于株野（今河南 柘城胡襄镇）史称陈胡公，后迁都于宛丘（今河南淮阳城关一带），辖地最大时达十四邑，大致为河南东部和安徽一部分。从胡公受封至公元前479年，楚惠王杀陈湣公为止，陈国共历25世，延续568多年。陈亡后，陈的分支仕齐的陈公子完的后裔于公元前386年取代了姜姓齐国，史称陈氏（田氏）代齐。",
                    "陈姓出自姚姓和妫姓，舜帝姚重华的后裔。舜，也称虞舜，姚姓。据《通志氏族略》记载：周武王灭纣以后，建立周朝以后，找到舜的后人胡公满，封他在陈（今河南省淮阳县）这个地方，建立了“陈国”。子孙有以国为姓的，即成为陈姓的由来。舜在被选为尧的接班人前， 尧为了考察他， 让舜搬到妫水旁居住， 所以舜的部分后代便以所居住的这条河为姓， 为妫氏。 部分改姓的本姓是姚的族人后来有改回姚氏， 部分没有改回来， 便发展出其他姓， 比如陈姓——《 唐书· 宰相世系》： 部分又改回本姓姚的： 舜裔33世嫡长孙妫满封于陈， 至陈敬仲（ 陈完） 仕齐， 又改为田氏。 王莽封本姓为姚的姚氏族人田丰为代眭侯， 后丰子田恢为避王莽之乱， 过江徙居吴郡， 又改为妫姓， 其五代孙妫敷， 又改回为姚氏。 从姚姓发展到妫姓， 再到妫陈胡公满传至10世孙陈完， 陈国内乱， 陈厉公的儿子陈完怕株连自己， 出奔到齐国， 以故国为氏， 称陈氏， 后改田氏。 到十代孙田和时， 废齐康公而自立为齐太公， 并受到周王朝和诸侯列国的承认。 这就是历史上著名的“ 田代齐姜”。 公元前221年， 齐王建时， 齐国为秦所灭。 齐王建亡国后， 子孙纷纷改姓避难， 舜帝一系又经历了一次大分化。 田姓今在中华大姓中列第34位。 齐王建三子： 升、 桓、 轸。 升、 桓改为王氏， 其后代即汉代王莽一族。 轸奔楚为相， 后迁入颍川（ 今河南长葛）。 田轸复姓陈。 自秦汉以来， 由田姓复姓归宗的颍川陈氏一支， 在中国历史上十分显赫， 繁衍极盛， 播迁极广。 前文已经叙述， 从姚姓族人衍生出妫姓， 再妫姓改姓陈姓、 胡姓， 部分陈姓再改为田姓。 田姓族人再改为妫姓， 其五代孙妫敷， 又改回本族人最早的祖宗舜帝姚重华的本姓姚姓。 至舜帝姚重华嫡裔69世嫡长孙西汉谏议大夫冀州刺史姚平为保舜帝正统血脉， 避战乱而迁隐江南吴兴郡[今浙江省吴兴县]。 部分田姓族人改为王姓。 其它从从姚姓族人衍生出的姓氏没有改回族人最早的本姓姚姓的， 便继续发展出其他姓。 陈姓发展历程： 舜重之以明德， 自虞幕至虞舜， 有近1500多年的历史，《 韩非子》 说： 虞夏二千余岁。《 国语》 记载幕能帅颛顼者也， 有虞氏报焉； 杼能帅禹者也， 夏后氏报焉； 上甲微能帅契者也， 商人报焉； 高圉大王能帅稷者也， 周人报焉。 虞夏商周四代是奴隶社会的顶峰的代表， 华夏正统。 自黄帝至舜、 禹， 皆同姓而异其国号， 以彰明德。 因舜帝生于姚虚而姓姚， 其子商均生于妫汭而姓妫，《 尧典》 记， 舜“ 厘降二女于妫汭， 嫔于虞。” 夏代虞后， 虞族子孙亦姓虞， 姓妫， 姓姚， 姓王， 姓吴......在夏代， 有虞氏的首领虞思曾帮助禹的后代少康复国......；在商代，《 世本》 宋忠注：“ 虞思之后， 箕伯直柄中衰， 殷汤封遂于陈， 以为舜后是也。”； 在周代，《 史记》、《 左传》 记载：《 左传》 襄公二十五年：“ 之产曰： 昔虞阏父为周陶正， 以服侍我先王， 我先王赖其利器用， 与其神明之后， 以备三恪， 庸以元女太姬配胡公而封诸侯。”《 史记》 详细见陈杞世家； 自陈胡公以后其子孙姓陈， 姓胡， 姓袁......；陈完， 陈厉公之子， 陈氏重要支系， 详见田敬仲完世家， 陈完的子孙代姜齐称孤道寡， 陈完的子孙姓陈， 姓孙， 姓王， 姓田， 姓陆......，虞舜帝部分后裔简表， 商族姓氏参考宋微子世家， 此不累述。《 通志‧ 氏族略》。 "
                ]
            }, {
                "title": "陈姓起源二",
                "content": ["源于妫姓，出自春秋时期陈国公后裔，属于以国名为氏。陈国在妫满死后，其子孙有以国名为氏，就是陈氏。除陈完这一支主系之外，在陈国内乱至亡国期间，还有三支陈国公族后裔避居他乡，亦以国名为氏姓陈。",
                    "除了胡公满的子孙陈完这一支主系外，还有三支：一是陈哀公之子陈留，避居陈留郡；二是陈湣公之长子陈衍，避居阳武户牍乡或颍川；三是迁居固始，源于陈湣公次子陈温之后陈琏，其后因无子，便以颍川陈寔为嗣子，遂融入颍川陈氏。"
                ]
            }, {
                "title": "陈姓起源三",
                "content": ["少数民族陈姓，韩国朝鲜族陈氏：全部来自中国，本贯有130多个，但现存不到10个，主要是：江陵陈氏、广东陈氏、南海陈氏、德昌陈氏、罗州陈氏、骊阳陈氏、骊州陈氏、临波陈氏、梁山陈氏、三陟陈氏、神光陈氏、福州陈氏、杨州陈氏，这些陈氏的祖上都是从中国迁过去的。除梁山、广东本贯外全部是骊阳本贯的分支。骊阳陈氏是中国宋朝陈诱东渡后的子孙，梁山陈氏是明太祖时陈普才的后代，明朝末年又增添了东援将领陈磷的后孙，即广东陈氏。韩国的陈氏和中国朝 鲜族陈氏实际全部是中国汉族人被同化而形成的。",
                    "北魏鲜卑族陈氏 据《魏书·官氏志》记载：五代北魏鲜卑族原有三字姓侯莫陈氏，随北魏孝文帝迁都而到洛阳，在孝文帝实行汉化改革、改族姓时，于496年改为单姓陈氏。",
                    "女真族陈氏 主要系女真族皇族完颜氏所改，有的在金末已经形成。",
                    "蒙古族陈氏 是明太祖朱元璋赐给已经降明的蒙古贵族的姓。",
                    "满 族陈氏 有两种情况：一是后金努尔哈赤统治时，居住在东北的汉族陈氏，被强迫改为满族陈氏；二是本系满族姓氏，改为陈氏，仍属满族。",
                    "哈尼族陈氏 如国家民族委员会委员陈文兴、第五届政协委员陈批鲁等即是哈尼族陈氏。",
                    "侗族陈氏 如广西民族研究所副教陈衣、《优秀的传统建筑艺术》一书作者陈璃春园等即是侗族陈氏。",
                    "土家族陈氏 如第六届人民代表、湖 北人陈忠信即是土家族陈氏。",
                    "布依族陈氏 如贵州省民委副主任陈永康即是布依族陈氏。",
                    "瑶族陈氏 湖南新宁县黄卜洞瑶民、麻雷洞瑶民、圳源洞瑶民及汝城县瑶民个均有陈氏。广西大瑶山山子瑶十五姓也有陈氏。",
                    "京族陈氏 为该族大姓，如第六届人民代表、广西防城县人陈润芬(女)即是京族陈氏。",
                    "羌族陈氏 如第六届人民代表、四川茂汶县人陈花花(女)即是羌族陈氏。",
                    "回族陈氏 明成祖时，山东历城回 民陈氏被指定为葬于德州北郊北营村的苏禄东王墓供役。民国初年，由河南各地迁到湖北沙市三岔路、迎禧街一带的回 民有陈氏。",
                    "苗族陈氏 如广东省民族委员会委员陈斯德、城步县政协主席陈加寿等即是苗族陈氏。此外，壮族、黎族、彝族、朝鲜 族、白族、高山族、畲族等少数民族中也都有陈氏。"
                ]
            }, {
                "title": "陈姓起源四",
                "content": ["源于改姓，属于以帝王赐姓为氏。隋朝时期有一个叫陈永贵的将军，原来是陇右地区(泛指陇山以西地区，在今甘肃陇山、六盘山以西和黄河以东地带)的胡人，姓白，甚得隋文帝杨坚的宠信，官至柱国，领兰、利二州总管，封北郡陈公，陈永贵便以封号中的陈字作为自己的姓氏。",
                    "明朝统一全国后，朱元璋为笼络已经降明的蒙古贵族，往往赐给汉姓汉名，如恰恰赐名陈守忠，哈哈赐名陈元等。明成祖时，灭安南国黎朝，国王黎季厘寒流笔大多移居中国，其子改姓名陈澄，官至工部尚书。"
                ]
            }, {
                "title": "陈姓其它源流说",
                "content": ["商朝未年，舜的第33代孙遏父（又称阏父）投附了周国，担任陶正一职，他制陶的技艺极为精湛，博得了周文王的欢心。周武王灭商建周后，追封先贤遗民时，把遏父的儿子妫满封于陈（今河南开封以东，安徽亳县以北），国号陈，荣为侯爵，奉守着帝舜的宗祀，并将大女儿太姬嫁给他为妻。",
                    "妫满死后，谥号为陈胡公，所以又被称为胡公满。他的子孙有的以国为氏，就是陈氏。",
                    "公元前672年妫满的第12代孙陈完因避难逃到齐国，改姓田。后来他的10世孙田和建立了田氏齐国。战国末年，齐被秦灭。齐王的长子升次子桓先后改姓王氏，三子田轸逃至颖川（今河南禹州、许昌一带），恢复陈姓。从此陈氏一门在中原瓜瓞连绵，生生不息，发展成为名门望族。",
                    "陈姓还有一支是少数民族改姓，也出自河南，据记载，北魏孝文 时自山西大同迁都洛阳后，于496年将代北鲜卑族三字姓侯莫陈氏改为单姓陈氏。唐代中，环公(临海令)带着陈伯琪等六个儿子避难于莆田仙游，其第五子伯瑄(满公之70世孙)，那时因江南西道南康县有一位署官食禄的马聪与他友善。在造访马府时，两人结伴游览了庐山，后遂迷恋匡庐气势磅礴，蠡泽风景优美，乃偕其子旺徙而居之，晦迹于江州德安县太平乡长乐里永清村，伯瑄遂成为浔阳陈氏的开山之祖，德安位居江州 境内，九江之南，两地相距较近，因而被称之为江州陈氏.",
                    "唐初期、中期，陈氏有过两次影响深远的南迁福建之举。669年，朝廷派河东人陈政、陈元光，率兵镇压福建南部的少数民族动乱。经过九年战争，局势平定后，于686年报请朝廷批准，设置了漳州。"
                ]
            },
            {
                "title": "陈姓分布",
                "content": [
                    "陈姓是全球华人、韩国人、越南人的姓氏，在广东省、福建省、浙江省、海南省、 江苏省、香港、澳门以及台湾、新加坡 马来西亚都是第一大姓。中国姓氏密度图册中，陈姓分布与闽海民系的分布范围极一致，在浙南、福建以及广东沿海皆极高密度，呈极深红色，人口密度在7.8%以上，在珠三角、长三角呈次深红色，人口密度在6.5%-7.8%之间，在北方游牧民族的地区极少分布。南方地区陈姓位居第一大姓，则在北方地区位居第七大姓，超过很多北方典型姓氏。",
                    "陈氏是一个多民族、多源流的古老姓氏，在当今中国大陆姓氏排行榜上名列第五位，在台湾省则名列第一位；人口七千一百三十八万四千余，占全国人口总数的大约5.1左右。全球约达9800多万之众。",
                    "陈氏主要分布在我国南方地区，尤以广东、福建、四川、浙江、江苏、河南、湖北、湖南等省多此姓，在台湾省和广东两省，陈氏约占当地人口的10%以上。"
                ]
            }
        ]
    },
    "褚": {
        "url": "chu",
        "content": "褚姓主要源自：姬姓、子姓。",
        "list": [{
            "title": "褚姓起源一",
            "content": [
                "源于官位，出自春秋时期各诸侯国官吏褚师，属于以官职称谓为氏。褚师，亦称市令，是春秋时期周王室设置的一种官位，专职负责掌管集市和贸易，兼有今商务部长和工商管理局局长的职能。后来宋国、卫国、郑国等诸侯国都设有褚师之官。在史籍《左传·昭公二年》中就记载：“郑公孙黑请以印为褚师。”这里说的“印”，就是指郑国大夫印段，曾作著名的《蟋蟀》。褚师，就是市官，因此又称褚师印段、褚师印等。周景王姬贵五年(郑简公姬嘉二十六年，公元前540年)，郑穆公姬子兰之孙公孙黑曾试图作乱，被子产(公孙侨)发觉，予以制止。公孙黑自知不免一死，遂请求让印段出任褚师之职。由于印段确然十分有才华，子产便批准了公孙黑的请求，然后令公孙黑自缢而死，免得由司徒来论罪，那样会株连许多别的人。",
                "在褚师的后裔子孙中，多有以先祖官职称谓为姓氏者，称褚师氏，后省文简化为单姓褚氏，世代相传至今。"
            ]
        }, {
            "title": "褚姓起源二",
            "content": [
                "源于姬姓，出自周王朝邑地褚，属于以居邑名称为氏。据史籍《姓氏寻源》记载，西周时期，有一个叫“褚”的地方(今河南洛阳)，在史籍《左传》中更明确地提到洛阳县南部有一处褚氏亭，在史籍《后汉·郡国志》上也记载着洛阳有褚氏渠，两书同时认定都是“周有褚地，居之者以为氏”。在褚地居住之著民中，有以居邑名称为姓氏者，称褚氏。"
            ]
        }, {
            "title": "褚姓起源三",
            "content": [
                "源于子姓，出自春秋时宋国恭公之子段之后的封地，属于封邑名称为氏。据史籍《万姓统谱》、《通志·氏族略》等记载，褚氏出自子姓，本为殷商王族后裔。春秋时期，宋恭公(宋共公)子瑕有个儿子叫子段，字子石，食采于褚邑(今河南洛阳)，因“其德可师”，故时人称之为褚师。在子段的后裔子孙中，有以先祖封邑名称为姓氏者，称褚氏；亦有以先祖称号为姓氏者，称褚师氏，后也省文简化为单姓褚氏、师氏，还有以先祖之字为姓氏者，称石氏，皆世代相传至今。该支褚氏被史称为褚氏正宗。褚氏族人大多尊奉子段为得姓始祖。"
            ]
        }, {
            "title": "褚姓起源四",
            "content": [
                "源于满族，出自明朝时期女真褚库尔部，属于以部落名称汉化为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：满族褚库尔氏，亦称楚库勒氏、车勒库勒氏、车克里氏等，满语为Cukule Hala，世居楚库勒(今黑龙江支流黑河以北俄罗斯境内褚库尔村)，以地为氏。后有达斡尔族、锡伯族引为姓氏者。",
                "在清朝中叶以后，满族、达斡尔族、锡伯族褚库尔氏多冠汉姓为褚氏、楚氏、金氏等。"
            ]
        }, {
            "title": "褚姓起源五",
            "content": [
                "源于蒙古族，出自明末清初蒙古副都统萨尔图·褚库，属于以先祖名字汉化为氏。据史籍《清朝通志·氏族略·蒙古八旗姓》记载：蒙古族萨尔图氏，源出元朝时期撒勒只兀惕氏(山只昆氏)后裔，通古斯语为“Sartu”，世居敖汉部(今内蒙古赤峰敖汉旗)、扎鲁特(今内蒙古通辽扎鲁特旗)、叶赫(今吉林梨树叶赫乡)等地，后有满族引为姓氏者，满语为Sartu Hala。在明朝时期，萨尔图氏族人中即冠汉姓为山氏、萨氏等。",
                "萨尔图·褚库逝世后，其子萨尔图·海存承袭其职爵，并以父名“褚库”为姓氏。在褚库氏族人中，还有后裔子入伊斯兰教者，以先祖之名汉化为单姓，成为今天的回族褚氏，世代相传至今。"
            ]
        }, {
            "title": "褚姓分布",
            "content": [
                "褚氏是一个多民族、多源流的姓氏，在当今姓氏排行榜上名列第二百二十三位，人口约四十四万三千余，占全国人口总数的0.027%左右。褚姓在大陆与台湾均未列入前一百大姓。褚氏位列宋版《百家姓》第11席，褚姓的来源有两种说法。其一说是出自河南。春秋时宋国恭公的儿子子石由于德行可嘉，被恭公任命为“褚师”，相当于今天的市长的职位，其子孙就以此作为自己的姓氏。关于褚姓之源的另一种说法是，在《左传》中曾提到洛阳的南方有褚氏亭；《后汉书·郡国志》里又记载有褚氏渠，褚姓是因地名而得姓的。不过，不管是哪种说法正确，总之，褚姓的发源地在河南是可以肯定的。另外，到目前为止，尚未发现有褚被赐姓、冒姓的文字记载，褚姓的中国人在血统上是很单纯的。褚姓的中国人，还有最值得自夸耀，就是血缘上的纯种。别的大姓，也许由于树高影长的缘故，发展到后来都无可避免地混入了他族的血统，或被赐姓、被冒姓，以致增加了子孙的混淆不清，甚至无法确实追溯到自己的真正来处。而褚姓的后代就不会有这种困扰，因为到时下为止，还没有发现过褚姓被冒用的记录。褚姓虽然人不多族不繁，显得有点单薄，但至少有这一点是足以自喜的——姓褚的人，都是纯粹的汉族。另外一个值得褚姓中国人自傲的，就是他们的族人虽然不多，在历史上有名气的人却着实不少，象鼎鼎大名的唐朝有镇四长史褚秀之，“十八学士”之一褚亮，唐朝名臣褚遂良，就是中国民间家喻户晓的人物。褚遂良是唐太宗的谏议大夫，博学多才，直言敢谏，非常受到朝廷的器重。太宗临死时，并与长孙无忌同受顾命。这位一代忠良名臣，同时也是一位在中国书法史上具有崇高地位的大书法家，他的隶书和楷书，1300多年来享誉不衰。褚姓的起源是在河南，因此，褚姓郡望河南郡（汉高帝置。在今天河南省洛阳市一带）。",
                "湖南慈利 临澧 常德褚氏",
                "远祖遂良，十九世至通甫、明甫，原居河南开封府杞县白石村，元至正12年（1352）迁湖广孝感县。二十一世秀益又迁湖南慈利。递传至逢才公，居三都，生二子：文魁、文选，分为二房。清光绪18年（1892）始修族谱，1999年续修。以通甫为慈利一代祖。总祠位于慈利县南正街。",
                "慈利支派：国朝相延万年盛，家道宏开百世昌，尊祖敬宗光大典，敦仁本羲绍先芳，希明泽远传心学，登善德隆启忠良。圣代佑贤广辅佐，永膺福祚际嘉祥。湖南常德、津市、临澧也有褚姓。",
                "常德支派：正大光明，天开有道，百世昌。",
                "临澧支派：国朝相士万年盛，家道宏开百世昌，尊祖敬宗光大典，居仁由羲绍先芳。",
                "湖南华容万庾字藏岭褚氏"
            ]
        }]
    },
    "程": {
        "url": "cheng",
        "content": "程姓主要源自：风姓、姬姓。",
        "list": [{
            "title": "1、出自风姓，以国为姓，是重和黎的后裔",
            "content": [
                "重、黎是古史传说中的“五帝”时期的人物。他的后裔伯符在西周前期被封在程地，建立了程国。古程国的地望在汉晋时期的洛阳上程聚，也就是现在河南省洛阳和偃师交界处。程国的居民以国名为氏，于是就产生了程氏。",
                "传说，上古时候。民间祭祀很乱，社会很不稳定。颛顼高阳氏为了使百姓从杂乱的祭祀活动中解脱出来，安心生产，就委派他的孙子重为南正之官，掌管祭祀神灵；重的弟弟黎为火正之官，掌管民事。后来重和黎的子孙就世袭了这一官职。商朝时封重黎的孙子于程（今河南洛阳市东，也有说在今陕西咸阳市东），建立程国，称为程伯，其子孙以国名程为姓。",
                "北宋时欧阳修等人修撰的《新唐书》七十五卷《宰相世系表》中说：“程氏出自风姓。”南宋学者郑樵撰写的《通志·氏族略》也说：“程氏，伯爵，风姓。”由此可知，程氏源出于风姓。",
                "除程氏出自风姓外，任氏、宿氏、须句氏、颛臾氏也都源于风姓。风姓为太昊伏羲氏的后裔。太昊伏羲氏属于东夷部族，活动范围在今河南东部、安徽北部和山东西南部一带。河南淮阳有太吴陵，是太昊的都城所在地。",
                "风姓的首领称风后，生活在传说中的炎黄时代，他和中华人文始祖——黄帝有着密切的关系。据西晋时人皇甫谧的《帝王世纪》记载，一天晚上，黄帝梦见一阵大风刮起，把地面上的尘土污垢吹得一干二净。第二天早晨醒来，寻思昨夜的梦境，说道：“风能发号施令，是执政的象征。‘垢’字去掉‘土’旁，就是一个‘后’字。难道天下有一个姓风名后的贤人吗?”于是他依据自己对梦境的占解，派人四处寻找风后其人，终于在东海边上找到了他。黄帝把风后请来，拜他为宰相，帮助自己料理政治事务。",
                "‘土’旁，就是一个‘后’字。难道天下有一个姓风名后的贤人吗?”于是他依据自己对梦境的占解，派人四处寻找风后其人，终于在东海边上找到了他。黄帝把风后请来，拜他为宰相，帮助自己料理政治事务。",
                "风后能文能武，是一个多才多艺的人。他通晓兵法，著有兵书十三篇，后人称《风后兵法》。他还是一位伟大的发明家。有一次，黄帝和蚩尤在涿鹿之野进行战争。蚩尤施展法术，使大雾迷漫，三天不散。黄帝的将士迷失了方向，无法战斗。风后接受黄帝的命令，制造了一辆指南车，使将士分辨出东西南北，终于俘获蚩尤，取得了战争的胜利。",
                "到了黄帝的孙子帝颛顼时期，又有重和黎。是程氏的远祖。《国语》十八卷《楚语》记载观射父对楚昭王说：“及少吴之衰也，九黎乱德，……颛顼受之，乃命南正重司天以属神，命火正黎司地以属民。……尧复育重、黎之后，不忘旧者，使复典之，以至于夏、商。故重、黎世序天地，而别其分主者也。其在周，程伯林父其后也。”西汉著名史学家司马迁在《史记》一百三十卷《太史公自序》中也说：“昔在颛顼，命南正重以司天，北正黎以司地，唐虞之际，绍重、黎之后，使复典之，至于夏、商，故重、黎氏世序天地。其在周、程伯林甫其后也。”这两段话的意思是：颛顼继少吴之后登上帝位，任命重为南正，管天；黎为北正，管地。尧舜时代，又让重、黎的后代继续担任分管天地的官职，一直沿续到夏、商二代。周代的程伯休父，就是重、黎的后裔。",
                "观射父和司马迁都说，程氏是重、黎的后裔。关于重、黎的身世，古人有两种说法。一说重和黎都是颛顼的曾孙。颛顼有个儿子名叫称，称有个儿子名叫老童。老童有两个儿子，就是重和黎；另一说黎是颛顼的曾孙，重是少昊的儿子。",
                "重、黎都是传说中很有神通的人物。颛项继少吴之后担任帝王，当时人神杂糅，祭祀混乱，灾祸频仍。颛顼让重举上天，令黎抑下地，使天和地远隔，人与神分离，称为“绝地天通”。在今人看来，重和黎当然不可能有那么大的神力。对此事可以这样理解：颛顼将祭祀上天群神和管理土地民人这两种职责分开，让重负责祭祀天神祖先，让黎负责管理土地和民人。",
                "在古史传说中，重是一个半神半人的人物。有人说他是少昊的儿子。少昊又称金天氏，和太昊同属于东夷部族。他以鸟为图腾，设置的官职都以鸟命名。他的都城在穷桑，就是今天的山东曲阜。少吴一共有四个儿子，依次叫做重、该、修、熙。重曾担任过“木正”，他又被称作“句芒”。《山海经·海外东经》说：“东方句芒，鸟身人面，乘两龙。”把他描绘成鸟身人面、身骑双龙的神人。又有人说，重是颛顼的曾孙，曾担任“火正”，人们尊他为火神，称做“祝融”。祝融的遗墟在今河南新郑。因为他活动的地域在中原地区南部，因而他的宫职是“南正”。古人一致认为，黎是颛顼的曾孙。颛顼之墟在帝丘，就是今天的河南濮阳。黎曾担任过“北正”，一说是“火正”。黎部族主要在中原地区的北部活动。商周时期在今山西长治西南有一个黎国，可能是黎的后裔建立的国家。黎国是商王的一个重要与国，是商王朝的藩屏。因此周文王姬昌为实现灭商的大业，首先出兵攻打黎国，这就是“西伯勘黎”的故事。当时还有一个黎丘，又称黎侯城，在今山东郓城县西。这个黎国一作犁国，又称泥中。位于今河南浚县，汉代又称黎阳。由此可见，黎部族的活动范围是以今河南省的黄河以北地区为中心，西到今山西省东南部，东达今山东省西部地区。重、黎是古史传说中的人物，他们所处的时代距现在相当遥远，因而他们的身世和官职，史书记载说法不一。关于重的身世．一说他是少吴的儿子，属于东夷部族；一说他是颛顼的曾孙，属于华夏部族。对于这个问题，今人已难以分辨清楚。但是古书都说，程氏出自风姓。从这一事实出发，可以认为重和少昊的关系更为密切，应该属于东夷部族。因为风姓就属于东夷部族。重、黎所属部族记载的混乱，正反映了当时东夷部族和华夏部族逐渐融合，后人已难以准确区分的实际情况。重、黎在颛顼时分别开始担任掌管天地的官职，他们的后裔世代承袭了这一官职。到了尧、舜、禹时，又有伯益，是帝舜的辅臣。他曾经掌管火，用火焚烧山泽，驱逐禽兽。他能调驯鸟兽，又发明了掘井的技术，能凿地求水。他还和大禹一起治理洪水。大禹临死时，将帝位传给伯益。大禹的儿子启联合友党进攻伯益，将伯益杀死．自己做了国王，建立了夏朝。但是伯益的后裔在夏、商时代仍承袭掌管天地的职位，经久而无失。",
                "程氏得氏之前的远祖，黄帝时有风后，颛顼时有重、黎，舜、禹时有伯益。程氏的得氏，是在西周时期。"
            ]
        }, {
            "title": "2、以地名为姓",
            "content": [
                "传说，周宣王之时，重黎的裔孙程伯休父入朝为大司马，后又因攻占徐方(今山东滕州东南薛故城)有功，被封到程邑(今陕西咸阳市东，也有人说在今洛阳市东)，他的子孙有一部分人以地为姓，称程姓。",
                "据《元和姓纂》及《通志氏族略》所载，公元前11世纪时，周公旦公封诸侯，周文王第10子（一说第17子）受封于郇（近山东省临猗县），史称郇侯、郇伯。春秋时，郇国为晋国所并，其子孙以原国名“郇”为氏，后去邑旁，加草头为“荀”氏，春秋时，晋国公族叔受封于荀邑（今山西省正平县西），其后以邑名“荀”为氏。又据《左传杜预注》所载，春秋时，晋国荀氏的支子（非正妻长子或妾生子）食采于程邑（今山西省新绛县东北），其后以邑为氏，称程氏，是为山西程氏。",
                "西周后期，周厉王好利。他以荣夷公为卿士，拼命对百姓进行搜刮。他的奢贪暴虐，激起了国人的不满。他又派卫巫监视国人，一旦发现有非议时政的人就加以杀害。在这种专制高压之下，国人在路上见面不敢互相打招呼，只好用眼睛示意。国人忍无可忍，终于拿起武器围攻这位贪暴的国君。厉王逃到彘（今山西霍县）邑，不久死去。他的儿子姬静继承王位，史称周宣王。",
                "宣王在位时，周公和召公辅政，整饰政务，诸侯来朝，史称“宣王中兴”。周宣王在 国力有所恢复之后，曾亲自领兵征伐东南方的淮夷，程国的国君程伯休父也参加了这场战争。我国第一部诗歌总集《诗经》中的《大雅·常武》篇记载了这场战争，写道：“王谓尹氏，命程伯休父。左右陈行，戒我师旅。率彼淮浦，省此徐土。不留不处，三事就 绪。”诗句的意思是，周宣王亲自领兵征伐时叛时服的淮夷，派遣大臣尹吉甫为使者任命程伯休父为大司马。让他在左右摆布 阵势，监戒军队。程伯休父随周宣王出征，在对淮夷的战争中建立了显著的功勋。后来程伯休父到达都城镐京，在朝廷中担任大司马，封地改在咸阳附近的程邑。",
                "程伯休父担任大司马以后，他子孙中的一部分又以他的职宫——司马为氏，于是形成了司马氏。因此，程伯休父是程氏和司马氏共同的得氏始祖。",
                "程伯休父徙封的程邑，汉代为安陵县，在今陕西咸阳市东北。程邑，又称“毕程”或“毕郢”，是上古时代毕程氏的遗墟。商末周文王姬昌曾在这里居住过。后来密人降周，也迁居于此。因而它不可能是当时程国的都城。",
                "宋代人陈彭年等编纂的韵书《文韵》中有目“以国为姓”，说：“周宣王时程伯休父入为大司马。封于程。后遂为氏，与司马氏同。”《帝王世纪》曰‘文王居程，徒都丰’，故此加为上程。”"
            ]
        }, {
            "title": "3、出自商、周之际的伯符之后",
            "content": [
                "据资料记载，伯符是程姓的始祖。由于伯符向周王敬献“泰山之车、井中之玉和双穗之禾”这“三异之端”有功，被周王封在广平的程地，后世子孙以国为氏，称程姓。实则伯符是重和黎的后代。",
                "程氏因程国而得名，先有了程国，程国的居民后来就称程氏。至于程氏在何时何地得氏则诸说纷纭。就程氏得氏的时间而言，有西周初年、成康之际和宣王时期三种不同说法；就程氏得氏的地点而言，也有广平（今河省北鸡泽）、洛阳上程聚和安陵（今陕西省咸阳东）三种说法。",
                "程氏的得氏始祖名伯符，又称乔伯。他是重、黎的后裔，生活在商、周之际。《河南程氏正宗世谱》中有一首《迁徙歌》，写道：“古有重黎氏，程族由发初。历夫周兴际，伯符广平居。”这首歌概括了程氏始祖伯符初封广平的事。",
                "商朝末年，纣王无道，政治黑暗，民不聊生。关中地区有一个周国，在文王姬昌的管理下，政治清明，蒸蒸日上。姬昌得到了许多方国的拥戴，号称西伯。他在位时，已经奠定了灭商的基础。姬昌死后，儿子姬发即位，史称周武王。他继承父亲未竟的灭商大业，领兵东伐，在牧野(今河南淇县南、卫辉市北)打败了商王纣的军队。纣自焚而死，商朝宣告灭亡。",
                "周武王让商王纣的儿子禄父 (又称武庚)留在殷商故土，继续管理殷商遗民。在其周围建立了卫、鄘和邶三国，分封武王的弟弟管叔鲜、蔡叔度和霍叔处，以监视武庚，史称“三监”。又下令释放被商王纣关押在监狱里的贤人和百姓，将商王纣聚敛的 钱财、粮食散发给贫民和奴隶，然后班师西归。",
                "周武王回到关中的镐京(今陕西长安县西北)后，为了统治原商朝的广袤的土地和众多的人民，推行分封制度，将自己的同姓、灭商的功臣谋士和古代圣王的后代封在各地，建立国家。伯符也是古圣贤的后裔，因而被封在广平，于是伯符带领本家族人等，在那里建立了国家。",
                "广平是伯符的始封地，也成为程氏的发祥地之一。后来广平发展成为程氏的首要郡望。但是广乎不是程地，也不是程国。因此，它不是程氏得以命氏之地。槐塘《程氏世谱叙》转引西汉司徒程泰修撰的族谱说：“臣上世祖伯符先封广乎，后得封程国，遂氏焉。”"
            ]
        }, {
            "title": "4、出自姬姓是荀氏后裔以邑为姓而改",
            "content": [
                "据史料记载，春秋时，晋国荀氏的支子(非正妻长子或妾生子)食采于程邑（今山西省新绛县东北），其后裔以邑为姓，称程姓。",
                "春秋时期晋国出现了一些势力强大的姓族。荀姓就是其中之一。荀姓在西周时聚居在今山西省临椅县南部，后来迁到新绛县西。荀林父、荀宾、荀家、荀会等人都是晋国著名的卿大夫，是对晋国政局有一定影响的人物。晋国大夫荀骆的采邑就是程邑。有人说这个程邑就是关中地区咸阳东北的程邑。但是当时咸阳附近应该属于秦国的领地，晋国虽曾拥有“河西八城”，它的领地也难到达咸阳附近。因此我们认为，作为苟驩采邑的程邑，应该在今山西省境内。因为驩的采邑名叫程邑，他的子孙就以邑为氏，改姓程氏。"
            ]
        }, {
            "title": "程姓分布",
            "content": [
                "全国程姓人群较多的省区，有河南、安徽、山西、河北、陕西、浙江、湖北、江苏、江西、四川、山东、广东、广西、甘肃、宁夏等。下面具体介绍程氏居民较多的县市。",
                "河南省：睢县、嵩县、伊川、洛宁、偃师、太康、鲁山、济源、孟县、登封、兰考、沁阳、开封、唐河、长垣、滑县、尉氏、卢氏、夏邑、修武、巩义等。"
            ]
        }]
    },
    "崔": {
        "url": "cui",
        "content": "崔姓主要源自：姜姓。",
        "list": [{
                "title": "",
                "content": [
                    "源于姜姓，出自西周时齐国君主齐丁公伋嫡长子季子的封地，属于以封邑名称为氏。《元和姓纂》卷三载：“姜姓。齐太公生丁公伋，生叔乙，让国居崔邑，因氏焉。”《新唐书·宰相世系表》载：“崔氏出自姜姓。齐丁公伋嫡子季子让国叔乙，采食于崔，遂为崔氏。”《通志·氏族略》载：“姜姓，出齐丁公伋，季子让国叔乙，食采于崔氏，遂为崔氏。”姜太公姜尚的儿子丁公伋，是西周时期齐国的第二代国君，他有个嫡子名季子，本应按礼制继承齐国君位，季子却让位于姜得(史称让国叔乙，即齐乙公姜得)，自己则采食于封地崔邑。在姜季子的后裔子孙中，有以先祖封邑名称为姓氏者，称之为崔氏，世代相传至今已有三千余年的历史。",
                    "西周初年，炎帝裔孙姜尚因辅佐文王、武王灭商建周有功，被分封于齐，建齐国，为公爵。数传至齐丁公时，有嫡子姜季子应袭公爵，但辞而不受，让位于叔乙。叔乙继位后，封季子卿大夫把崔邑（今山东邹平县魏桥镇崔八村）赏赐给他作为食邑。从此，季子的子孙便在崔邑居住下来，后来季子后裔把食邑的名称崔当作姓氏，从而发展成为今天的崔姓。",
                    "崔姓得姓以后，世代在齐国担任重要官职，是当时的公卿世家之一。如季子八世孙崔杼是齐国权臣，独揽朝政大权多年。后来由于他在政争中失败，崔姓才在齐国失去权势，避居鲁国（今山东曲阜一带），续任鲁卿大夫，仕宦罔替。秦朝时，崔杼裔孙崔意如被封为东莱侯。入汉以后，崔意如长子崔业（字伯基）袭封这一爵位，并在清河东武城（今河北清河东北）定居下来。崔业弟崔仲牟，另居博陵安平（今属河北），二人的后代在汉魏南北朝及隋唐时各发展成为强宗大族，名贤辈出，史称清河崔氏和博陵崔氏，为“七宗五姓”之首。由于两支崔姓人繁衍众多，加上仕宦迁徙等原因，崔姓又进一步分衍出郑州崔氏、鄢陵崔氏、南祖房崔氏、青州房崔氏、清河大房崔氏、清河小房崔氏、博陵安平房崔氏、博陵大房崔氏、博陵第二房崔氏、博陵第三房崔氏等定著十房，光在唐代崔氏累计出了29位宰相。当时天下有“言贵姓者莫如崔卢李郑王”的俗谚，崔姓被当作天下最著名的姓氏之一，公认为“天下第一高门，北方豪族之首”。",
                    "东汉以后，博陵崔氏与清河崔氏俱为山东望族，北朝时讲究士族门第，崔氏被列为一等大姓「崔卢李郑王」。",
                    "南北朝时，博陵崔氏为第一等的高门大族。至唐朝初年，全国郡姓中位居首列的五姓七家中，崔姓占了两家，即博陵崔氏与清河崔氏。",
                    "唐初，按士族门第排姓氏，称“崔、卢、李、郑、王”均为一流士族。唐初官员修订《氏族志》时，依习惯把崔氏列为第一大姓，唐太宗知道后大怒，说：崔氏既无显官，又无人才，凭什么列为第一？难道我李氏贵为天子，还比不上崔氏吗？后来唐政府下令改皇室李姓为第一，皇戚族长孙氏列第二，崔姓及其他山东士族列第三。",
                    "源于朝鲜民族，出自唐朝时期朝鲜半岛新罗国留唐学生，属于汉化改姓为氏。据《新唐书》所载，唐朝时期，朝鲜半岛新罗国有崔氏。新罗国，是公元四世纪由三韩的辰韩斯卢部所建，都城为金城(今韩国庆尚道庆州)。从公元四世纪末起，新罗国先后与前秦、南齐、梁、北齐、陈、隋、唐登王朝通交，大力吸收中国汉文化。期间使用汉字并创造了用汉字标音的吏读文。从唐永淳元年(公元682年)起，新罗设立国学，通读《论语》、《礼记》等汉文经典书籍。当时，包括僧侣在内的新罗留唐学生很多，其中学有所成者亦不少，为朝鲜民族的文化发展作出了巨大贡献。唐朝时期，有大量新罗留唐学生因唐王朝的历代宰相除了皇族李氏以外(有六十一人)，就属崔氏最多，足有三十六人，遂以其姓为汉姓，成为后来的高丽大姓崔姓氏族。高丽崔氏本源不一，分别有庆州、全州、东州、海州、朔宁、江隆、和顺、江华、永川、耽津、鸡林、水原、隋城、牛峰忠州、通川、阳川、开城、稷山、龙州、兴海、杨州、汉南……等一共四十三个本贯派系，各不相属，彼此之间没有直系血缘关联。",
                    "源于蒙古族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·蒙古八旗姓》记载：蒙古族崔珠克氏，亦称赤穆特氏，源出蒙古察哈尔部，世居察哈尔(今河北张家口一带，包括河北、内蒙乌兰察布盟、锡林郭勒盟一部、山西部分地区)，后有汉族引为姓氏者，满语为Cuijuk Hala。清朝中叶以后，蒙古族、汉族崔珠克氏多冠汉姓为崔氏。",
                    "源于其他少数民族，属于汉化改姓为氏。京族、彝族、回族、土族、等少数民族中，均有崔氏族人分布，其来源大多是在唐、宋、元、明、清时期中央政府推行的羁糜政策及改土归流运动中，流改为汉姓崔氏，世代相传。源于被土家族同化，崔姓十五世孙崔如意为秦朝大夫，有二子，长子崔伯基，次子崔仲牟。其后裔明征南侯崔友，系陕西西安府三原县人。明朝初年，崔友奉朝命，偕兄崔泰由陕西咸阳率兵入黔，保境安民，兴教化，发展生产。后崔泰回原籍，崔友卜居贵州沿河祐溪，是为沿河崔氏始祖。崔友定居后与当地土家族人通婚被同化为今贵州、重庆、四川等境内的土家族崔氏。"
                ]
            },
            {
                "title": "崔姓得姓始祖",
                "content": [
                    "“崔”得姓始祖：崔季子",
                    "相传炎帝神农氏为少典之子，因居于姜水（渭水支流）之滨而得姜姓。西周初年，其后人有姜姓吕尚，字子牙，人称姜子牙，因辅佐武王灭商有功，被封于齐（今山东北部）。姜太公之子在周成王时为齐丁公。",
                    "季子名德兴，生卒不详。炎帝五十六世孙，齐丁公伋四子（嫡子）。丁公卒後季子应继君位。但季子仁爱贤良，孝悌有加，举贤让国於叔乙。季子携家人隐居景色秀丽之崔邑，後以邑封姓，其子孙遂为“崔”姓。史称“崔氏始祖”。齐丁公伋另一支系子孙以諡号为姓“丁”，故，齐丁公伋为“崔”、“丁”两姓先祖。",
                    "注：季子，古人排行以“伯仲叔季”之排行，“季”应为四，故季子在兄弟中排行为四。但，确是正妃所生，故君位应传给季子。叔乙在兄弟中排行老三，但因其为庶兄，古时嫡和庶有地位上的差别。"
                ]
            },
            {
                "title": "崔姓分布",
                "content": [
                    "当代崔姓的人口已达到420多万，为全国第五十八位姓氏，大约占全国人口的0.34%。自宋朝至今1000年中崔姓人口呈下降的态势。在全国的分布主要集中于中原地区河南、山东、河北三省的崔姓占崔姓总人口的42%。其次分布于辽宁、山西、黑龙江、江苏、陕西、吉林，这六省的崔姓又集中了32%。全国形成了关内冀豫鲁、关外黑吉辽两块崔姓聚集地区。自明朝至今600年期间，崔姓人口流动由东南部向华北、华中的回迁十分强劲，东北的崔姓迅速增长。崔姓在华北和东北地区是比较常见的姓氏之一。崔姓在人群中分布频率示意图表明：在鲁豫晋、冀京津、黑吉辽、内蒙古大部、陕西大部、甘肃东端、鄂皖苏北段，崔姓一般占当地人口的比例在0.6%以上，中心地区可达1.4%以上，以上覆盖面积约占了总国土面积的25.4%，居住了大约7l%的崔姓人群。在甘肃大部、宁夏、陕西南端、内蒙古中西部、川渝北段、湖北大部、皖苏中部、云南中部，崔姓一般占当地人口的比例在0.3%--0.6%之间，以上覆盖面积约占了总国土面积的14.6%，居住了大约14%的崔姓人群。"
                ]
            }
        ]
    },
    "刘": {
        "url": "liu",
        "content": "刘姓主要源自：祁姓、姬姓。刘姓，最早一支刘姓源自尧的后裔刘累，故刘累为刘姓得姓始祖。刘姓望出江苏彭城。至2013年有人口近7000万，占全国人口的5.34%，在王、李、张之后排第四位。刘姓建立了西汉、后汉、南汉等政权。",
        "list": [{
            "title": "起源演变",
            "content": [
                "据史记《汉书》、《通志·氏族略》和《中国姓氏》所载，刘姓的起源主要有三支：祁姓、姬姓、外族的改姓。",
                "1、最早的一支来源于祁姓，是帝尧的后裔，形成于夏朝后期，出自今河南鲁山。",
                "祁姓之刘有同出一源的两支：一支直接出自刘累，形成于夏朝；一支出自刘累后裔士会，形成于春秋初期。",
                "刘累生于夏朝后期，曾经跟着精通养龙技术的豢龙氏学过驯化龙的本领，为夏朝第十三帝孔甲驯养4条龙，因而被孔甲赐姓为御龙氏 。刘累在为孔甲养龙时住在今河南偃师县南。后来，由于饲养不善，死了一条雌龙，刘累怕孔甲治罪，就偷偷地带着家眷南逃到鲁县（今河南鲁山县）躲了起来。刘累的子孙以刘累的名字为姓氏，就是中国最早的刘姓。",
                "2、源于姬姓的刘氏形成于春秋时期，系以邑为氏，出自今河南偃师。",
                "3、外族的改姓",
                "(1）赐姓：项羽的叔父项伯，因在鸿门宴对刘邦有救助之功，刘邦赐其家族姓刘。公元前202年，刘邦在洛阳即皇帝位后，接受戍卒娄敬定都关中的建议，决定把国都迁到长安，并因此赐娄敬姓刘。",
                "（2）西汉初年：匈奴族刘姓。当时，匈奴部族强盛，汉高祖刘邦采取和亲政策，把皇室宗女嫁给匈奴单于冒顿为妻。冒顿姓挛，但按照匈奴贵者皆从母姓的习俗，挛氏子孙皆姓刘。",
                "（3）魏晋十六国时期：匈奴族的一支为争取中原人民的支持，自称是汉朝公主与匈奴单于的后裔，一直使用母方的姓氏故而姓刘。他们先后在今山西、陕西、内蒙地区建立了汉、前赵和夏三个政权，后定居河南。史称“河南刘氏”。前赵的建立者刘渊即是匈奴贵族。",
                "（4）北魏“勋臣八姓”之一有独孤氏，孝文帝于太和二十年（494年）自山西大同迁都洛阳后，于496年实行汉化改革，将鲜卑族的独孤氏改为刘氏。",
                "（5）唐末五代时期，突厥别部沙陀族的一支也冒称是刘邦的后裔。五代十国中的后汉政权和北汉政权就是由沙陀刘氏建立的。",
                "从西汉初期的匈奴贵族内附，南北朝的鲜卑族进入中原，一直到清朝的满洲八旗汉化，这期间有大量外族人改姓刘姓。华北地区，尤其在河南地区的刘姓含有匈奴、鲜卑人的基因；东北地区的刘姓主要掺和了满族和蒙古族的血液。"
            ]
        },{
            "title": "刘姓分布",
            "content": [
                "刘氏早期主要是在北方发展繁衍。",
                "公元前300多年前，刘姓开始向河南及江苏传播。战国时有个叫会的晋大夫，他有子孙留居秦国，称刘氏。至战国后期，秦国灭了魏国，刘氏宗族随秦军进入魏国都城大梁，即今河南开封。他的十世孙在魏国任职，魏灭后迁至大梁，生子刘清辗转到今江苏等地。",
                "汉朝是刘姓的鼎盛和发展时期，汉高祖刘邦建立西汉王朝后，分封同姓于各地，其后支派繁衍，于是彭城、尉氏、临淮、南阳、广平、丹阳等地皆有刘氏。西汉初累计皇子封王30余人，封侯者达400余人。汉王室大封同姓王侯的结果使刘姓贵族遍布于大江南北，他们各据一方，很快成为各地有权有势的大家族。总之刘姓以皇族为主脉，经历大汉400多年的繁衍发展，人口急剧增加，成为当时的天下第一大姓。但刘姓人口仍主要分布于黄河流域地区，主要集中于河南、河北、山东、江苏北部、安徽北部以及山西太原地区。此外，湖北荆襄地区、湖南长沙地区、江西九江地区也有刘姓望族。",
                "汉末三国之际，中原的刘氏为避“董卓之乱”不断向四方迁徙，主要是向东南投奔孙吴和向西南进入四川投奔蜀汉。",
                "魏晋南北朝时期，中北方又一次陷入战乱，中原刘姓与其他姓氏一样，为避战乱，向南方、东南和西南迁移，部分迁往日本和朝鲜半岛。从东晋到唐朝，中原地区向南方和东南地区的移民从未间断，移民越来越大，地域越来越远。",
                "唐宋时期，刘姓已遍布大江南北，“遍地刘”已初步形成。刘氏开始迁往两广，唐末中原人口大批移民福建，这也包括刘姓人群。南宋宁宗嘉定年间，河南宣抚使刘龙第七子刘开七，在广东潮州任官，子孙遂居于兴邑，人丁兴旺，支派益繁，后又自兴宁分散至许多地方；北宋时的《广韵》列刘氏郡望有25个。",
                "从明末清初开始，闽、粤刘氏陆续有人移居台湾，后又有不少人到海外谋生。"
            ]
        }]
    },
    "张": {
        "url": "zhang",
        "content": "张姓主要源自：姬姓、聂姓。张姓，中华姓氏之一，是一个典型的多民族、多源流姓氏，主要源自姬姓及少数民族改姓等。张挥为该姓始祖。历史上，西汉时期张耳被刘邦封为赵王，张耳的十七世孙张轨（255年－314年）建立前凉国。张姓在宋版《百家姓》位列第24位。至2007年，根据公安部治安管理局对中国户籍人口的统计分析显示，张姓人口在中国姓氏中排在第3位，共有8750.2万人，占中国人口总数的6.83%。张的本义是“使弓弦”，把弦绷在弓上，将要开弓，与“弛”相对。引申为开弓、上弦、捕捉、伸展等意义。张，也是星名，属朱雀七宿中的第五宿，天象的排列形状似弓。张是擅长制造弓箭的氏族崇拜的原始天象图腾，进而成为氏族名、地名和姓氏。",
        "list": [{
            "title": "源于姬姓",
            "content": [
                "①出自上古黄帝之孙挥，属于以官职称谓为氏。",
                "这一支张姓以青阳（即清阳，在今河北清河县东面）为发源地，是为清河张氏。民间有“天下张姓出清河”的说法。",
                "②出自黄帝姬姓的后代，属于以字为氏。春秋时，晋国有大夫解张，字张侯，他的后代以其字命氏，也称张氏。"
            ]
        },{
            "title": "源于改姓而来",
            "content": [
                "①出自聂姓。三国魏将张辽原姓聂，其家族为了避怨而改张姓，其子嗣便以张为姓。",
                "②出自赐姓。世居云南的南蛮酋长龙佑那，于三国时被蜀相诸葛亮赐姓张，以后其子孙便以张为氏。",
                "③源于古奚族。张忠志，奚族人，居住在范阳，因善骑射，被范阳守将张锁高收为义子，遂从义父姓张。后张忠志屡立战功，官至礼部尚书，封赵国公。",
                "④由少数民族改姓而来。古代的乌桓、女真、羯、鲜卑、匈奴、契丹等少数民族，有改姓为张姓的。今阿昌族、纳西族、僳僳族、瑶族、壮族、黎族、高山族、藏族，以及赫舍里氏、扎拉里氏、章佳氏、章锦氏、扎库塔氏、爱义氏等十几个满族姓氏，都有人改姓张。"
            ]
        },{
            "title": "张姓分布",
            "content": [
                "宋朝时期，张姓大约有490万人，约占全国人口的6.3%，为宋朝第三大姓。张姓第一大省是山东省。在全国的分布，主要集中于山东、河南两省，大约占张姓总人口的27.7%，其次分布于四川、河北、陕西、湖南、湖北、山西、甘肃、江西八省，又集中了54.5%。全国形成了华北、西北和中原地区张姓人口聚集中心。",
                "明朝时期，张姓大约有560万人，约占全国人口的6%，为明朝第二大姓。在全国的分布，主要集中于江苏、浙江、江西三省，大约占全国张姓人口的36%，江苏省成为张姓第一大省。全国形成了南方赣浙苏、北部晋鲁冀豫陕两大块张姓人口聚集地区。",
                "当代，张姓的人口已达到近8500万，为全国第三大姓，大约占全国人口的6.79%。自宋朝至今，1000年中张姓人口的增长率是呈上升的态势。在全国的分布主要集中于河南、山东、河北三省，大约占张姓总人口的27.5%，其次分布于江苏、四川、安徽、辽宁、黑龙江、湖北六省，又集中了28.5%。河南居住了张姓总人口的10.1%，为当代张姓第一大省。全国形成了以长江为界的高比率的北方张姓区和低比率的南方张姓区。"
            ]
        }]
    },
    "杨": {
        "url": "yang",
        "content": "杨姓主要源自：姬姓、扬姓。杨（Yang）姓源出主要有：",
        "list": [
            {
                "title": "源自姬姓",
                "content": [
                    "出自黄帝之后西周王族，有三种说法，其源均为周朝王室。",
                    "①源于周武王孙，叔虞次子，晋侯燮父之弟。晋武公（叔虞十一世孙）时，封次子于杨，称杨侯，是为杨姓人的受姓始祖。",
                    "汉字演变",
                    "②源于周宣王子长父。宣王时期，周宣王姬静将子长父封到杨国（今山西省洪洞县），为杨侯，春秋时杨为晋所灭，其后裔以杨为姓。",
                    "③源于晋武公子伯侨。晋灭杨后，封杨地为大夫羊舌肸（字叔向）的食邑。羊舌氏出于姬姓，因晋武公次子伯侨之孙突当时食邑于羊舌，故以羊舌为姓。至晋顷公十二年（前514年），晋灭羊舌氏，食我的儿子杨道逃到华山，居住在弘农华阴，以祖宗封地杨为姓，其后代开基各地，成为杨氏繁衍发展的主流，史称杨氏正宗。"
                ]
            },
            {
                "title": "源自扬姓",
                "content": [
                    "古时杨扬不分，以邑为氏。"
                ]
            },
            {
                "title": "源于改姓而来",
                "content": [
                    "改杨姓，主要由同源、避难、避仇、收养、过继、赐姓以及少数民族改姓等构成。",
                    "杨姓起源说",
                    "①赐姓：隋代杨义臣本姓尉迟氏，鲜卑族，为北魏勋臣八姓之一。义臣之父尉迟崇，隋初随行军总管达奚长儒与突厥交战，力战而死。隋文帝因对尉迟崇功业的追忆，下诏赐义臣国姓杨氏。三国时，诸葛亮平定哀牢夷（湖南、贵州的僚族分支）后，赐当地少数民族为赵、张、杨、李等姓。",
                    "②收养：西晋氏族首领百顷氐王杨飞龙，收养外甥令狐茂搜，改其姓为杨氏。杨复光，本姓乔，少时养于内侍杨玄价家，遂转姓杨。杨守亮，本姓訾名亮，杨复光平定江西黄巢起义军时，得訾亮，养为假子，转姓杨，改名守亮。",
                    "③避难：今浙江省诸暨市的概浦杨姓，为倪姓所改。倪盈第八世孙倪炤，仕宋为龙图阁学士，因反对王安石的变法，遭流新州。当时，倪炤的幼子倪顺尚在襁褓之中，匿概浦外家。官府勾之，外祖母孟氏以幼舅同庚者易之，得以保全。及倪顺长大，力学皆优，念外家杨姓之恩，改为杨姓。",
                    "④少数民族改姓：北魏孝文帝迁都洛阳后，施行汉化政策，其中的莫胡卢氏改为杨姓。白族中，杨姓一直是主要姓氏，唐朝时为白族第一大姓。"
                ]
            },
            {
                "title": "得姓始祖",
                "content": [
                    "杨伯侨，又名文实，献公之弟。周襄王念其先人功勋，仍封伯侨于杨，为杨侯，承继乃祖爵位，谥贤敬。"
                ]
            },
            {
                "title": "杨姓分布",
                "content": [
                    "宋朝时期，杨姓大约有210万人，约占全国人口的2.7%，排在王、李、张、赵、刘、陈之后，为宋朝第7大姓。杨姓第一大省是四川。在全国的分布主要集中于四川、陕西、山西，这三省杨姓大约占全国杨姓总人口的46%；其次分布于河南、河北、湖南，这三省的杨姓又集中了20%。全国形成了以川湘、陕晋、冀豫为中心的三大块杨姓聚集地。",
                    "明朝时期，杨姓大约有240万人，约占全国人口的2.5%，为明朝第6大姓。在全国的分布主要集中于浙江（11.1%）、江西（10.7%）、江苏（10.3%）、山东（10.1%），这四省杨姓大约占杨姓总人口的42%；其次分布于山西（9.4%）、四川（7.8%）、福建（7.6%）、陕西（5.9%）、湖南（5.5%），这五省的杨姓又集中了36%。浙江一跃成为杨姓第一大省。宋、元、明600余年中，全国人口纯增长率是20%，杨姓人口增长比全国人口的增长速度要慢些，杨姓人口总增加率仅为13%，净增加了30万。杨姓人口的分布总格局也发生变化，人口主要向东南地区迁移。全国重新形成了浙苏鲁、赣闽、晋陕、川湘四大块杨姓人口聚集地区，重心由西部传到了东南部。",
                    "当代，杨姓总人口已超过4000万，为全国6大姓之一，约占全国人口的3.1%。在全国的分布主要集中于四川、河南、云南三省，大约占杨姓总人口的30%；其次分布于山东、湖北、湖南、贵州、河北，这五省又集中了30%。四川为当代杨姓第一大省。全国形成了云贵川湘、豫冀鲁鄂两块杨姓聚集区。在人群中，分布在云贵、四川大部、重庆南部、湖南西部、广西北部，杨姓一般占当地人口的比例在4.5%以上，有的达13%，占了国土面积的13.6%，居住了大约23%的杨姓人口。在晋冀豫、京津、陕宁、甘肃大部、青海东部、新疆北端、内蒙古中部和东北部、黑吉西部、湖北大部、湖南中部和北部、安徽西北部、广西中部，杨姓占当地人口的比例在3%-4.5%，其覆盖面积占了国土面积的27.3%，居住了大约34%的杨姓人口。"
                ]
            }
        ]
    },
    "黄": {
        "url": "huang",
        "content": "黄姓主要源自：嬴姓。",
        "list": [
            {
                "title": "源自嬴姓，以国名为氏。有三种说法:",
                "content": [
                    "①远祖可追溯到帝舜时代的东夷部落首领伯益。伯益因治水有功，被帝舜赐姓嬴氏。其后裔中有黄氏者，约于商末周初在今河南潢川建立黄国。春秋时期，楚国称霸，只有黄国和随国敢于抗衡。公元前648年，黄国被楚国所灭。亡国后的黄国子孙，以国名为氏。",
                    "②远祖可追溯到五帝时代金天氏少昊。少昊金天氏后裔台骀，为水官之长，颛顼时受封于汾川。春秋时，台骀的后人曾建立沈、姒、蓐、黄诸国，后来都被晋国灭掉了。其中，黄国公族子孙以国为姓。",
                    "③远祖可追溯到远古掌火之官吴回（祝融）之子陆终。陆终后裔在周代时，被封于黄地，建立了黄国。黄国后来被楚国所灭，其后代子孙分散到了各地，他们以国名为氏，称黄姓。",
                    "2、源自官位，以官职称谓为氏。有两种说法："
                ]
            },
            {
                "title": "源自官位，以官职称谓为氏。有两种说法：",
                "content": [
                    "①出自远古伏羲下属之官黄龙师。黄龙师，亦称黄龙、黄师、黄中官、龙师等，是伏羲设置的官名，为中官。黄龙师之后裔子孙，有以先祖官称为姓氏者，称黄龙氏，后简称为单姓黄氏、龙氏等。",
                    "②出自远古黄帝下属之官黄云。黄云，是黄帝设置的官名，为中官。黄云之后裔子孙，有以先祖官称为姓氏者，称黄云氏，后简称为单姓黄氏、云氏等。"
                ]
            },
            {
                "title": "源于改姓而来:",
                "content": [
                    "①其他汉姓改为黄姓：上古时候，黄、王同音，故有的王姓改为黄姓；还有其他原因改姓黄的：如陆姓、巫姓、吴姓、金姓改黄姓等。",
                    "②回族改黄姓：今回族黄氏，是少数蒲氏回族人为避元末“反色目”诛杀之祸而改为黄氏的。",
                    "③满族改黄姓：满族吴扎拉氏，发源于宁古塔（今黑龙江宁安），人数很多，后分衍有四支汉姓，即黄氏、紫氏、红氏、白氏。"
                ]
            },
            {
                "title": "黄姓分布",
                "content": [
                    "宋朝时期，黄姓大约有120万人，约占全国人口的1.6%，排在第9位。黄姓第一大省是江西，约占全国黄姓总人口的27.5%。在全国的分布，主要集中于江西和福建，这两省黄姓大约占全国黄姓总人口的53.5%；其次分布于浙江、四川、广东、河南，这四省的黄姓又集中了24.5%。全国形成了以赣浙、闽粤、四川、河南为中心的四大块黄姓聚集地。",
                    "明朝时期，黄姓大约有220万人，约占全国人口的2.3%，排在第7位。江西仍为黄姓第一大省，约占全国黄姓总人口的23.8%。在全国的分布，主要集中于江西、福建两省，这两省黄姓大约占黄姓总人口的40%；其次分布于广东、广西、浙江，这三省的黄姓又集中了30%。宋、元、明600年间，全国人口纯增长率是20%，黄姓人口纯增长率高达83%，净增加了100万。黄姓人口分布主要向东南和南方地区迁移，全国重新形成了赣浙、闽粤桂两大块黄姓人口聚集地区。",
                    "当代，黄姓人口近2700万人，约占全国人口的2.2%，排在第7位。广东为黄姓人口第一大省，约占全国黄姓总人口的19.5%。在全国的分布，主要集中于广东、四川、湖南三省，大约占黄姓总人口的42%；其次分布于广西、江西、湖北、福建、江苏，这五省又集中了28%。全国形成了以长江为分水岭，以北少黄姓、以南多黄姓的分布局面。长江以南，尤以珠江三角洲为黄姓高聚集区。其次，四川东南部，湖南东部和江西南部形成两大块次高密度的黄姓区。在近600年期间，黄姓人口流动的程度和方向，与宋、元、明期间有很大的区别，由东南部向华中、华北有一定的回迁，向西和南部地区的回迁十分强劲，这已经大于由北向东南的迁移。当代黄姓人口分布频率，单位面积内密度最高的地区在广东东部、福建西部、广东中部、湖南东部、江西南部、四川东南，每平方公里的黄姓人口达到8.7人以上，占国土面积的5.7%，大约有567万人；在广西、广东、湖南南部、台湾、江西南部、福建南部、贵州东南、新疆喀什地区，黄姓占当地人口的比例一般在4.2%以上，在广西的桂林和钦州地区、广东的雷州半岛的比例高达8.4%以上，总覆盖面积占了国土面积的11.6%；四川、云南东部、贵州西北、湖南北部、湖北、江西北部、福建北部、浙江、江苏南部、安徽南部、陕甘宁大部，黄姓占当地人口的比例一般在1.4%-4.2%，总覆盖面积占了国土面积的22.6%；其他北方和西北广大地区，黄姓占当地人口的比例一般在1.4%以下，总覆盖面积占了国土面积的65.8%，其中比例不足0.5%的地区占国土面积的36%。"
                ]
            }
        ]
    },
    "高": {
        "url": "gao",
        "content": "高姓主要源自：姜姓。",
        "list": [
            {
                "title": "高姓起源始祖:",
                "content": [
                    "源于姜姓，出自西周时期的齐文公吕赤之子公子高。姜姓，原是炎帝的后裔，高氏则是炎帝的后裔，高氏的血缘初祖是炎帝，得姓始祖为高一。因炎帝神农氏生于姜水，以姜为姓。炎帝17世孙伯夷辅佐大禹治水有功，受封吕侯，子孙因此亦以吕为氏。吕侯伯夷第37代孙姜尚，即姜太公，又名吕尚、吕望，辅佐周文王、武王灭商立周，受封于齐国。齐国传至太公8世孙文公姜赤，文公次子受封于高邑，称公子高。依照周朝贵族礼仪，其孙傒取祖名为氏，为高傒。高傒在齐国为上卿时，迎立公子小白为君，就是齐桓公。高傒成为著名的渤海高氏的始祖。高傒7世孙高止在齐国遭到公孙灶、公孙趸排挤，出齐奔燕。高止9世孙高量为宋国司徒，高量10世孙高洪为东汉渤海郡守。高洪的一支后裔高隐、高瞻叔侄创立了渔阳高氏、辽东高氏，另一支后裔高悝创立了广陵高氏。渤海高氏的后人高伯祥又创立了京兆高氏。姜姓高氏族人大多尊奉高傒为得姓始祖，亦有尊奉高渠弥（姜渠弥）、高克为得姓始祖者。",
                    "源于姜姓，出自春秋时期齐惠公之子公子祁，属于以先祖名字为氏。以王父字为氏。齐惠公元是齐桓公小白与姬妾少卫姬所生的儿子，当了10年齐国国君。齐惠公的儿子叫公子祁，字子高，其后代也以高为姓，为山东高氏。源于鲜卑族：",
                    "北魏孝文拓拔·宏（元宏）于太和十七～二十年（熙元493～496年）大力实行政治改革，推行文化上汉化政策，在这个过程中，改北方胡人多音节复姓为汉字单姓，鲜卑族拓拔部寔娄氏部落改为高氏，后融合于汉族，是为河南高氏之一，江苏省徐州市丰县城西有单高楼村和双高楼村，猜测为鲜卑族楼氏一脉，并在单高楼村存有高氏祠堂。",
                    "在南北朝时期的东魏政权末期，鲜卑族人元景安因在邙山之役中力战有功，被东魏大丞相高欢赐爵西华县都乡男，在其子高洋于东魏孝静帝元善见武定八年（公元550年）废黜东魏孝静帝，建立北齐政权后，于同年即北齐文宣帝高洋天保元年（公元550年）赐他贵族姓氏为高氏。另外，鲜卑族人元文遥在北齐时期也先后得到国王高洋、高演的重用，因迎立国王高湛继位有功，北齐天统二年（公元566年）后主高纬下诏特赐他姓高。他们的后代就以高为姓氏，亦为河南高氏之一。",
                    "十六国时，后燕国王鲜卑族人慕容云改称为高阳氏后裔，遂改姓高，称高云，其后裔在这个历史背景下，多有改复姓慕容氏为单姓高氏者，后文化上汉化，是为河北高氏的主流。其后裔有改复姓为单姓，称高氏。南北朝时，先后有鲜卑族元氏和徐氏改姓为高氏。北齐文宣帝姓高名祥，当时有元景安、元文遥本鲜卑族，改汉字姓元，因有功于北齐，高洋赐他们“高”姓；又北齐时重臣高隆之，本姓徐，因其父与高欢交厚，遂改为高氏。当高氏建立北齐政权后，其姓氏就贵为北齐政权的国姓，于是北齐皇帝便赐他姓为高氏以示恩宠之举，徐子远从此改姓为高氏，其后代后来在今河南杞县一带发展起来，成为当地的望族，是为河南高氏之一。唐朝宦官高力士，是冯盎的曾孙，本姓冯，后被高延福收养，所以改高氏。以“高”字开头的两个字的复姓，后有改单姓“高”为氏。譬如：高车氏、高堂氏、高阳氏、高陵氏等。当高氏建立北齐政权后，高姓就贵为北齐的国姓，于是北齐皇帝便赐他姓为高姓以示恩宠之举。",
                    "源于满族，属于汉化改姓为氏。清朝光绪年间到民国初年，满族姓氏出现了大量改用汉姓的变化，有的以满姓字头音译为汉姓，高佳氏就改为高氏。（满族姓氏中的x佳氏原本都是汉族，汉族被虏为包衣或自愿为奴入旗后，被赐予满族姓氏，其形式就是在自己本来的姓氏后面添加一个佳字。）满族多啰氏，亦称刁落氏、啁噜噜氏，满语为Dolo Hala，汉义“内”，世居叶赫（今吉林梨树）、东海（今俄罗斯滨海地区），后多冠汉姓为高氏、赵氏等。",
                    "满族高佳氏，满语为Gaogiya Hala，祖先原为汉族，东汉末期被辽东鲜卑乌桓部虏携，融入鲜卑，后逐渐演化为辽东女真，世居盖州（今辽宁盖州）、辽阳（今辽宁辽阳）、吉林乌喇（今吉林永吉）等地。后有锡伯族引为姓氏者。清朝中叶以后多冠汉姓为高氏。满族高尔吉氏，亦称格尔齐氏，满语为Gerci Hala，世居尼马察（今黑龙江穆棱兴凯湖彼岸俄罗斯乌苏里斯克一带），后多冠汉姓为高氏。",
                    "满族萨克达氏，原为巴雅拉氏，后以地为氏，满语为Sakda Hala，汉义“悠久、苍老”，世居萨克达（今辽宁抚顺峡河流域）、宁古塔（今黑龙江宁安）、阿扈河（今黑龙江宁安南六十公里处）、叶赫（今吉林梨树）、赫图阿拉（今辽宁新宾永陵镇）、那木都鲁（今俄罗斯滨海地区）、德里倭赫（今辽宁抚顺东浑河畔）、黑龙江流域等地，清朝中叶以后多冠汉字姓为多为高氏、苍氏、仓氏、麻氏、骆氏、李氏、祖氏、海氏、萨氏、里氏、陈氏、罗氏、老氏、英氏、印氏、巴氏、色氏、臧氏、礼氏、佟氏、陀氏、翁氏等。",
                    "满族郭啰啰氏，亦称郭尔罗氏、郭络罗氏、郭博罗氏，满语为Gorolo Hala，以地为氏，世居讷殷（今吉林抚松松花江上游流域）、沾河（今吉林双阳河流域）、马察（今吉林浑江）等地。后有锡伯族引为姓氏者。清朝中叶以后多冠汉姓为高氏、郭氏、国氏等。",
                    "满族郭尔佳氏，亦称郭罗佳氏、固尔佳氏，满语为Gorgiya Hala，世居安巴德普特布占台（今辽宁铁岭三岔子南部）、长白山区、嫩河（今黑龙江讷河）等地。后有锡伯族引为姓氏者。清朝中叶以后多冠汉姓为高氏、郭氏、顾氏等。",
                    "源于羽真氏，出自汉、唐时期辽、朝鲜半岛高句骊国，属于以国名为氏。羽真氏族部落原为中国东北浑江流域的一个古老部族，是古燕国扶余氏族的一个分支，本姓扶余氏，西汉朝时属玄菟郡管辖。西汉元帝刘奭建昭二年（公元前37年），汉王朝积弱没落，其羽真氏族部落首领高朱蒙（高邹牟）乘机在纥升骨城（今辽宁桓仁）定都称王，建立了高句骊国，朱蒙自称是高阳氏之苗裔，所以改为单姓高氏。高氏一族在高句骊国的统治维持了六百多年的时间，这一历史时期，有汉史称其为“夫余族”。西汉平帝刘衎元始三年（高句丽瑠璃明王高类利二十三年，公元3年），高句丽瑠璃明王迁都城至国内城（今吉林集安）。西秦建弘八年（高句丽长寿王高巨链十四年，公元427年），高句丽长寿王又将都城迁至王险城（今朝鲜平壤）。由于高句骊的国王世为高氏，所以在古代辽东半岛、朝鲜半岛高句骊国存在期间，高氏家族一直有着较高的政治地位。北周时期，曾被封王为巨野县侯的大将军高琳，其祖先高句骊人，在其五世祖高宗时期归附北魏王朝，世代相传至今。高丽羽真氏，后有改高氏的。到了唐高宗李治总章元年（高句丽宝臧王高宝藏二十六年，公元668年），高句骊国被唐朝军大总管徐世勣（李勣）和安东都护薛仁贵联军所灭，唐军生擒高句丽王及其权相，屠数万，收户口六十九万户，之后唐王朝在王险城设立安东都护府。其后，有相当多的一部分高氏族人迁居中原内地，世代沿称高氏相传。",
                    "源于冒姓，出自唐朝中叶大时期宦官高力士（本名冯元一），属于冒姓为氏。由于高力士是个太监，无子嗣，因此曾收养了一大批巴结他的官宦贵族之子为养子，皆私赐其姓氏为高氏，世代相传。"
                ]
            },
            {
                "title": "源于官位",
                "content": [
                    "出自汉朝时期官吏高庙令，属于以官职称谓为氏。在高庙令的后裔子孙中，到三国时期天下大乱之际，有以先祖官职称谓为姓氏者，称高令氏，后省文简化为单姓高氏、庙氏，世代相传。",
                    "出自晋朝时期官吏高力督，属于以官职称谓为氏。在高力督的后裔子孙中，有以先祖官职称谓为姓氏者，称高力氏，后省文简化为单姓高氏、力氏、督氏，世代相传。",
                    "汉朝的匈奴句（音勾）王宜冠侯高不识后裔；金时女真人纥石烈氏、纳兰氏改高姓；清朝满洲八旗高佳氏、赫舍里氏、佟佳氏、郭洛罗氏等氏族很多命姓高。回族中则有西域穆斯林入关后改姓高，如元代学者西亚人高亨及子高克恭，其先世为西域回回，随蒙古征服者入关，落籍山西，以高为姓。这些外族与汉族长期混居，逐渐同化为北方的高姓。在南方，则有其他少数民族，如白族、哈尼族、京族、黎族、苗族、仡佬族、锡伯族、回 族、东乡族、裕固族、门巴族等少数民族中的高姓。这些民族的高姓，或是其先祖由汉文化汉化而来，或是按少数民族译音确定，或是接受官方赐姓而得。再有一种或因需依附大族权贵等政治原因而改。比如：魏时鲜卑族有楼氏改高氏，高丽羽真氏改高氏，南北朝鲜卑族元氏、徐氏改高氏等。北齐皇帝高洋，则给当时鲜卑族的元景安、元文遥等功臣，赐予了“高”姓。再就是“高”字开头的复姓如高车氏、高堂氏、高阳氏、高陵氏等，改为单姓“高”，则是历史使然。此外，还有民间过继外姓子女为嗣而改高的，也较普遍。"
                ]
            },
            {
                "title": "高姓分布",
                "content": [
                    "高姓人口单位面积内密度最高的地区在山东、河北、江苏、安徽、浙江北部、湖北东部、甘肃西部、东北三省、内蒙古东部，每平方公里的高姓人口达到2.7人以上，尤其在山东中部的地区高达6.4人。高姓分布密度表明：密度最高的（2.7万人以上/平方公里）地区占国土面积的18.1%，高姓人口大约641万；0.9-2.7万人/平方公里的地区占国土面积的42.2%，高姓人口大约719万；不足0.9万人/平方公里的地区占国土面积的39.7%，高姓人口大约92万。高姓分布很广，但不均衡。高姓在人群中分布频率表明：高姓在华北、东北、西北地区是比较常见的姓氏之一，一般占当地人口的比例达最高，在1.2%以上，尤其在甘肃河西走廊、山东中部、陕晋北部、黑龙江东北，在1.8%以上，有的达到3.6%以上，这部分高比例的地区的覆盖面积约占了中国总面积的29.2%；在四川、重庆东部巫山，奉节、湖北大部及利川、湖 南北部、江西、浙江、福 建、台湾、广东东部、青海东部、新疆西北，高姓频率在0.6%-1.2%，其覆盖面积约占了中国总面积的30.5%；其他广大地区，高姓频率不足0.6%，其覆盖面积约占了中国总面积的40.3%。"
                ]
            }
        ]
    },
    "马": {
        "url": "ma",
        "content": "马姓主要源自：嬴姓、他姓。",
        "list": [
            {
                "title": "马姓起源演变",
                "content": [
                    "1、出自嬴姓，出自帝颛顼裔孙伯益之后赵奢的封地马服，属于以居邑名为氏。",
                    "舜帝时候，伯益因帮禹治水有功，又为舜驯服鸟兽，被舜赐姓赢氏，赢姓出现，舜把自己的姚姓的女儿嫁给他。舜帝，姚姓，舜，以地取姓为姚，其后代即以姚为姓。马服本是战国时期赵国的一块土地，位于今天河北省邯郸市西北的紫山。战国时赵国大将赵奢于公元前270年率军在秦、赵阏与之战中大败秦军，赵惠文王因此把马服一地分封给赵奢，并赐其号为“马服君”，与廉颇、蔺相如职位相等。赵奢的子孙后代便以“马服”为姓，后又改为单姓“马”。此后，马家后代又在西汉武帝时期从马服迁到了当时的右扶风茂陵（今陕西兴平东北）定居下来，所以《姓谱》一书中记载说，“马”姓的发源地是扶风。后来，马服氏又省文简化为单姓，称马氏。该支马氏族人主要居住在赵国都城邯郸一带，后逐渐迁往各地，世代相传至今。",
                    "2、源于官位。",
                    "（1）出自西周时期官吏马质，属于以官职称谓为氏。马质，是西周时期设置的官位，专职掌管马匹的征收，并负责检验马匹的质量。在典籍《周礼·夏官·马质》中记载：“马质，掌质马，马量三物，一曰戎马，二曰田马，三曰驽马，皆有物贾。” 在马质的后裔子孙中，把祖官职称谓为姓氏者，称马质氏，后来简化为单姓马氏，世世代代相传至今，也是历史久远古老的姓氏之一。",
                    "（2）出自春秋时期楚国官吏巫马，属于以官职称谓为氏。巫马，是春秋时期楚国设置的一种官位，专门负责给马匹治病。古代，巫、医同义，因此称巫马。在典籍《周礼·地官·巫马》中记载：“巫马，掌养疾马而乗治之，相医而药攻马疾。”就相当于今天的兽医。在巫马的后裔子孙中，把先祖官职称谓拿来作为为姓氏者，称巫马氏，后省文简化为单姓马氏、巫氏，皆世代相传至今是非常古老的姓氏之一。",
                    "（3）出自春秋时期鲁国官吏廋人，属于以官职称谓为氏。廋人，全称位马廋人，是春秋时期由鲁国开始设置的一种官位，后齐国、晋国、燕国、秦国等大国中亦设有该官职，专职掌管饲养、训练马匹，并负责教导军士、官吏们如何骑驭马匹，后位各诸侯国中军队中普遍拥有的官称。在典籍《周礼·地官·廋人》中记载：“廋人，掌十二闲之政，敎以阜马。” 在马廋人的后裔子孙中，还有用先祖官职称谓来为姓氏者，称马氏是非常古老的姓氏之一。",
                    "（4）出自两周至秦、汉时期官吏，属于以官职称谓为氏。司马，传说是由远古五帝之一的少昊氏所设置的官称，商王朝时期的马正之官职，在西周时期发展改良为司马，全称为“夏官司马”，俗称“大司马”，为王朝重臣六卿之一，主管王朝对外的诸多军事事务。在典籍《周礼·夏官·大司马》中记载：“司马，谓总武事也。” 在司马的后裔子孙中，有以先祖官职称谓为姓氏者，称司马氏，后有省文简化为单姓马氏者，世代相传至今，是非常古老的姓氏之一。",
                    "3、源于改姓。",
                    "（1）出自汉朝大司徒马矢氏，属于复姓省文简化改姓为氏。汉朝有个大司徒叫马宫，他本为复姓马矢氏，后马宫以仕学名扬，遂省文去“马矢”中的“矢”而改单姓马氏，其后裔子孙世代相传至今。",
                    "（2）出自他姓改马姓。如汉代有汉戚人马宫，本姓马矢，至马宫以仕学显，改姓马。两晋之后大量司马氏改为单姓马姓。元末明初阿拉伯传教士哈木则巴巴从西亚来到东乡龙山（现甘肃省东乡县坪庄乡哈木则岭村）定居，并在周围传播伊斯兰教教义，在哈木则巴巴的影响下，龙家山周围先后有八坊（亦有人称为八姓或八村）的北方少数民族（其中有些村子人可能是藏族人）皈依伊斯兰教，这些少数民族人改信伊斯兰教后逐渐融入东乡族之中，其中的绝大部分人仍保留了原来的姓氏，但其中也有一部分人改姓，如其中的东乡县贾家村 贾姓少数民族人改信伊斯兰教后改掉了原来的姓氏而改姓马，时至今日，贾家村已无贾姓人而只有马姓人了。",
                    "（3）又据《姓氏考略》载，元代礼部尚书月乃和，因祖父曾任金代的马步指挥使，而改姓“马”，名祖常。回族中的“马”姓是“马”姓来源的重要方面。人常说： “十个回回九姓马，另外还有沙、喇、哈”。用这句俗语概括回族的姓，虽不十分准确，但大体符合事实。",
                    "4、源于少数民族。",
                    "（1）源于回族，属于文化上汉化改姓为姓，回族中马姓这么多，主要与阿拉伯、波斯人名的音译，特别是与伊斯兰教创始人穆罕默德的音译有关，因为马与穆谐音，所以明代许多著述中都将穆罕默德译作马哈麻。这种译法对清代及后代影响很大，如清代徐珂《西域水道记》、魏源《海国图志》等均将人名中的首音“穆”译为“马”。甚至有人称穆罕默德为“马圣人”。在这种情况的影响下，再加上“马”姓是皇帝赐姓，回族又不似汉族那么重视姓氏谱系，而是可以自由选姓使用，故很多回族人便选用了“马”姓，大大增加了“马”姓的人数。",
                    "（2）出自清代，满族人中的马佳氏，改姓为马。在中国东北聚集着许多满族马姓，努尔哈赤建立金国后，在八旗中就有许多满族马姓。满族的马姓跟地名有关，据说在西汉时期，在当今的吉林省境内，有一个夫国，这个国呢，他们也是以养名马出名，而且他们还把官叫马加、狗加、牛加，以六畜为官名，迁入这个地区的女真族，都以这个地名为姓了，所以它也算是同姓不同宗。",
                    "5、据《姓氏考略》记载，西域古有“马”姓，后西域有姓“马”者入内地，即以“马”为姓。"
                ]
            },
            {
                "title": "马姓分布",
                "content": [
                    "马姓人口为1198万人，占总人口1.06%，排名第17位。",
                    "从明朝至今600年中马姓人口由78万激增到近1250万，近16倍。明朝的平均人口接近9300万，当代的人口按12亿来计算，人口增长了13倍。马姓人口的增加速度高于全国人口的增加速度。马姓在全国的分布目前主要集中于河南（12.7%）、河北（11%）、山西（8.9%）、江苏（8.8%）四省，大约占全国马姓总人口的41.4%；其次分布于四川（6.8%）、安徽（5.9%）、辽宁（5.8%）、陕西（5.7%）、黑龙江（4.8%）、山东（4.8%），六省的马姓又集中了33.8%。河南为马姓第一大省，占河南省总人口的1.6%。黄河流域以及东北三省，约占国土面积的23.8%，马姓人口有749万，约占全国马姓人口的59.4%。黄河和长江之间的省份、宁夏大部、甘肃大部、青海东部、内蒙古西部、新疆乌鲁木齐地区是马姓人口较多的地区，约占国土面积的27.8%，马姓有414万，约占全国马姓人口的33%。其他地区是马姓分布较少的区域，约占国土面积的48.4%，马姓有97万，约占马姓总人口的7.7%。"
                ]
            }
        ]
    },
    "卢": {
        "url": "lu",
        "content": "卢姓主要源自：姜姓、姬姓。",
        "list": [
            {
                "title": "",
                "content": [
                    "1、源于姜姓，以邑名为氏。春秋时期齐国文公子名高，食采于卢邑（今山东长清县），其后人以卢为氏。",
                    "2、源于姬姓，以封邑名称为氏。东周时期，舅犯助晋文公姬重耳战胜楚国，因功封邑于昝邑（今河南唐河昝岗），舅犯之子贾季封邑于五鹿（今河南清丰），舅犯后人以卢为氏。",
                    "3、以国为氏。春秋时期，有庐子国（今安徽省合肥市），卢氏为庐子国戢黎之后。",
                    "4、以官职为氏：",
                    "①出自两周时期官吏若卢令丞，属于以官职称谓为氏（若卢令丞，为弓箭手统领，主弩射；后逐渐转为主管监狱的官吏，就是典狱官；秦汉时期隶属于少府管辖）。若卢令丞后裔子孙中，有以先祖官职称谓为姓氏者，称若卢氏，后简化为单姓卢氏者；",
                    "②出自汉朝时期官吏当卢令丞，属于以官职称谓为氏（当卢令丞，为专职掌管酿酒、煮酒的官吏，隶属于少府管辖）。当卢令丞的后裔子孙中，有以先祖官职称谓为姓氏者，称当卢氏，后简化为单姓卢氏者。",
                    "5、以兵器名为氏。欧冶子所锻越剑，名湛卢。",
                    "6、源于改姓而来：",
                    "①复姓改单姓卢氏。齐桓公后裔有以封地为卢蒲氏、葛卢氏，后改成单字的卢氏。北魏时期，复姓吐伏卢氏、伏卢氏、卢浦氏、莫芦氏改为汉字单姓卢氏。",
                    "②帝王赐姓为氏。隋炀帝杨广赐予河间人章仇太翼为单字卢氏；祖籍河北范阳(今河南光山)雷氏家族人氏，被北周皇帝宇文觉改为卢氏；祖籍三原(今陕西三原)闾氏族人闾云保，被唐高宗李治赐准改姓为卢氏。",
                    "③少数民族改姓卢姓。",
                    "源于鲜卑族，出自南北朝时期鲜卑拓拔部，属于汉化改姓为氏。鲜卑族有姓“莫芦”的，改为姓“芦”，后去掉草字头，归于卢姓。又有少数民族姓“吐伏卢”、“豆卢”或“奚什卢”的，也改为姓卢。",
                    "源于西南夷，出自明朝时期西南从族，属于汉化改姓为氏。中国西南地区少数民族中有一个从族，为古百越民族一支，在明朝时期有取汉姓为卢氏者。",
                    "源于赫哲族，属于汉化改姓为氏。居住于黑龙江流域的赫哲族卢如火氏，改汉姓为卢。",
                    "源于满族，属汉化改姓为氏。满族泰楚噜氏和喜瞻氏，在明清时期，有改为卢姓的。"
                ]
            },
            {
                "title": "得姓始祖",
                "content": [
                    "高傒（傒公）。傒公是吕尚十一世裔孙，任齐国正卿，因屡建丰功，受封于卢，其子孙遂以卢为姓。",
                    "齐桓公在登位(公元前685年)之初，为了表彰傒公在内政外交两方面对齐国做出的贡献，把卢邑（卢邑址在今山东省长清县偏西南）封给傒公，其子孙以邑为姓。傒公便成为卢姓的得姓始祖。"
                ]
            },
            {
                "title": "迁徙传播",
                "content": [
                    "卢姓主要发源于山东，后逐渐向西、向南播迁。",
                    "先秦时期，卢姓活动地区主要在山东、湖北、河北地区。秦汉时期，卢姓在北方地区繁衍。魏晋南北朝之际，卢姓开始大举南迁。唐末卢姓入闽，宋时入粤。元明清之际，卢姓遍及中国大部分地区。"
                ]
            },
            {
                "title": "卢姓分布",
                "content": [
                    "当代，卢姓人口约有650万，约占中国汉族人口0.47%，排在第四十二位。主要集中于广西、广东二省区，两省区约占总人口的35.6%；其次分布于河南、浙江、湖南、安徽、河北、甘肃，六省卢姓约占总人口29%。卢姓人口分布示意图表明：在桂粤海、贵湘大部、赣闽台南部、云南东部、浙江东部、甘肃中部、青海东部、内蒙古西部，卢姓在当地人口比例多为0.48%以上，上述地区居住了大约56%的卢姓人群；在北起青海湖以东、南到云南横断山脉以东的其他地区，卢姓在当地人口比例多为0.24%一0.56%之间，上述地区居住了大约40%的卢姓人群。中国大陆形成了以两广为中心向四周散发的卢姓聚集地区。"
                ]
            }
        ]
    },
    "韩": {
        "url": "han",
        "content": "韩姓主要源自：姬姓。",
        "list": [
            {
                "title": "1、源自姬姓",
                "content": [
                    "黄帝第二十九代韩侯：霜字辈。黄帝第四十三代韩献子厥：氏族典第十一卷。韩侯至平王时失国，其裔韩厥事晋复封韩原，凡二十四世，而灭于秦后有，韩氏、何氏、横氏、侠人、罂氏、言氏、贾氏、褐氏、李氏、吕氏、韩侯氏、无忌氏、公族氏、韩褐氏、韩藉氏、韩婴氏、韩信氏【见姓纂。】信都氏。韩厥氏之元系康，釆于赵，蔺为蔺氏，哀侯少子婼，采于平，为平氏、婼氏、张氏、灌氏；信之派又有，韩余氏。颍川成为韩姓的第一个郡望。"
                ]
            },
            {
                "title": "2、少数民族改姓而来",
                "content": [
                    "①鲜卑族改韩姓：北魏孝文帝从平城迁都洛阳，实行汉化改革，把鲜卑姓氏改为汉姓，其中的出大汗氏改为韩。",
                    "②满族改韩姓：满族哈勒塔喇氏，满语为Haltala Hala，世居吉林乌拉，后多冠汉姓为韩氏；翰颜氏，满语为Hanyan Hala，世居赫林台、嫩河等地，后多冠汉姓为韩氏；赫济哩氏，满语为Hegiri Hala，世居辉发，后多冠汉姓为韩氏。",
                    "③锡伯族改韩姓：锡伯族哈斯胡里氏，亦称哈斯呼哩氏、哈呼拉氏，世居伯都讷，清中叶后，改为汉姓韩氏；韩吉利氏，世居伯都讷，清中叶后多冠汉姓为韩氏；韩亚喇氏，世居伯都讷，后多冠汉姓为韩氏。",
                    "④朝鲜族改韩姓：满清建国后，世居义州（今朝鲜新义州）、开城府（今朝鲜开城）的朝鲜族人，皆冠汉姓为韩氏。",
                    "⑤鄂伦春族改韩姓：鄂伦春族卡格依尔氏，亦称卡日基尔氏，世居雅鲁河流域（今嫩江支流雅鲁河流域），后多冠汉姓为韩；哈尔卡拉氏，满语为Harkala Hala，世居雅鲁河（今嫩江支流雅鲁河流域），所冠汉字姓韩。"
                ]
            },
            {
                "title": "韩姓分布",
                "content": [
                    "宋朝时期，韩姓大约有64万人，约占中国总人口0.78%，排在第二十五位。韩姓第一大省是河南，约占韩姓总人口的25.6%。在中国的分布，主要集中于河南、河北、陕西，这三省韩姓大约占韩姓总人口的64%，其次分布于山东、江西、四川、安徽四省，又集中了24%的韩姓人口。形成了以豫冀鲁皖、陕川为中心的两大块韩姓聚集地。而湖南和两广地区是当时韩姓人口稀少的地区。",
                    "明朝时期，韩姓大约有62万人，约占中国总人口0.67%，排在第二十九位。山西和山东一跃并列为韩姓第一大省，约占韩姓总人口的31%。在中国的分布，主要集中于山西、山东、陕西、河北、甘肃、浙江，这六省约占韩姓总人口的70%，其次分布于江苏、广东两省，又集中了14%的韩姓人口。宋元明600年里，中国人口纯增长率是20%，韩姓人口增长比率为负值，人口在减少。韩姓是北方地区姓氏，面对战乱和屠杀，受到惨重的损失。期间人口主要向西北、东部和南方地区迁移。重新形成了晋冀鲁、陕甘、浙苏三大块韩姓人口聚集地区。",
                    "当代，韩姓人口近884万，为中国第二十六位大姓，大约占韩姓总人口的0.68%。河南为韩姓第一大省，约占韩姓总人口的14%。在中国的分布，在河南、山东、河北三省，大约占韩姓总人口的35.6%，其次分布江苏、辽宁、安徽、山西、黑龙江、陕西，这六省又集中了32%的韩姓人口。形成了以山东中部为中心，向东南、东北、西北以及东方辐射，长江以南的省份少韩姓的状况。从明朝以来的近600年间，韩姓人口流动由东南部向中原、华北有强劲的回迁，这已经大于由北向东南和南方的迁移。同时，黄河以北的韩姓人群出现向东北地区移民的倾向。韩姓在人群中分布以长江为界，分高频率北方区、低比率南方和西部区。在晋冀鲁豫、京津、内蒙古中部和东部、辽吉黑、陕宁北部、皖苏北部，韩姓占当地人口的比例一般在0.88%以上，有的达到1.6%以上，这部分覆盖面积大约占了总国土面积的27.8%，居住了大约66.5%的韩姓人群。在陕宁南部、甘宁大部、青海东部、新疆西北部、皖苏南部、上海、湖北、重庆、四川北部、浙赣北端、湘黔北部、海南，韩姓占当地人口的比例一般在0.44%-o.88%，其覆盖面积约占国土面积的21%，居住了大约20%的韩姓人群。"
                ]
            }
        ]
    },
    "田": {
        "url": "tian",
        "content": "田姓主要源自：姚姓、芈姓、姬姓。",
        "list": [
            {
                "title": "田姓起源一",
                "content": [
                    "源于官位，出自西周时期官吏田仆，属于以官职称谓为氏。田仆，是西周初期设置的官位，与田地农耕无关，而是专职负责管理君王所行之道路的官吏。周王朝，是在灭殷商王朝的基础上建立的奴隶制国家，而殷商是以土德立国，因此在周公以三年之久的时间镇压了纣王之子武庚的反叛以后，周王朝君王所行之路就不再同于士卿大夫和平民百姓所行之路了，而是专用木板铺设的道路，称“田路”，取五行之中的“木克土”之意，防止殷商旧族再造反。田仆，就是负责建造和管理田路的大夫，下属有上士十二人，史一人，丞相一人，徒若干，是很重要的官职，隶属于夏官府司管辖。在典籍《周礼·夏官》中记载：“田仆，掌驭田路。田路，木路也。田仆上士十有二人。”在田仆的后裔子孙中，有以先祖官职称谓为姓氏者，称田仆氏，后省文简化为单姓田氏，该支田氏古音读作chén(ㄔㄣˊ)，今读作tián(ㄊㄧㄢˊ)亦可，是古老的姓氏之一。"
                ]
            },
            {
                "title": "田姓起源二",
                "content": [
                    "源于官位，出自西周时期官吏田正，属于以官职称谓为氏。田正，亦称田畯、稷、田官，是西周初期由辅政召公所设置的官位，就是专职管理农耕田地的官吏，不涉及其它，相当于今天的农业部部长，主要负责管理井田之公亩部分，也就是王室所食之田。最高长官称田正，亦称稷，由王族贵胄担当，下属按九州各分派有田官，每一田官下还设有中士二人，史一人，丞一人，徒四人，统一隶属于天官府司管辖。天官府司，就是召公管辖的官衙。后世历朝历代所称的“社稷”，就是由此而来：社，宗庙也，稷，田正也，合称就是整个王朝、国家的象征。这在史籍《左传》中记载：“田畯，田大夫也。稷，田正也。稷为田官之长。”后来，在东周时期各诸侯大国亦仿设有类似的官职，但皆称为“大司田”。例如在典籍《管子·小匡篇》中就记载：“尽地之利，臣不如宁戚，请立为大司田。”",
                    "在田正、田畯、稷、田官、大司田等的后裔子孙中，有以先祖官职称谓为姓氏者，称田正氏、田畯氏、田稷氏、田官氏等等，后皆省文简化为单姓田氏，该支田氏古音读作chén(ㄔㄣˊ)，今读作tián(ㄊㄧㄢˊ)亦可，是非常古老的姓氏之一。"
                ]
            },
            {
                "title": "田姓起源三",
                "content": [
                    "源于姚姓与妫姓，舜帝有虞氏后裔，此为汉族田姓的大源流。",
                    "出自虞舜(姚重华)之后齐国官吏妫完（田完）后裔，属于以王侯身份为氏。",
                    "舜帝以姚为姓，其后子孙即以父姓为姓。据《通志·氏族略》记载，古帝虞舜之后妫满被周武王封于陈，传至公子完，避难逃到齐国，改姓田，其裔孙田和成为齐国国君，史称“田氏代齐”，齐被灭后，其后人以王族身份改“妫”姓为“王”姓，称为王氏。出于姚妫陈一支的为北海王、陈留王，乃舜裔齐田之后。《通志·氏族略》说，王姓“出于北海、陈留者，则曰舜之后也。其先，齐诸田为秦所灭，齐人号为王家，此妫姓之王也”。《通志·氏族略》言：“舜因姚地之生而姓姚，因妫水之居而姓妫。”史称姚、虞、陈、胡、田为“妫汭五姓”。“妫汭”，古水名，又作“沩汭”，舜帝本为姚姓，因居妫汭而得妫姓。舜帝的子孙有留在妫河边居住的，即以妫为姓。这支王姓的最早的来源是姚姓，部分姚姓族人经过多次的改姓：从姚姓改为妫氏，再改为陈氏，再改为田氏，部分田氏改回到最早的姚姓，部分没有改回，便继续为田氏，田氏有再次改姓的，改为王姓。齐王田建三子：升、桓、珍(一作轸)，升、桓改姓为王氏，其后代即舜帝姚姓后裔汉代王莽一族，此为 田姓、 王姓的一大源流。两汉之际的新朝皇帝王莽、以及魏晋隋唐时期的北海王氏、陈留王氏等等，都出自这支王姓中。王莽封姚姓同族田丰为代眭侯，后来丰之子田恢为避王莽之乱，过江徙居吴郡，又改为妫姓，其五代孙妫敷，又改回为姚氏。公元前368年，田和取代姜姓为齐国君主，史称“田氏代齐”，传八王，为秦所灭，其子孙废为庶民，其中一支自认为齐国王族，遂以王为姓。《姓氏考略》载：“北海、陈留之王，皆舜帝之后。其先，齐诸田为秦所灭，齐人号为王家，考为齐王田建之子田升、田桓改田姓为王姓。公元前404年，田和废齐自立国君，将姜姓齐国改为田姓齐国，后齐国被秦国所灭，国灭后齐国末帝齐王建居共(今河南辉县)，生有三子：田升、田桓、田珍(一作田轸)。”新朝(建兴帝)王莽、西汉皇太后王政君都出于此脉。《汉书·元后传》：“孝元皇后，王莽之姑也。莽自本曰：田和有齐国，三世称王。至王建为秦所灭，项羽封建孙安为济北王，齐谓之王家，以王为氏。”",
                    "齐国最后一名国王是齐王田建。他在亡国后被迁到共(今辉县古城)，田建之孙名田安，项羽反秦时被封为济北王，及项羽为刘邦所败，田安也失去了王位。但他的子孙为了纪念这一事情，从此便改姓王氏。",
                    "公元前404年，田和废齐自立国君，将姜姓齐国改为田姓齐国，后来齐国被秦国所灭，国灭后齐王建居共(今河南辉县)，生有三子:田升、田桓、田珍(一作田轸)。田升生田安，田安被西楚霸王项羽封为济北王，西楚灭亡后，田安失去王位。其子孙为纪念这一时辉煌，改姓王，是为春秋战国秦代时期的河南王氏。",
                    "出自舜帝姚姓名后裔春秋时期齐桓公封妫满之后妫完之封地，属于以封邑名称为氏。据史籍《史记·田完世家》及《新唐书·宰相世系表》、《古今姓氏书辨证》等资料记载，齐桓公封妫完于田地，其后子孙以地为氏，称田氏。帝舜当天子之前，帝尧把 两个女儿嫁给了他，让他们在妫汭河(今山西永济，源出历山，西流入黄河)边居住，他们的子孙有以居地河流名称为姓氏者，称妫姓。",
                    "田氏家族传至田完之第八世孙田和，出任齐国相国，他大权在握，在周安王姬骄十一年(齐康公十三年，田齐和子十三年，公元前391年)将腐朽没落的齐康公放逐到海边去捉螃蟹吃，田和自立为君，于是，姜姓齐国成了田氏齐国。这就是历史上著名的“田代姜齐”事件。"
                ]
            },
            {
                "title": "田姓起源四",
                "content": [
                    "源于地名，出自春秋时期鲁国之邑许田，属于以居邑名称为氏。许田，是春秋时期周王朝设置在鲁国境内的一个专门用地，是由周公旦所规定的用来进行祭祀、朝拜周王之时，各诸侯国君和百官们所住宿和举行重大典礼之地。“许”，赋也，愿也；“田”，祭祀之田、朝拜之田、典礼之田也。这在史籍《左传·隐公八年》中就有记载：“郑伯请释泰山之祀而祀，周公以泰山之祊易许田。许田，鲁国朝宿之邑。”在两周时期的各朝代，许田的地理位置各不相同，不是一个固定的地方，但总体在靠近泰山的今山东曲阜、泰安一带，历代皆有专门的官吏、仆役们进行日常管理和维护。“许田”之称一直沿用到两晋之际。",
                    "在许田之管理吏员、仆役中，有以其职责所在为姓氏者，称许田氏，其后裔子孙后引衍为单姓田氏、许氏等，该支田氏古音读作diàn(ㄉㄧㄢˋ)，今读作tián(ㄊㄧㄢˊ)亦可，是非常古老的姓氏之一，与妫陈之田无任何关联。"
                ]
            },
            {
                "title": "田姓起源五",
                "content": [
                    "源于地名，出自春秋时期虢国之邑桑田，属于以居邑名称为氏。桑田，是西周时期虢国之邑，因盛产桑蚕和丝纺织业发达而著称，位置在今河南省三门峡市陕县东北部地区，其地在史籍《左传·僖公二年》中有记载：“虢公败戎于桑田。桑田，虢地。”虢国是西周初期的重要诸侯封国。周武王灭商后，周文王的两个弟弟分别被其封为虢国国君，虢仲封东虢(今河南荥阳汜水镇)，虢叔封西虢(今陕西宝鸡)，两虢起着周王室东西两面屏障的作用。西周晚期宣王初年，西虢东迁，形成所谓南、北二虢。",
                    "虢国灭亡后，其地尽归强晋版图。原居于桑田之故民有以居邑名称为姓氏者，称桑田氏，后省文简化为单姓田氏、桑氏，该支田氏读音作tián(ㄊㄧㄢˊ)。"
                ]
            },
            {
                "title": "田姓起源六",
                "content": [
                    "源于芈姓，出自春秋时期楚国大夫田公它成，属于以先祖名字为氏。在典籍《荀子·非十二子》中杨倞注引《世本》记载：“楚平王孙有田公它成。”",
                    "田公它成，是楚平王熊弃疾(公元前528～前516年在位)的支庶孙，其后裔子孙以其先祖名字为姓氏，称田公氏，后省文简化为单姓田氏，该支田氏读音作tián(ㄊㄧㄢˊ)。"
                ]
            },
            {
                "title": "田姓起源七",
                "content": [
                    "源于地名，出自春秋时期鲁国之邑许田，属于以居邑名称为氏。许田，是春秋时期周王朝设置在鲁国境内的一个专门用地，是由周公旦所规定的用来进行祭祀、朝拜周王之时，各诸侯国君和百官们所住宿和举行重大典礼之地。“许”，赋也，愿也；“田”，祭祀之田、朝拜之田、典礼之田也。这在史籍《左传·隐公八年》中就有记载：“郑伯请释泰山之祀而祀，周公以泰山之祊易许田。许田，鲁国朝宿之邑。”在两周时期的各朝代，许田的地理位置各不相同，不是一个固定的地方，但总体在靠近泰山的今山东曲阜、泰安一带，历代皆有专门的官吏、仆役们进行日常管理和维护。“许田”之称一直沿用到两晋之际。",
                    "在晋都新田的住民中，有以居邑名称为姓氏者，称新田氏，后省文简化为单姓田氏，该支田氏读音作tián(ㄊㄧㄢˊ)，世代相传至今。"
                ]
            },
            {
                "title": "田姓起源八",
                "content": [
                    "源于姬姓。出自明朝初期大臣黄湜之后裔，属于避难改姓为氏。明朝初年，有一著名的辅佐明惠帝(明建文帝)朱允炆的大臣黄湜，因他提出了废削诸藩之权，引发了靖难之祸。黄湜，公元1350～1402年，字子澄，分宜大岗山澧源村人，是明朝初期著名政治家，提出“削藩”政策的主要人物之一。",
                    "黄湜被明成祖朱棣杀害后，他的儿子黄彦修为避祸改名换姓为田终，隐居在今湖北省咸宁一带，其后世子孙世代沿袭称田氏。该支田氏读音作tián(ㄊㄧㄢˊ)。"
                ]
            },
            {
                "title": "田姓起源九",
                "content": [
                    "一、源于匈奴族，出自汉朝时期并州匈奴，属于汉化改姓为氏。许多史书记载：“并州田氏源出匈奴。”其实，并州田氏原本还是汉族。所谓匈奴田氏，起源于秦国统一六国的历史过程。秦昭襄王赢则二十二年(公元前285年)，秦军大将蒙武率军攻打齐国，一举占领齐国九座城池。部分齐国田氏贵族纷纷北逃，与狄人汇合。从此在秦、汉史籍中皆称这一部分田氏族人为“狄人”，就是后来的匈奴民族中的田氏。",
                    "其实，该支田氏依然为妫姓田氏，并非为匈奴民族，正确读音仍作chén(ㄔㄣˊ)，今读作tián(ㄊㄧㄢˊ)亦可。",
                    "二、源于蒙古族，属于汉化改姓为氏。",
                    "蒙古族塔日阿沁氏，汉义就是“农夫”，因此冠汉姓为田氏，该支田氏读音作tián(ㄊㄧㄢˊ)。",
                    "三、源于满族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
                    "⑴.满族罕楚哈氏，源初金国时期女真金阿不哈氏族，满语为Hancuha Hala，世居绥分(今中俄交界绥分河上游地区)，后多冠汉姓为田氏。",
                    "⑵.满族田佳氏，满语为Tiangiya Hala，祖先原为汉族，东汉末期被辽东鲜卑乌桓部虏携，融入鲜卑，后逐渐演化为辽东女真，世居沈阳(今辽宁沈阳)，后多冠汉姓为田氏。",
                    "满族田氏读音皆作tián(ㄊㄧㄢˊ)。",
                    "四、源于白族，属于汉化改姓为氏。白族是一个历史悠久、文化发达的民族，白族先民很早就生息在洱海区域。从考古发掘的苍洱遗址、海门口遗址，都表明最晚在新石器时代洱海地区已经有居民生息繁衍。公元二世纪，汉武帝就在苍洱地区设置了郡县。公元八～十三世纪，苍洱地区先后出现了以彝、白先民为主体的奴隶政权南诏国和以白族段氏为主体的封建领主制政权大理国。白族90%以上的人从事农业生产，农业发展水平较高。白族人在历史上自称“白子”、“白伙”、“白尼”、“白王”、“白史”等，汉意即为白人。1956年，中央人民政府根据白族人民的意愿，正式定其民族名称为白族。",
                    "白族田氏，祖先原为汉族，原籍陕西，明朝时期随沐国公入驻贵州东南地区，在长期的军垦过程中融入白族，清朝时期世为贵州思南府、湖南凤凰五寨军民长官司土司，该支田氏读音作tián(ㄊㄧㄢˊ)。"
                ]
            },
            {
                "title": "田姓部分始祖",
                "content": [
                    "田汝源：字世本，行千十二宋景炎元年由明经贡举授上虞需学教谥遂卜居上虞永丰乡东朴五车堰南双石桥北卒葬五大夫里连洒北之凤凰山，配倪氏，子三长允隆，随父住上虞文允迪，七月十八日寅时寿，七十一葬宅巷口堑地，子五长日清，次日和，次日升，次日明，次日兴。是为浙江上虞永丰乡"
                ]
            },
            {
                "title": "田氏始祖",
                "content": [
                    "田养纯：寿字辈(包括寿字)为上十四世，山字辈(包括山字)为下传十二世。后世者应一律以十二辈字顺序严推，不得擅改(乳名不在其限)各代应将辈字放在中间，十二字间先后顺序，如后有慎重追远者，再以要下延。山西八甲口田氏始祖。",
                    "田旺广：字仁可，公自吴迁湘第二下都即今一坊，卓然自立而才足干理垂裕昆，元仁宗皇庆元年壬子生，明洪武己巳没，葬今二都龙兴寺后中嘴辰山戌向。元配：陈氏，生没失考，葬今一都地名新研铺落田。生子一：田经。湖南田氏始祖。",
                    "田延昌：原籍陕西蓝田滥泥村，大宋咸淳间进士，任浙江省绍兴府余姚知县，流寓于籍。解组后居余姚老鸦田，生万全、万亩。万全生三辅。三辅生五子曰：德明、德兴、德璋、德瑛、德寅。元至正年间，余姚文举田德明、武举田德兴，其贤能武功为国所用，授之以职，领旨赴任。五公遂齐迁湖广麻阳县，从此扎根麻阳，繁衍生息。明公下业官村，兴公居漫水村，璋公裔于长潭，瑛公下业五寨司郎溪，寅公裔居贵州玉屏县。至明初五公分房，为麻邑田氏第一次迁徙，奠定了以麻阳为中心向四周迁徙分布的格局，形成多个以田氏为主的聚居村落。至明朝中期，麻邑田氏大抵已遍布湖南麻阳、凤凰、芷江，贵州铜仁、镇远、玉屏，四川秀山等地。清代初年，由于四川人口锐减，于是湖广之民大批迁往川渝腹地，其中也有不少麻邑田氏族人，史称“湖广填四川”。今重庆合川、江北、万州、黔江，四川武胜、达州、遂宁、内江等地皆有麻邑入川之族分布。除入川之外，清初亦有迁湖北、广西、云南之宗族，足迹遍布神州。",
                    "田袁：清光绪癸卯甲辰间余在项城袁公幕府今都统田山，中将任都练公所教练处总辨为修相见礼之始中将虎，而蚪顾昐英伟余洒然异之民国以后余任机要局局长，中将任允州镇守使每人都必班荆道故欢若平生时项城将任为河南督军议定未果民国四年内调陆军部，次长退食余輙与余小饮旗亭指书军如书沙聚米，洪之役中将直言无隐余君遂成患难之交居当谓，天挺英奇必磅礴积而出之君家世必有过人者岁，夏日余避暑于张家口荷中将适馆出临检田氏雨世清芬录见未敬授而读之乃知君雨世重若孝行，有非人情所能堪而节母茹荣含辛益彰懿宜其篱生，英为国干城古云为善之报不于其身必于其子孙，吾于田氏见之矣嗟乎国之昌也积德累行必世而后仁，家之兴衡困虑心历久而后显祖宗经当造如此其，难而子若孙双其余荫或乃猖狂态肆堕其家声九京有，灵能无隐痛余之所以重田君者在其治事精勤而又深，自歙抑不莫利不鹜声华国署无捋蒲之声宝僚有文，字之乐余旅食数日见君日必球一小时开步一小时，余则山立整襟习右军书数小时虽祭征之雅歌投壶，陶醒公之连习勤何以加兹然则节母为不朽矣敬书，数语戏诸卷专。是为河北临榆田氏始祖。                    "
                ]
            },
            {
                "title": "田氏分布",
                "content": [
                    "田姓占当地人口的比例一般在0.51%以上，中心地区这一比例可达1.6%以上，这部分覆盖面积约占了总国土面积的40.5%，居住了大约71%的田姓人群。在四川大部、云南中部、湖南东部、广西中部、江西西部、福建南端、湖北东部、皖苏中部、山东东端、河南东南角、辽宁东部、黑吉西端、内蒙古东北部、甘肃西南、青海东部，田姓占当地人口的比例在0.34%—0.51%之间，上述覆盖面积约占了总国土面积的22.1%，居住了大约17.3%的田姓人群。",
                    "当代田姓的人口已近520万，为全国第三十六位姓氏，大约占全国人口的0.41%。从明朝至今600年中田姓人口由32万增到520万，增长了16倍多，田姓人口的增长速度高于全国人口的增长速度。自宋朝至今1000年中田姓人口的增长率是呈∨形的态势。在全国的分布目前主要集中于河北、河南、山东、贵州四省，大约占田姓总人口35%，其次分布于四川、湖南、陕西、山西、湖北，这五省又集中了29%的田姓人口。河北为当代田姓第一大省，居住了田姓总人口的11%。全国形成了以河北、贵州为中心的中原冀豫鲁、川黔湘两个田姓高聚集区域。在600年期间，田姓人口流动的程度和方向与宋元明期间有很大的区别，由东南部向华中、华北、西部回迁的流动十分强劲，大于由北向南的迁移。"
                ]
            }
        ]
    },
    "董": {
        "url": "dong",
        "content": "董姓主要源自：董姓、姬姓、己姓。",
        "list": [
            {
                "title": "董姓起源一",
                "content": [
                    "源于董姓，出自帝舜赐予颛顼后裔飂之子的姓氏，属于帝王赐姓为氏。相传，颛顼的己姓后裔中有个人叫飂叔安，史书上亦称廖叔安。飂叔安有个儿子叫董父，他对龙(马)的习性很有研究，于是舜帝就任命董父为豢龙氏，让他专门养龙。在董父的精心驯养下，许多龙学会了表演各种舞蹈，帝舜很是喜欢，就封董父为鬷川侯(今山东定陶)，还赐他以董为姓氏，他的后代就是董氏，世代相传至今，是非常古老的姓氏之一，史称董氏正宗。",
                    "董氏族人大多尊奉董父为得姓始祖。"
                ]
            },
            {
                "title": "董姓起源二",
                "content": [
                    "源于姬姓，出自春秋时期周朝大夫辛有的儿子，属于以官职称谓为氏。春秋时期，周王朝有个大夫叫辛有，辛有的两个儿子都在晋国任太史，负责董督(考察并收藏之意)晋国的典籍史册，以官名称为董督。在史籍《左传·昭公十五年》中记载：“辛有，周人也。其二子适晋为大史，籍黡与之共董督晋典，因为董氏。”",
                    "这两个董督的后代世袭晋国史官，一直担当晋国的太史令，其后裔子孙遂以先祖的官称为姓氏，称董氏，世代相传至今。其中一个叫董狐的，时为晋侯史官，其后代则世代为侯氏。"
                ]
            },
            {
                "title": "董姓起源三",
                "content": [
                    "源于己姓，出自颛顼帝之孙子吴回的后裔，属于以居邑名称为氏。据史籍《元和姓纂》记载，传说重黎是一位氏族首领以谆耀敦大，光明四海。颛顼任命其为火正，专门管理火。颛顼逝世后，其侄子高辛(玄嚣的孙子)继位，即帝喾(帝俊)，帝喾任命重黎为“祝融”之官称。后来共工氏作乱，帝喾派遣重黎前去镇压，重黎多次镇压而不成功，帝喾大怒，将重黎召回论罪处斩，然后以重黎的弟弟吴回接替重黎的官位，继续为祝融之官。",
                    "吴回有个儿子名终，因为封在陆乡(今山东平原)，所以叫陆终。陆终有个儿子叫参胡，因住董地(今山东濮城)，其后裔子孙就以居邑名称为姓氏，称董氏，世代相传至今。"
                ]
            },
            {
                "title": "董姓起源四",
                "content": [
                    "源于地名，出自汉朝时期董泽，属于以居邑名称为氏。董泽，是古代的一个大湖泊的名称。在史籍《后汉书·郡国志》中记载：“文喜邑有董池陂，古董泽。”古籍中所指的“文喜邑”，就是汉朝时期的“河东闻喜”，即今山西省运城地区，是“千古山西二雄”之一关羽的家乡，其时有一巨大的湿地地貌，因水中盛产“董蕖”因而称“董泽”。“董蕖”，就是古人对莲藕的一种称谓，在今天山西、陕西地区，菜市场上仍有称莲藕为“董菜”者。传说，董泽曾“浩淼数百里”，后被人类破坏，逐渐成为盐湖，最后干涸，消失得无影无踪，今只留得一个“运城市盐湖区”的行政名称。",
                    "在董泽周围生活的住民，很早就有以其居住地名为姓氏者，称董氏，世代相传至今。"
                ]
            },
            {
                "title": "董姓起源五",
                "content": [
                    "源于蒙古族，出自汉朝时期南匈奴族屠各部奥矣·毛都氏部落，属于文化上汉化改汉字姓为氏。蒙古族呼勒都古德氏，源出汉朝时期南匈奴屠各部奥矣·毛都氏部落，其实是古肃慎民族的一个分支，在东汉时期曾一度改汉姓为胡氏。至魏、晋、南北朝时期，奥矣·毛都氏部落的一个分支，逐渐北迁居于大青山一带原始林区(今蒙古肯特山区)，因此被称为“林中之民”，辽国的契丹族人和后来西夏国的党项族人则称其为“蒂奇斯族”，金国时期的女真族人称其为“呼勒都古德”。与古突厥语“奥矣·毛都”的意思一样，古女真语“呼勒都古德”也是“林木、林中人、森林猎人”之义，后因以为部落名称和姓氏。在成吉思汗统一蒙古高原的历史过程中，奥矣·毛都氏部落以及呼勒都古德氏部落皆成为蒙古兀良哈部落下属诸部，逐渐成为蒙古族。",
                    "明朝初期，蒙古族呼勒都古德氏即有取汉姓为董氏、胡氏者，至清朝中叶以后，大多数族人冠汉姓为董氏，少部分人称胡氏，世代相传至今。",
                    "加入董姓",
                    "群体中的北方外族、西南、南方和主要出现的事件有：西汉初期的匈奴族、三国时吴国的山越族、晋朝时的氐族、南北朝北魏时的羌族、唐朝吐蕃人的董部落、五代后梁时羌人、宋朝时的高句丽人等均有董姓人融入汉人之中，清朝时满洲八旗姓董鄂氏、栋鄂氏、佟佳氏、珠赫勒氏等全体族人的改汉字姓董。致使北方地区多董姓，这些少数民族与汉人长期混居，逐步文化上同化而成为当地的董姓汉族。自汉至唐，云贵地区的董姓已成为大姓，云贵地区的土著董姓后来逐渐同化为西南地区的汉族。"
                ]
            },
            {
                "title": "董姓起源六",
                "content": [
                    "源于满族，属于汉化改姓氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
                    "⑴.满族董鄂氏，亦称栋鄂氏，满语为Donggo Hala，世居董鄂(今辽宁桓仁、宽甸一带)，是满族著姓之一，清朝中叶以后多冠汉姓为董氏、栋氏等。",
                    "⑵.满族栋佳氏，亦称董家氏、董佳氏，满语为Donggiya Hala，祖先原为汉族，东汉末期被辽东鲜卑乌桓部虏携，融入鲜卑民族，后逐渐演化为辽东女真，世居董佳城(今辽宁新宾)、嘉木湖(今辽宁新宾)、嘉哈(今辽宁新宾夹河村)、哈达(今辽宁西丰小清河流域)等地，清朝中叶以后多冠汉姓为董氏、邓氏、陈氏等。",
                    "⑶.满族珠格氏，源出金国时期女真术虎部，以部为氏，满语为Juge Hala，世居乌喇(今吉林永吉)、宁古塔(今黑龙江宁安)、萨哈尔察(今黑龙江北岸俄罗斯境内布列亚河流域)等地，是满族最古老的姓氏之一，清朝中叶以后多冠汉姓为董氏。",
                    "⑷.满族珠赫哷氏，源出金国时期女真术虎部，满语为Juhere Hala，汉义“冰冻”，世居乌喇(今吉林永吉)，清朝中叶以后多冠汉姓为董氏、术氏等。",
                    "⑸.满族朱胡氏，源出元朝时期女真海通猛安朱胡氏族，满语为Juhu Hala，在明朝时期的汉姓即为董氏。",
                    "董氏的另一支是在周朝时出现的，据西汉史游《急就篇》及宋人邓名世《古今姓氏书辩证》记载，春秋时，周大夫辛有的两个儿子到晋国，与籍氏一起主管晋之典籍，因其职责是“董督晋史”，所以也称为董氏。这一时期晋国的都城在绛（今山西翼城东南），公元前585年，晋景公以新田“土厚水深，居之不疾，有汾、浍以流其恶，且民从教，十世之利”，将晋国都城自今翼城县境迁至新田（今侯马市区）故此支董氏出自今山西侯马。",
                    "辛有的后裔，世袭晋国太史之职，至春秋时，有史官董狐，他不畏权贵，秉笔直书，被誉为“良史”。董狐的裔孙董翳，秦末被项羽封为翟王，都高奴（在今陕西延安延河东岸），子孙遂居陇西（郡治在今甘肃临洮）。西汉时的董仲舒为广川（今河北枣强东）人，其曾孙自广川徙陇西，裔孙徙河东（郡治在今山西夏县西北）。此外，董姓在汉代还分布于今山东定陶、高青，广东广州，四川资阳、德阳，贵州黄平，浙江余姚，湖北襄阳、枝江，福建福州，河南禹州、伊川、南阳、开封、福县、信阳、灵宝等地。至隋唐时期，除上述地区外，今安徽、湖南、江苏、江西等省的一些地方，也都有董姓的居住地。",
                    "唐代的《元和姓纂》记载董氏有四个郡望：即陇西、弘农（今陕西华阴）、河东、范阳（今河北涿州）。此外还有济阴（今山东曹县）。唐末，固始（今属河南）的董氏有随王潮、王审知入闽者。明代以前，董氏已遍布江南各省。从清康熙年间开始，董氏有族人陆续移居台湾，此后有的又徙居南洋群岛及欧美一些国家和地区。"
                ]
            },
            {
                "title": "董姓分布",
                "content": [
                    "董氏是一个典型多民族、多源流的姓氏群体，在当今姓氏排行榜上名列第二十九位，属于超级大姓系列，人口约七百二十六万一千余，占全国人口总数的0.45%左右。",
                    "董氏主源出自高阳氏颛顼帝之后裔。据史料所载，董氏的发源地在山东定陶北部、山西运城、山东平原县三个地方。",
                    "今日董氏以河北、山东、山西、云南、辽宁、浙江等省最为集中，冀、豫、晋这三省就占董氏总人口的31%，滇、鲁、辽、浙、川、鄂这六省又占38%，而冀州地区居住了董氏总人口的10%，为董氏第一大省。"
                ]
            }
        ]
    },
    "许": {
        "url": "xu",
        "content": "许姓主要源自：姬姓、姜姓。",
        "list": [{
            "title": "",
            "content": [
                "出自姬姓，为颛顼后裔吴回生陆终，陆终生子六人：长子曰樊，樊为已姓，封于昆吾，即古帝丘颛顼之虚，为昆吾氏，尧舜时期昆吾氏首领许由为当世大贤，死后葬于箕山，后人多以许由为许氏始祖。夏之昆吾为商汤所伐灭，后人迁徙至河南许昌。",
                "出自姜姓，以国为氏，是炎帝神农氏的后裔。许氏与齐氏同祖，为上古四岳伯夷之后。“四岳”（尧舜时四方部落首领）是由姜姓发展出来的四支胞族，他们和姬姓部落结成联盟，跟“子姓”商族平行发展。以姬姓和姜姓部落为主的盟军打败了商纣王，建立了姬姓国-- 西周。周成王时，大规模地分封诸侯，其中商的旧地也分封了一些姬姓诸侯国和姜姓诸侯国，许国正是被周分封的姜姓诸侯国之一，其始祖为文叔，也称为许文叔。春秋时，许国成为楚国的附庸，战国初期被楚所灭。许国亡国后，子孙以国为氏，称许氏，史称许姓正宗。",
                "源于姬姓，出自春秋时期卫文公之子姬其许，属于以先祖名字为氏。春秋时期。卫国君主文公姬毁生有公子姬其浒，亦作姬其许，后出任卫国大司徒，主管征发徒役，兼管田地耕作与其他劳役。姬其浒辅佐父亲卫文公实施减赋税、少刑法，与民共苦的政策，使卫国经济逐渐繁荣起来，并迅速强大。姬其浒的哥哥就是著名的卫成公姬郑，曾被大夫元咺一度废黜，后在春秋霸主晋文公姬重耳的帮助下恢复君位。卫国大司徒姬其浒留给后世最称道的，就是从他开始有了“司徒”这一复姓。在姬其浒的后裔子孙中，有以先祖名字为姓氏者，春秋战国时期，“浒”与“许”二字通假，故而亦称许氏，但读音作hǔ（ㄏㄨˇ）；而更多的姬其浒后裔则以其官职称谓为姓氏，称司徒氏。",
                "传说尧帝时许由的后代也称许氏。",
                "也说，许由（或繇）就是许国诸侯的祖先。同为一支。"
            ]
        },{
            "title": "许姓分布",
            "content": [
                "许氏的发源地在今河南省许昌东。春秋战国时期，许国为郑、楚等国所逼，曾多次在今河南及安徽部一带迁都。许国被楚灭后，除部分迁居今湖北荆山及湖南芷江等地外，多数许姓就地繁衍或北上迁徙。许姓北上最初迁徙之地是冀州高阳（今河北高阳），后有许氏复迁回河南宝丰等地。秦汉之际许姓已遍布今河南、河北两省的大部分地区。此后，北方许姓主要分布于今河南、河北、安徽、陕西、山西等广大地区。许姓南迁始于魏晋南北朝之时。唐初，陈政、陈元光父子奉命入闽，有河南许姓将佐随同前往，在福建安家落户。唐僖宗时，侍御史许爱镇守漳州招安，后入晋江石龟。唐代以后，许姓已大举南迁繁衍于今江苏、浙江、湖北、福建、广东等省地。宋末元初，许氏有一支徙居广东。明代，福建人许冲怀、许申移居台湾，此后许氏又多次向台湾迁徙，进而又有移居海外者。迁至湖南、广东、广西、福建的许氏，有的融入侗、壮、苗、布依、土家等少数民族。"
            ]
        }]
    },
    "孟": {
        "url": "meng",
        "content": "孟姓主要源自：子姓、姬姓。",
        "list": [{
            "title": "孟姓起源一",
            "content": [
                "源于子姓，出自商王朝时期齿序排列，属于以先祖名字为氏。上古时期，人们对子女后代的尊卑排位很早即有了特定的嫡、庶观念。从在安阳殷墟出土的商时期甲骨文字中，已经有了“子孟次别于子之伯”的记载(该甲骨片现被收藏在日本东京国立博物馆，编号KCN-2704-141-03)，说明其时对嫡、庶的分别已经十分明显。按商礼：伯，指嫡支长子，即正妻所生之第一子；孟，指庶支长子，指庶妻或妾妃所生之第一子。在典籍《礼·纬》中明确记载：“嫡长曰伯，庶长曰孟。”因此，“孟”，在很古早就已经作为子女嫡庶齿序的排列称谓，显然是孩子名字称呼的主要形式。中国古代奴隶制社会中、晚期的代表阶段殷商至两周时期，已经明确没有了禅让模式，君主之位的传承方式已经固定化为“嫡承庶辅”，“孟”也就成为了程式化的“次之第一”称谓的代表。因此，当继承人已经成年(虚岁十八岁)时，称作“天子之年”，说明具备了继承君位的能力，但父君健在，其只能等待，即谓“孟位以待”。这在典籍《书传》中也有明确解释：“天子之子，年十八，称孟侯。”另外，在古代，女子之兄亦称为“孟”，常有长孟、次孟……，指的就是类如大舅子、二舅子之类的称谓，是母系氏族社会的典型遗痕。在中国历史进入到封建社会之后，这种嫡庶称谓不但没有休止，而且愈演愈烈，因为它完全符合封建社会制度的人文理念，以至于直到今天，这种影响仍然深邃地固化在中国亿万民众之中，且不容忽视。",
                "庶支长子之孟、嫡传继位之孟、女兄称谓之孟……等等，早就在中华人文历史上成为姓氏之始，孟氏一族远早于姬姓孟氏之源，其来源繁复深远，绝无一论。"
            ]
        },{
            "title": "孟姓起源二",
            "content": [
                "源于姬姓，出自春秋时期的卫国第二十八代君王之子絷，属于以先祖名字为氏。春秋时期，周朝分封的同姓诸侯国卫国，其开国之君为周武王弟卫康叔，都城在今河南境内。卫国传至第二十八代君王之子絷，字公孟，因病不得继位，让位给其叔。",
                "到了公子絷的孙子姬驱，便以祖父之字为姓氏，称公孟氏，后有省文简化为单姓孟氏者，是为河南孟氏。"
            ]
        },{
            "title": "孟姓起源三",
            "content": [
                "源于姬姓，出自春秋时期的鲁国公族庆父的儿子公孙敖。属于以先祖名字为氏。据史书记载，黄帝姓公孙，是少典氏部落首领的儿子。他生于寿丘(今山东曲阜)，长于姬水，故又姓姬；后居轩辕之丘，因此号轩辕氏；再迁有熊(今河南新郑)，也称有熊氏。",
                "庆父共仲虽为孟氏之始祖，但因其三年连弑二君，罪使国内大乱，人不敢敬，而孟子系庆父后裔，且才高德重，故孟氏族人尊奉孟轲为得姓始祖。"
            ]
        },{
            "title": "孟姓起源四",
            "content": [
                "源于蒙古族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·蒙古八旗姓》记载：",
                "⑴.蒙古族墨尔奇特氏，亦称蒙格惕氏、穆奇德氏，源出元朝时期蒙古七十二姓灭里吉歹部，后为巴尔虎蒙古姓氏，世居扎鲁特(今内蒙古扎鲁特旗)。后有满族引为姓氏者，满语为Morcit Hala。清朝中叶以后多冠汉姓为孟氏、穆氏、秦氏等。",
                "⑵.蒙古族墨尔济吉特氏，亦称莫勒图特氏，居克什克腾(今内蒙古克什克腾旗)。后有满族引为姓氏者，满语为Morjigite Hala。清朝中叶以后多冠汉姓为孟氏。",
                "⑶.蒙古族岳罗沁氏，亦称亦赫君氏，世居克什克腾(今内蒙古克什克腾旗)。后有满族引为姓氏者，满语为Yolocin Hala。清朝中叶以后多冠汉姓为孟氏。",
                "⑷.蒙古族亦赫君氏，清朝中叶以后多冠汉姓为孟氏。"
            ]
        },{
            "title": "孟姓起源五",
            "content": [
                "源于满族，其属于汉化改姓为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
                "⑴.满族穆颜氏，亦称穆延氏，源出辽国时期五国部之一的抹拈部(抹捻氏)，以部为姓，满语为Muyan Hala，世居浑春(今黑龙江黑河以北俄罗斯境内)，是满族最古老的姓氏之一。清朝中叶以后，多冠汉姓为孟氏、秦氏、穆氏等。",
                "⑵.满族蒙果资氏，满语为Menggosi Hala，世居绥分(今黑龙江绥分河上游地区)，后多冠汉姓为孟氏。",
                "⑶.满族蒙古尔济氏，满语为Menggurgi Hala，世居叶赫(今吉林梨树)、科尔沁(今内蒙古通辽、吉林西部一带)。后有蒙古族引为姓氏者。清朝中叶以后，多冠汉姓为孟氏、蒙氏等。",
                "⑷.满族孟克伊哷氏，满语为Mengkyire Hala，世居蜚优城(今吉林珲春三家子乡高丽城村)，清朝中叶以后，多冠汉姓为孟氏等。",
                "⑸.满族墨克勒氏，满语为Mokele Hala，世居叶赫(今吉林梨树)。清朝中叶以后，多冠汉姓为孟氏。",
                "⑹.满族墨勒哲哷氏，亦称莫尔哲勒氏，满语为Moljere Hala，汉义“用刀复仇”，世居巴林(今黑龙江伯力、俄罗斯哈布罗夫斯克)、白石(今黑龙江牡丹江镜泊湖)、阿穆达(今黑龙江哈尔滨山彦倭和)、松花江、黑龙江等地。后有达斡尔族引为姓氏者。清朝中叶以后，多冠汉姓为孟氏、曹氏、莫氏等。"
            ]
        },{
            "title": "孟姓起源六",
            "content": [
                "源于鄂伦春族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
                "⑴.鄂伦春族玛拉库尔氏，亦称莫拉呼尔氏，玛哈依尔氏，世居精奇里江(今俄罗斯境内结雅河流域)。后有满族引为姓氏者，满语为Malakur Hala，汉义“分支”。清朝中叶以后多冠汉姓为孟氏。",
                "⑵.鄂伦春族玛拉依尔氏，世居精奇里江(今俄罗斯境内结雅河流域)。后有满族引为姓氏者，满语为Malalr Hala。清朝中叶以后多冠汉姓为孟氏。"
            ]
        },{
            "title": "孟姓起源七",
            "content": [
                "源于达斡尔族，属于汉化改姓为氏。据史籍《黑龙江志稿》记载：",
                "达斡尔族莫尔登氏，亦称孟尔丁氏、孟尔的音氏、墨尔丹氏、莫塔哈利氏，满语为Mordin Hala，世居黑龙江布特哈地方(今黑龙江讷河)。后有满族引为姓氏者，满语为Malalr Hala。清朝中叶以后多冠汉姓为孟氏、莫氏、苍氏等。"
            ]
        },{
            "title": "孟姓起源八",
            "content": [
                "源于其他少数民族，属于汉化改姓为氏。",
                "今土家族、布依族等少数民族中，均有孟氏族人分布，其来源大多是在唐、宋、元、明、清时期中央政府推行的羁糜政策及改土归流运动中，流改为汉姓孟氏，世代相传至今。"
            ]
        },{
            "title": "孟姓分布",
            "content": [
                "当代孟姓的人口已达330多万，列在全国第七十三位，大约占全国人口的0.27%。宋朝至今1000年中孟姓人口的增长率是呈V形的态势。在全国的分布如今主要集中于山东、河南、河北，这三省的孟姓大约占孟姓总人口的46%。其次分布于安徽、江苏、辽宁、山西、黑龙江，江苏、辽宁、山西、黑龙江这四省又集中了28%的孟姓人口。山东为孟姓第一大省，约占孟姓总人口的21%。全国形成以鲁豫冀、东北为中心的两大块孟姓聚集区。自明朝至今600年期间，孟姓人口流动的程度和方向主要由东南部向中原、华北回迁，尤其突出向东北的迁移。孟姓在人群中分布频率示意图表明：在鲁冀京津、黑吉辽大部、内蒙古中部和东部、豫皖苏北部、山西东北部，孟姓占当地人口的比例一般在0.48%以上，中心地区达到1%以上，以上覆盖面积约占了总国土面积的18.4%，居住了大约54%的孟姓人群。在豫晋大部、皖苏中部、皖东北、湖北北部、陕宁、甘肃大部、新疆西北、内蒙古中西部、辽宁东段、吉林东部、黑龙江东南，孟姓占当地人口的比例一般在0.24%一0.48%之间，以上覆盖面积约占了国土面积的17.6%，居住了大约26.5%的孟姓人群。"
            ]
        }]
    },
    "范": {
        "url": "fan",
        "content": "范姓主要源自：祁姓。",
        "list": [{
            "title": "范姓起源一",
            "content": [
                "出自祁姓，东周时期杜伯之后，以封邑名为氏。明朝姓名名典《姓觽》：“杜伯无罪见杀，其子隰奔晋，为晋士师，子孙以职位为氏，遂为士氏。晋上卿士会佐文公，襄公，又灭赤狄有功，食邑于范，为范氏。” 据《古今姓氏书辨证》和《元和姓纂》所载，周成王灭唐，迁之杜，为杜伯。杜伯无罪见杀，其子杜隰叔奔晋，其孙杜蒍在晋国担任士师（步兵），遂为士氏，称士蒍，其玄孙士会因功封于范（今河南省范县），子孙遂以封邑范为姓，称为范氏。士蒍后世大宗世代称士氏，士蒍有二子，长子士缺、次子士毂。士缺又有二子，幼子名士会，是为范武子。士会后累迁至晋国正卿，封于随邑，为随氏之祖，又封于范邑，立范氏，为范氏始祖。士会嫡子范文子士燮，为国之贤臣；次子士鲂，立彘氏，士鲂便是彘恭子。幼子士囏侍秦，复刘氏，汉高祖刘邦就是他的后代。士燮生范宣子士匄，善刑法，执政晋国。士匄生范献子士鞅，又为晋国执政。士鞅生子范昭子士吉射，因为前497年赵氏发生内乱，赵鞅杀死了中行氏的姻亲邯郸赵午，也作为中行氏姻亲的范吉射帮助中行氏和邯郸赵氏一起对赵氏进行围攻，但最终被四卿打败为赵简子所驱逐，范氏才退出了晋国政坛。此时，士蒍已是子孙满天下。",
                "范氏的始祖，在得姓之初便已显赫万分，自士会范武子以后，范文子、范宣子以及范献子，世代都是晋国的上卿，可以说是曾经左右早期的世家钜族之一。"
            ]
        },{
            "title": "范姓起源二",
            "content": [
                "出自楚国，以地为姓：楚国有范地，左传文公九年，有范山。"
            ]
        },{
            "title": "范姓起源三",
            "content": [
                "源于西南夷，出自晋朝末期林邑王范文，属于文化上汉化改姓为氏。晋朝时期，南蛮有林邑王(亦称占城，今越南中南部)范文。林邑，在汉朝时期为象林郡，“林邑”就是象林之邑的省称，其地境在占城一带(今越南中部地区)。",
                "秦、汉时期，林邑为象郡象林县地。东汉末期，象林功曹之子区连杀了县令自立为王，到公元八世纪后改称环王，公元九世纪后期又改称占城。其后王无嗣，由外孙范熊代立。范熊逝世后，其子范逸继立，称林邑王。",
                "史书记载，“林邑国民果于战斗，便山习水，不闲平地。四时暄暖，无霜无雪，人皆倮露徒跣，以黑色为美。贵女贱男，同姓为婚，妇先娉婿。居丧翦鬓谓之孝，燔尸中野谓之葬。其王服天冠，被缨络，每听政，子弟侍臣皆不得近之。”至晋武帝司马炎太康中期(西元285年)，复来贡献。晋咸康二年(公元336年)，范逸逝世，由其辅臣范文继位。",
                "范文，原来是日南郡西卷县(今越南垣雍城)夷人首领菩跋摩的奴仆，为古安南土著夷族，原本不姓范。后来由范逸赐他名为范文，并将其故主人菩跋摩改称为范椎。",
                "范文从小就经常随商贾往来，曾多次进入中原地区，了解晋朝社会制度，后来到林邑王范逸的属地，教范逸“上国制、作宫室、城邑及器械。逸甚爱信之，使为将”，成为了林邑王范逸的重要辅佐大臣。到林邑王范逸逝世后，因无子，范文随即其位，成为在历史上最著名的林邑王。",
                "范文自立为王后，把原来范逸的妻妾悉数关押在楼里，愿意转而成为自己妻妾的，就放下来伺候自己，不从者就绝其食，将其活活饿死。",
                "后来，范文率林邑国之兵攻伐周边的大小部落，如大岐界、小岐界、式仆、徐狼、屈都、乾鲁、扶单等诸国，然后将其兼并，最后拥众四、五万人。待势力达到一定程度后，范文遣使通表入贡于晋帝。",
                "至晋永和三年(公元418年)，东晋王朝濒临灭亡，范文率其众乘机攻陷日南县，杀太守夏侯览，并屠杀居民五、六千人，然后奔九真(今越南河内顺化以北清华又安)，让国人参观所杀人尸，并以其祭天。随后，又率兵铲平了原来自己为奴时的西卷县城，占据了整个日南地区。之后书告交州刺史朱蕃(今越南河内)，要求以日南北鄙横山为界，割据地区势力。",
                "其后，中原大乱，五胡十六国战乱纷纷，谁也无暇再顾及林邑国之事，林邑国遂日渐坐大，这使范文一族逐渐强势，该支范氏族系不断繁衍壮大，成为今天越南范氏一族的主源。如当今越南社会主义共和国的副总理范家谦，就是范文的后裔子孙。该支范氏族人在历史上多有进入中国广西地区定居者，是今广西地区瑶族、苗族、京族范氏的主流，并有复归至广东、海南、福建、浙江等地者，皆已经汉化为汉族。",
                ""
            ]
        },{
            "title": "范姓起源四",
            "content": [
                "源于满族，属于文化上汉化改姓为氏。",
                "据典籍《清朝通志·氏族略·满洲八旗姓》记载：",
                "⑴.满族博都哩氏，源于唐朝末期女真“通用三十姓”之一的孛木律氏，金国时期为女真孛术鲁氏，以姓为氏，满语拼音为Boduri Hala，世居索伦(今黑龙江嫩江以西广大地区)。清朝中叶以后多改汉字姓为范氏、博氏、鲁氏、花氏、卜氏、布氏等。",
                "⑵.满族范佳氏，满语拼音为Fangiya Hala，东汉末期被辽东鲜卑乌桓部虏携后融入鲜卑族，后逐渐演化为辽东女真，世居辉发(今吉林柳河、辉发河以及沙河下游，桦甸、辉南一带)，清朝中叶以后约有三分之一的族人皆改汉姓为范氏。"
            ]
        },{
            "title": "范姓起源五",
            "content": [
                "据典籍《清朝通志·氏族略·满洲八旗姓》记载：",
                "鄂温克族布利托天氏，亦称布勒多索夫氏、博都哩氏，源出唐朝末期女真“通用三十姓”之一的孛木律氏，金国时期称孛术鲁氏（孛鲁术氏），以姓为氏，世居索伦(今黑龙江嫩江市以西广大地区)。后有满族引为姓氏者，满语拼音为Boduri Hala。清朝中叶以后，鄂温克族、满族布利托天氏多改汉字姓为范氏、博氏、鲁氏、花氏、卜氏、布氏等。",
                "今彝族、京族、阿昌族、土家族、蒙古族、回族等少数民族中，均有范氏族人分布。其来源大多是在唐、宋、元、明、清时期羁糜政策及改土归流运动中，文化上流改为汉姓范氏，世代相传至今。",
                "士会（约前660年－前583年）",
                "即范武子，春秋时期晋国大夫，士蒍之孙。祁姓，士氏，名会，字季，因封于随，称随会；封于范，又称范会；以大宗本家氏号，又为士会。",
                "因迎公子雍之事流亡秦国，河曲之战中为秦国献计，成功抵御晋军。后被赵盾用计迎回晋国。邲之战中看到晋军内部不和，主张班师。荀林父死，升任执政，专务教化，使晋国之盗皆逃于秦。郤克使齐受辱，请求伐齐不得，士会担心晋国发生内乱，告老让郤克为执政。二十年后，晋悼公犹修“范武子之法”，百年之后，赵武、叔向等犹追思士会，欲从之游。范姓尊士会为范姓的得姓始祖。其后，又有范献子，在晋国六卿中。后来，范氏和中行氏一同被智、韩、赵、魏四氏所驱逐、消灭，此乃三家分晋之前夜。[5]",
                "顺阳范氏，是指魏晋南北朝时期一个兴起于顺阳郡（今河南省淅川县李官桥镇 一带）的范氏家族。范氏是当时顺阳地区重要的士族之一。这支范氏人，兴起于秦汉之际，在东晋南北朝时期声名显赫，自隋唐时期开始衰落，历经魏晋南北朝三百多年，其间累世相继，有多达二十九人名载史籍，贵显于世，是当时中国范姓最为显赫的一支。顺阳范氏凭藉累世经学，坚守术业，迈十百载，浸成文化世族。范氏第一代范晷少年游学他乡，被辟为官，子孙藉其荫资，好学文化，为官朝政，效忠儒学皇权，终保范氏一族仕途坦捷，顺阳范氏家族政治地位在两晋南朝也得以维持。",
                "因战国的越相范蠡的籍贯 [6] 和顺阳范氏在地望上一致，故有人认为顺阳范氏的先祖为范蠡。只是，范蠡之子范中男被处极刑后，其余二子也不知所终，致使顺阳范氏之后的世系开始不明，无从考证。还有资料称智伯灭范后，有范姓人自范县徙居顺阳。",
                "范氏自战国范蠡后由于世系不明，子孙又不闻达，致使其后范氏很少有人见显于历史，范氏在魏晋以前的家族世系自是模糊不清。延至魏晋，范晷的出现才使顺阳范氏家族的发展峰回路转。依照田余庆先生所论定义，顺阳范氏于两晋始应属新出门户。作为两晋南朝顺阳范氏第一代的范晷，他的出现对顺阳范氏的振兴和发展起到了关键的铺垫作用。范晷以士起家，进取登仕，正是因为他的入仕，使得其家族子孙在门阀阶层形成的两晋时期开始凭其余荫，入仕为官，几代之后，门第兴盛，终使顺阳范氏成为两晋南朝的世族之家。",
                "东晋一朝，顺阳范氏成员家族兴儒学，助儒学皇权，但终究难抗玄学门阀政治，屡受排挤，成为皇权与门阀政治争权夺利的牺牲品。及至南朝，范泰本创新局面，甚得刘宋皇权青睐。但其子范晔又惹祸端，使得顺阳范氏受诛牵连者甚众。其后虽有梁初范云以振顺阳范氏，然其后代又不通显。至陈，顺阳范氏同所有的士族一样，又复归西晋以前难显于史的状态。在经历了两晋南朝的辉煌之后，顺阳范氏最后又蔑尔无闻。"
            ]
        },{
            "title": "范姓分布",
            "content": [
                "当代范姓的人口已近460万，为全国第五十一位姓氏，大约占全国人口的0.37%。在全国的范围内主要集中于河南、安徽、山东三省，大约占范姓总人口的33%，其次分布于河北、江苏、四川、辽宁、黑龙江、山西，这六省的范姓又集中了29%。河南省是范姓第一大省，约占范姓总人口的17%。全国形成了以河南为中心的四川、辽宁三大块范姓人口聚集地区。范姓在人群中分布频率示意图表明：在晋豫鲁、冀京津、皖苏沪浙大部，范姓一般占当地人口的比例在0.4%以上，中心地区可达0.9%以上，以上地区覆盖面积约占了总国土面积的30.3%，居住了大约72.5%的范姓人口。在四川东部、重庆、云南北端和西南、贵州西北、甘肃大部、宁夏南部、陕西西南、湖北西南、湖南东北部、广东大部，范姓一般占当地人口的比例在0.3%一0.4%之间，其覆盖面积约占了总国土面积的17.8%，居住了大约18.4%的范姓人口。"
            ]
        }]
    },
    "孔": {
        "url": "kong",
        "content": "孔姓主要源自：子姓、姬姓、妫姓、佶姓。",
        "list": [{
            "title": "孔姓始祖起源",
            "content": [
                "1、源于子姓，出自商朝君主成汤之后裔，其子孙中有一支以商族的姓「子」以成汤名字中的「乙」组合起来，为子姓孔氏。",
                "2、源于子姓。出自宋国司马孔父嘉之后，西周初期，成汤的后裔微子启被封于宋国，微子启死后，其弟宋微仲继位。微仲九世孙孔父嘉为宋国大司马，遭受迫害，他的后代逃到鲁国，以其名字中的「孔」为氏，也是子姓孔氏。孔父嘉的六世孙为孔子。",
                "3、源于姬姓，出自春秋时期卫国大夫姬孔悝之后，属于以先祖名字为氏。春秋时期，卫国大夫中有姬孔悝，所以在姬孔悝的后裔子孙中，有以先祖名字为姓氏者，称孔氏。",
                "4、源于妫姓，出自春秋时期陈国大夫孔宁，属于以先祖名字为氏。据史籍《古今姓氏书辨证》等有关资料记载，春秋时陈国(今河南淮阳)有个大夫叫妫孔宁。在妫孔宁的后裔子孙中，有的以先祖名字为姓氏者，称孔氏，是为陈郡孔氏。",
                "5、源于姬姓，出自春秋时期郑穆公姬兰之后，属于以先祖名字为氏。春秋时期，郑国(今河南新郑)君主郑穆公姬兰有后人名姬孔张，在其后裔子孙中，有以先祖名字为姓氏者，世代相传至今，史称郑国孔氏。",
                "6、出自古佶姓的孔氏。",
                "7、源于满族，属于汉化改姓为氏。",
                "（1）满族崆果啰氏，亦称孔果洛氏，满语为Konggolo Hala，汉义“黄马”，世居黑龙江流域。后多冠汉姓为孔氏、广氏等。",
                "（2）满族孔尼喇氏，满语为Kongnila Hala，世居黑龙江。后多冠汉姓为孔氏。",
                "（3）满族叩岱氏，亦称阔代氏，满语为Kodai Hala，汉义“汉人的口袋”，世居哈达(今辽宁西丰小清河流域)。后多冠汉姓为孔氏。",
                "（4）满族库雅拉氏，亦称揆雅拉，源出库雅拉女真，以部为姓，满语为Kuyala Hala，世居东海(今吉林汪清)、绥分(今绥分河上游地区)、乌拉(今吉林永吉)、虎尔哈(今黑龙江黑河对岸俄罗斯地区)、黑龙江流域、毕尔腾(今黑龙江牡丹江镜泊湖)、扎思胡里(今黑龙江第二牡丹江)、兴堪(今黑龙江省及俄罗斯兴凯湖周边地区)等地。后多冠汉姓为孔氏、胡氏、李氏、礼氏等。",
                "（5）满族温都氏，亦称文都氏，源于金国时期温都部，以部为氏，与温敦氏、温屯氏同部族，满语为Wendu Hala，世居讷殷(今吉林抚松松花江上游流域)、绥分(今绥分河上游地区)、瓦尔喀(今南自长白山、图门江以北，北自黑龙江下游乌扎拉地方以南，东海岸则自俄罗斯滨海地区南，包括赫席赫、鄂漠和苏鲁、佛讷赫托克索等地)、乌苏里江等地，是满族最古老的姓氏之一。后多冠汉姓为孔氏、温氏、都氏、文氏、闻氏等。",
                "（6）满族温屯氏，源出唐朝末期女真温敦部，以部为氏，与温都氏、温敦氏同部族，满语为Wentun Hala，世居乌拉(今吉林永吉)，是满族最古老的姓氏之一。后多冠汉姓为孔氏、空氏等。",
                "8、源于其他少数民族，属于汉化改姓为氏。在土家族、苗族、回族等少数民族中，均有孔氏族人分布，其来源大多是在唐、宋、元、明、清时期中央政府推行的羁糜政策及改土归流运动中，流改为汉姓孔氏，世代相传至今。"
            ]
        },{
            "title": "迁徙传播",
            "content": [
                "先秦时期，孔氏族人主要活动于山东、河南地区。秦汉以后，孔姓很快散播到河北、山西、湖南、广东等地。三国两晋时，迁移到浙江、江西东南地区。唐宋时播散到全国各地。清朝初期进入台湾地区。孔子单传七代，四十八代孙孔端友，1128年南迁。",
                "宋朝时期，孔姓大约有21万人，约占全国人口的0.28%，排在第70位。孔姓第一本省是山东，约占当时全国总人口的66.5%",
                "明朝初期，从山西省洪洞县大槐树迁民之孔姓后裔分布于冀、鲁、豫、苏、皖、鄂等地。"
            ]
        },{
            "title": "孔姓分布",
            "content": [
                "从孔子至今，已经二千五百多年过去了，孔氏宗族又传承了八十来代。孔子之后的数代，多次出现过单传情形，人口增长缓慢，到了唐朝末年的四十二代孔光嗣时期，在曲阜的孔子一族后裔竟然尚不足十户，外迁的数量极少。五代后梁时期，经历过“孔末乱孔”的劫难，族人存世更少。一直到了宋朝以后，孔氏在赵宋王朝的大力呵护下，族裔繁衍大幅度增长，到清朝末年，仅四十三代孔仁玉这一支的后裔在曲阜即已经达到了数万人；与此同时，随着社会政治、经济活动的发展，外迁人口也得到极大扩散。",
                "宋朝时期，孔姓大约有21万人，约占全国总人口的0.28%，排在第七十位。孔姓第一本省是山东。",
                "从元代开始，孔氏族人就开始了向海外的迁徙。当时，元朝最高统治者为控制高丽，采取联姻政策。至正九年（1349年），承懿公主远嫁高丽忠肃王之子王颛，孔子裔孙、五十四代孔昭为公主所带侍从之一。到高丽后，孔昭得到高丽王重用，官至门下侍郎同平章事（相当于宰相一职），先后受封为桧原君、昌原君，死后葬于昌原。孔昭的后代在高丽累世为官，其子孔帑官至集贤殿大学士同平章事，其长孙孔俯官至判尹，次孙孔德官至门下侍郎同平章事，与孔昭相同，至此，已是孔氏一门三代之中两人出任高丽朝的宰相。以后世代繁衍，名人辈出，成为朝鲜南部的望族。由于其祖孔昭墓葬在昌原，他们遂以昌原为籍贯。",
                "至明末清初之际，又入迁福建、广东、贵州、云南一带。清朝以后，孔姓子孙已遍布全国各地，还远播海外，使孔姓成为我国诸多家族中一个著名的大宗族。当今孔姓族人分布很广，以山东、江苏、吉林多此姓，上述三省孔姓约占全国汉族孔姓人口的百分之七十三，而孔姓“圣地”山东独占百分之六十。",
                " 高丽王朝皇帝崇奉儒学，对孔氏后裔屡予优待。高丽王国正宗十六年 （1792年），国王考求曲阜孔氏族谱后，命高丽国的孔氏以曲阜为籍贯，以示不忘祖先，并仿中国衍圣公之例封以世爵。",
                "韩国孔氏繁衍至今，已延续到86代。他们的取名与中国国内的规矩不同，另外有一套行辈用字。在韩国还有专门的同宗茹人组织，叫作“曲阜孔氏韩国大宗会”，以表示不忘源出于中国的曲阜，在20世纪80年代曾组团专程赴曲阜祭祖，并在仰圣门（即曲阜城北门）外立碑纪念。另据1987年人口普查统计，韩国的孔姓族人为 17207户，72382人。东南亚各国，在清代末期也有孔氏族人移居过去。至于日本及欧美等地的移居，则是在民国期间开始的。",
                "到20世纪末，孔子后裔已遍及世界各大洲，其中，以韩国、朝鲜、日本、马来西亚、新加坡、印度尼西亚、缅甸、美国等国家和地区数量较多，英国、瑞士、加拿大、澳大利亚等国也有一定数量的孔氏族人。"
            ]
        }]
    },
    "习": {
        "url": "xi",
        "content": "习源于国名，出自春秋时期习国，属于以国名为氏。中国古代有个习国（今陕西商洛丹凤武关少习山一带），以地为名。习姓出自地名“少习”，春秋时的一个地名。《春秋释例》云：“少习，上雒商县武关也。”，“少习”即名少习山（今陕西省丹凤县），当地的居民就以地名为姓氏，为习氏。源于国名，出自春秋时期习国，属于以国名为氏。习国灭亡后，在其公族子孙以及国民中有以故国名为姓氏者，称习氏。到了东汉时期，汉孝和皇帝刘肇在章和二年（公元88年）改故楚地淮阳（今河南淮阳）为陈国，敕封西平王刘羡为陈王，同时给刘羡配任的陈国宰相就叫作习响。习氏族人多尊奉淮阳人氏习响为得姓始祖。",
        "list": [{
            "title": "",
            "content": [
                "在史籍《风俗通》中记载，“习为古国名，汉代有习响，曾为陈相。”",
                "源于国名，出自春秋时期习国，属于以国名为氏。习国灭亡后，在其公族子孙以及国民中有以故国名为姓氏者，称习氏。到了东汉时期，汉孝和皇帝刘肇在章和二年（公元88年）改故楚地淮阳（今河南淮阳）为陈国，敕封西平王刘羡为陈王，同时给刘羡配任的陈国宰相就叫作习响。习氏族人多尊奉淮阳人氏习响为得姓始祖。"
            ]
        },{
            "title": "源于息夫躬",
            "content": [
                "源于国名，出自西汉时期大臣息夫躬，属于以避难改姓为氏。",
                "在夏、商时期，在今河南息县之地就有一古息国。周武王灭殷商之后，在十三年（公元1122年），大封姬姓侯爵，将周文王第三十七子羽达封在古息国之地，称息侯，建有息国。",
                "息国曾强大一时，兵强马壮，是监督中原四周诸侯国的军力力量，号称千乘之国，在春秋时期，息国北结齐、郑、鲁等大国，专门南抗楚国，后息国内乱，国势急剧衰败。到了楚文王熊赀执政开始（公元前689年），就持续攻击阻碍楚国向中原发展称霸的息国，到了周厘王 姬胡齐二年（楚文王十年，公元前680年），楚军终于攻破息国，兵灭了其国，国地成为楚国的息县。",
                "息国灭亡后，其王族后裔以及国民中有以故国名为姓氏者，称息氏，世代相传至今。到了西汉王朝时期，息氏族人中出了一位著名人物，叫息夫躬。",
                "息夫躬，公元？～前1年，字子微，河内河阳人（今河南孟县）。息夫躬是著名的西汉末期大臣。他早年为博士，在西汉末期汉哀帝刘欣执政时期（公元前6～2年），他与皇后之父孔乡侯傅晏、汝南太守孙宠关系密切，且交游甚广。后擢升位光禄大夫、左曹给事中，封宜陵侯。",
                "息夫躬性格耿正，曾数次上书言事，议论无所避，众畏其臼，见之侧目。他还曾建议修缮京师长安的水利设施，增广灌溉，利通漕运。后因与丞相王嘉政见不合，遂被免官就国（今江苏 江都宜陵镇），后被诬陷“悖污朝纲”之罪入狱冤死。",
                "在息夫躬被捕入狱后，其后裔子孙为避牵连之祸，四散迁逃，其中有改原姓的谐音字“习”为姓氏者，称习氏，世代相传至今。"
            ]
        },{
            "title": "源于西梁国",
            "content": [
                "源于国名，出自南北朝时期西梁国，属于以国名为氏。",
                "西梁国，公元555～587年，是南北朝时期出现的政权，国都建于江陵（今湖北荆州），史称后梁。",
                "西魏恭帝拓跋廓元年（公元554年），西魏军队攻陷江陵、杀了南梁国梁元帝萧绎之后，西魏恭帝在次年（公元555年）将属下的梁王萧察立为梁皇帝，成为西魏政权的臣皇帝。",
                "由于西梁国土狭小，属地仅有江陵及其附近数县八百里地，因此先后成为西魏、北周和隋朝的附庸国。但是，西梁国一直自居为南朝正统，因而长期与南朝陈国对立。西梁国由于承续了故南梁国的文化，因而是一个具有高度文化的国家。",
                "西梁国共传梁中宗宣帝萧察、梁世宗明帝萧岿、梁惠宗靖帝萧琮三世，到了隋文帝杨坚开皇七年（公元587年），隋文帝废黜了西梁国制，西梁国因此灭亡，仅存在了三十三年。",
                "西梁国灭亡之后，其皇族后裔中多有改以故国名为姓氏者，称西梁氏，后因避隋朝的迫害，又有改以西梁氏首字谐音字“习”为姓氏者，称习氏，世代相传至今。"
            ]
        },{
            "title": "源于官位",
            "content": [
                "源于官位，出自宋朝时期官吏习学公事，属于以官职称谓为氏。习学公事，原为五代时期后周政权设置的官位，隶属于中书门下省，后来宋太祖赵匡胤“陈桥兵变”夺取后周政权，建立了北宋王朝之后，在中书门下省设立了五个基本的衙门，称作五吏房：一是总房，又称孔目房；二是吏房，三是户房，四是兵礼房，五是刑房。这五个部门综管处理所有的文书事务。",
                "到了北宋神宗赵顼熙宁三年（公元1070年），重新设置“检正五房公事”一名，总管兵监督五房吏各项事务，该官员又称“都检正”。为此，在五房吏各置“检正公事”二人，各自掌管本房事务，简称“检正”。",
                "所有的“都检正”、“检正”皆由京官充任，已经被皇帝选定为充任者，就叫做“习学公事”，然后经由吏部审核之后，分派至相应岗位进行见习，待前任“都检正”、“检正”离任后继任，其后便称“都检正”或“检正”。如若在任的“都检正”或“检正”处于重大国事期间而一直不离任他调（如大规模战争、大范围自然灾害、持续宫廷内乱等），可怜的“习学公事”就一直在岗“见习”，不得他调。",
                "到了宋元丰年间（公元1078～1085年），宋神宗对朝廷职官制度进行了一次重大改革，史称“元丰改制”。期间，废除了“都检正”、“检正”之官称，其职能分归“中书舍人”、“给事中”、“尚书左司郎”、“尚书右司郎”，但“习学公事”之称仍旧保留。到了南宋高宗赵构建炎三年（公元1129年），又重新恢复“检正诸房公事”二人，第二年又废除。到了宋绍兴二年，再重新设置“检正”一名。",
                "该职官模式在辽国、金国、西夏国等少数民族政权中皆有仿设，职能亦相仿佛。",
                "在习学公事的后裔子孙中，有以其官职称谓为姓氏者，称习氏世代相传至今，其中不乏少数民族政权中相应官裔汉化冠改汉姓者。"
            ]
        },{
            "title": "源于官位“教习”",
            "content": [
                "源于官位，出自明、清时期官吏教习，属于以官职称谓为氏。",
                "教习，是明朝初期明太祖朱元璋为教育诸王子而专门设置的官员名称，后成为官学教师的官名。其职能在史籍《明史·职官志》、《清通志·职官略》中皆有详细记述。",
                "明朝时期，朝廷先选一些优秀的进士入翰林院学习，时称庶吉士，给这些庶吉士们教授课程的官员就称作“教习”。自明宣德五年（公元1430年）开始，命学士充任。明万历元年（公元1573年）以后，专以礼、吏二部侍郎兼掌教习。",
                "清朝时期沿用明制，在翰林院设庶常馆，由满、汉大臣各一人任教习，选侍讲、侍读以下官任小教习。各亲王府、官学中亦有设教习。清朝末期，政府出面大力兴办学堂，其教师也沿称为“教习”。这种称谓一直沿用民国初期，后被教育总长蔡元培统改为“教师”，一直沿用至今。",
                "在清朝时期的满族教习的后裔子孙中，有以其官职称谓为汉姓者，就称习氏、教氏，世代相传至今。如清康熙年间著名的江宁巡抚哲伯·玛祜，哲伯氏，满语为Jebe Hala，满洲镶红旗人，世居罕楚哈（今中俄交界绥分河上游地区），初为淳亲王府教习，清康熙八年（公元1669年）特别提授江宁巡抚，他一生为官清廉勤劳，曾上密折指责康熙大帝的爱臣曹寅(曹雪芹的祖父）银饷亏空，其后裔子孙中即有习氏。"
            ]
        },{
            "title": "分支姓氏",
            "content": [
                "先祖：袭勖 出现时间：明朝嘉靖年间",
                "明朝嘉靖年间村里出了个博学多才的教书先生袭勖才改姓“袭”的。关于袭勖改姓的说法有两种：一种是说袭勖教育出的学生中有四人中了进士，同朝为官。皇帝为了嘉奖他为国培养出了栋梁之材，特赐龙袍召他进宫见驾。见驾之中，皇帝随便问他是姓哪个“xi”字，袭勖虽然满腹经纶，可见驾还是第一次，不免紧张，便双手搓起了龙袍，未能及时回答。搓着搓着，急中生智，忽然答道：“龙衣之袭”；另一种说法是，袭勖棋艺高超，皇帝召他进宫之后，经常与皇帝对弈。有一次皇帝找他下棋，他正在树下瞌睡。皇帝怕他着凉，便脱下自己身上的龙袍为他披在了身上。袭勖醒后，为感皇恩，便改姓为龙衣之“袭”了。",
                "袭勖最后被赐为“教谕”。所以章丘县志和乡人都习惯称他为“袭教谕”。现在，据袭氏族谱统计，袭姓已繁衍至章丘多个村庄及省内多个县份与东北三省各地。"
            ]
        },{
            "title": "习姓分布",
            "content": [
                "习氏是一个多民族、多源流的姓氏群体，人口总数在中国的大陆和台湾省均未列入百家姓前三百位，在宋版《百家姓》中排序为第三百三十二位。"
            ]
        }]
    },
    "贺": {
        "url": "he",
        "content": "贺姓主要源自：姬姓、姜姓。",
        "list": [{
            "title": "贺姓起源一",
            "content": [
                "会稽贺氏出自东汉汝阴令庆仪曾孙庆纯之后，属于因避帝王之讳改姓为氏。而会稽庆氏的来源则主要有两种观点。",
                "一是源于姬姓。",
                "三国时谢承的《会稽先贤传》对贺氏的起源作了明确的记载：“贺本庆氏，后稷之裔。太伯始居吴。至王僚，遇公子光之祸。王子庆忌挺身奔卫。妻子迸渡淛水，隐居会稽上。越人哀之，予湖泽之田，俾擅其利。表其族曰庆氏，名其田曰庆湖。今为镜湖，传伪也。安帝时，避帝本生讳，改贺氏，水亦号贺家湖。”该观点认为专诸刺王僚时，王僚的庆忌正出使郑国和卫国，后来庆忌逃到了卫国，而他的妻子和儿子则渡过浙江，逃到会稽山傍隐居下来，当时那儿是一片沼泽，沼泽中有些高地可以耕种，越人就把这些高地给他们耕种，称他们为庆氏，把他们种田的沼泽湖泊地区称为庆湖。该记载认为会稽贺氏起源于庆忌。另外，北宋著名词人认为会稽庆氏起源于庆忌曾经记载于唐以前的官谱中。",
                "二是源于姜姓",
                "据史籍《姓纂》记载：“庆姓，齐公族庆公之后。”又据史籍《古今姓氏书辨证》、《姓氏考略》等文献记载：齐桓公的支庶后代庆封的后代中，皆以先祖名字为姓氏，称庆氏。春秋时期，齐桓公姜小白有个支孙名叫公孙庆克，其子庆封以父名命氏，称为庆氏，史称庆父。庆封在齐灵公姜环执政时期(公元前581～前554年)出任大夫，到了齐庄公姜购执政时期(公元前553～前548年)为上卿，执掌国政，后在齐景公姜杵臼继位之后逃往吴国。到了东汉时期，庆氏后裔传至汝阴郡令(今安徽合肥、涡阳一带)、会稽人庆仪时，其曾孙庆纯官拜侍中，在刘祜成为汉安帝之后，为避汉安帝之父清河王刘庆之名讳(追封的汉庆宗、汉孝德皇帝)，改姓名为贺纯，其后代便相传为贺氏。",
                "谢承的《会稽先贤传》",
                "是关于贺氏来源的最早的记载，比后来的《元和姓纂》的记载早近600年。",
                "贺氏族人大多尊奉贺纯为得姓始祖。"
            ]
        },{
            "title": "贺姓起源二",
            "content": [
                "源于鲜卑族，出自南北朝时期鲜卑慕容部，属于汉化改姓为氏。据史籍《魏书·官氏志》记载：在南北朝时期，北魏孝文帝推行汉化改革政策，将鲜卑拓拔部中的贺兰氏、贺赖氏部落，改成汉字单姓为贺，称贺氏。"
            ]
        },{
            "title": "贺姓得姓始祖",
            "content": [
                "贺宗国：字东峰，为秦御史大夫，授荣禄大夫，调守徐州没，葬九里山前，王山丙向。配张氏：封宜人，葬兴公共冢。是为江苏徐州太始祖。",
                "贺添民：字燎翁，汉桓帝时江西行省提刑没，葬吉州太圳上。配陈氏：封宜人葬兴公合冢。是为江西泰和始祖。",
                "贺应詹：贺应棋、贺应桢、贺应詹兄弟三人，唐荘宗元年由江西太和圳上徙居湘乡之培塘，贺应桢：居万秀塘即今五都也。贺应詹：居南岸老六十都今更为永为丰二十二都，自伯景以后俱系詹公一族。是为迁楚南湘乡祖。",
                "贺伯景：承应詹公而居南岸，没葬南岸东峰冲子山午向。配杨氏：葬南岸东峰冲。是为湖南湘乡贺氏始祖。",
                "贺凭：唐会昌中自会稽以著作郎令永新，秩满居邑这良坊，没葬秋山之阴，子孙远墓面居，是为良坊贺氏始祖。",
                "贺应詹、贺友恕：后唐庄宗时自江右迁居湘邑南岸，传至明朝，有讳宗者生六子，编号日堂，五子友恕为堂五房之祖。是为莲湘贺氏始祖。",
                "贺汉宗：明洪武初由上湘率亲属来湘潭，居城外三十都之黄龙巷。是为湘潭贺氏始祖。",
                "贺礼：明嘉靖间偕弟智自永新垅田徙楚南之攸邑，再由攸隶籍湘潭篁奇林。是为湘潭贺氏始祖。",
                "贺崇寿：明永乐间避毛由江右永新迁湘潭。是为中湘贺家段贺氏始祖。",
                "贺文亮：明永乐初自长沙移家宁乡回泷铺江家桥。是为鹅山贺氏始祖。",
                "贺质：先祖东汉傅中，原姓庆，汗安帝父清河王禄廪貂以庆字训贺，赐姓贺，自此世为贺氏生卒葬失考。元配：氏生卒葬失考。",
                "贺及：字仁甫。宋太元年丙子四月初八申时生，元二庚辰三月初六申时没，葬辰州府后花园。有志。元配：黄氏，宋太平四已卯二月初三戌时生，宝元三年卒已九月初二酉时殁，葬合夫冢。子一：旺。是为益阳祖仁支下始祖。"
            ]
        },{
            "title": "贺姓分布",
            "content": [
                "贺氏得姓是在今浙江绍兴一带，从一开始起就是当地一大望族。故族人自改姓为贺氏以后，就以会稽为其堂号、郡望。贺纯有孙名贺齐，为三国时吴国大将军齐之孙贺邵任中书令，邵之子贺修在西晋任太子太傅，由于仕宦周迁等原因，贺氏开始在江浙一带缓慢迁徙。",
                "会稽贺氏在汉、魏六朝时期，他们与同郡的虞、魏、孔三姓并称为“会稽四姓”。",
                "魏、晋、南北朝时期，因北方兵连祸接，各民族不断大举南迁，使得南方的贺氏家族分布更广。出自鲜卑的贺氏，也很快繁衍壮大，后与从江南北上的贺氏不断地融合发展，逐渐在北方形成两大郡望，即河南郡、广平郡。",
                "唐朝时期，贺修的十二世孙贺德仁为唐太子中书舍人，贺德仁的侄孙贺默为彭州刺史(今江苏徐州)，贺德仁的侄曾孙贺知章任唐玄宗秘书监，可见此期世居会稽之贺氏已呈大批北上之势。",
                "宋朝词人贺铸为贺知章之后，生于今河南汲县，晚年退居苏、常。唐宋之际，贺氏已分布于中国东部广大地区，其中在北方，是以今河南、河北、山西、山东、陕西分布最为集中。此期又形成山阴(隋朝时期贺德基之族所在)、青州(宋朝时期贺恂之族所在)、忻州(宋朝时期易州刺史贺惟忠之族所在)、陈留(宋朝时期右千牛卫大将军贺率景之族所在)、蔡州(宋朝时期中散大夫贺应诚之族所在)、济南(宋时秉议郎贺适中之族所在)、齐州(宋朝时期光禄卿贺志诚之族所在)、密州(宋朝时期贺宽之族所在)等郡望。明初，贺氏作为洪洞大槐树迁民姓氏之一，被分迁于江苏、河南、山东、湖北、河北等地。",
                "明、清以后，贺氏遍及全国各地，并有远播海外者。",
                "如今，贺氏分布甚广，尤以湖南、山西两省多此姓，这两省贺氏就占全国汉族贺氏人口的30%以上。"
            ]
        }]
    },
    "毛": {
        "url": "mao",
        "content": "毛姓主要源自：姬姓。",
        "list": [{
            "title": "起源源流",
            "content": [
                "1、 源于姬姓，属于以国名为氏。毛氏，本姓姬，是黄帝后裔，周武王母弟毛叔郑之后。毛叔郑（毛伯郑）始建有毛国，后迁于今陕西岐山、扶风一带，再后举国避难于河南荥阳地区。在毛伯郑的后裔子孙以及国民中，皆有以先祖爵号、封国之名为姓者，史称毛氏正宗。毛氏族人大多尊奉毛叔郑为得姓始祖。",
                "2、出自周文王姬昌之子伯聃的封地毛邑，属于以封邑为氏。伯聃（伯明）受封于毛邑（今河南宜阳），在周王室任司空之职，负责土木工程建筑事务，为周成王六卿之一。在后世子孙中，有以封地命姓者。",
                "3、源于改姓而来：",
                "1）源于蒙古族，属于汉化改姓为氏。①元朝右丞相伯卜花的孙子福寿，归附明朝，因率明军讨还湖广、巴蜀等处有功，官至副总兵，明成祖朱棣赐予毛氏，其后裔子孙多称毛氏。②蒙古族鞑靼部落酋长毛里孩，在明朝时遣使进贡，明宪宗朱见深赐汉姓毛氏，其后裔子孙多称毛氏。",
                "2）源于氐族，属于汉化改姓为氏。氐族在殷周到南北朝时期主要分布在今陕西、甘肃、四川等省，从事畜牧业和农业，在两晋时期曾建立有前秦、后凉、成汉等国。",
                "3）源于回族，属于汉化改姓为氏。毛忠，初名哈喇，明军将领。因守边有功，明英宗朱祁镇为表彰他，特赐予毛氏，为回族毛氏之祖。毛氏回族现主要分布在新疆和甘肃一带。",
                "4）源于其他少数民族，属于汉化改姓为氏。今苗族、傣族、彝族、高山族、布依族、满族、佤族、土家族等少数民族中，均有毛氏族人分布，多为明、清时期改土归流运动中改汉姓者后裔。",
                "得姓始祖：毛叔郑。",
                "他不仅是毛国的首领，还在周王朝中担任司空之职，总管土木建筑工程等事务，他的伯爵爵位可以由其子孙世袭继承。"
            ]
        },{
            "title": "毛姓分布",
            "content": [
                "宋朝时期，毛姓人口大约有16万人，约占全国人口的0.21%，排在第八十二位。浙江为毛姓的第一大省，约占全国毛姓总人口的29.6%。在全国的分布主要集中于浙江、江西、广西、四川、湖南，这五省毛姓大约占全国毛姓总人口的83%；其次分布于江苏、河南，这两省的毛姓又集中了10%。毛姓主要分布在长江流域及以南地区，形成了以东部浙赣和西部川湘为中心的两大块毛姓聚集区。",
                "明朝时期，毛姓人口大约有32万人，约占全国人口0.34%，排在第六十八位。宋元明600年全国人口纯增长率是20%，毛姓人口纯增长比全国人口增长率要高。浙江为毛姓第一大省，约占全国毛姓总人口的34.6%。在全国的分布主要集中于浙江、甘肃两省，这两省毛姓大约占毛姓总人口的47%；其次分布于江西、江苏、山东、湖南、湖北，这五省的毛姓又集中了26%。宋元明600余年间，毛姓人口分布格局变化大，人口主要向东南、西北地区迁移。全国重新形成了浙赣、湘鄂、甘肃三块毛姓聚集区。"
            ]
        },{
            "title": "毛姓人口分布图",
            "content": [
                "当代，毛姓总人口约250万，大约占全国总人口的0.2%。从明朝以来的600年，毛姓人口由32万增至250万，达7倍多，但总体增速低于全国总人口增速。在全国主要集中于浙江、四川、河南三省，大约占毛姓总人口的28%；其次，分布于湖南、广西、重庆、江西、江苏，这五省市又集中了32%。浙江集中了毛姓总人口的12%，为毛姓第一大省。600年间，毛姓人口流动方向，由东南部向西部和中原地区回迁，全国形成了浙江、川渝湘、河南三块毛姓聚集区。",
                "在浙沪、皖苏南部、福建北部、赣渝鄂大部、湘黔桂、广东西部、川云东部、甘肃中段、青海东北，毛姓一般占当地人口比例的0.36%以上，中心地区可达3%以上，上述地区覆盖面积约占全国总面积的19.7%，该地区居住了大约64%的毛姓人群。在皖苏中部、豫陕宁南部、甘肃大部、青海东南、新疆西北、四川大部、云南中部、鄂渝北部、粤闽中部、海南北部、江西东南、黑龙江东部、辽宁中部，毛姓人口占当地总人口的比例在0.24-0.36%之间，其覆盖面积占全国总面积的16.3%，该地区居住了大约17%的毛姓人群。"
            ]
        }]
    },
    "邓": {
        "url": "deng",
        "content": "邓姓主要源自：曼姓。",
        "list": [
            {
                "title": "源于曼姓",
                "content": [
                    "出自商高宗武丁给叔父曼季的封地，史称邓国（河南邓县），属于以国名为氏。《贵姓何来》关于邓姓的解释：“邓氏出自曼姓，是以国名为氏的。在殷商时期，国王武丁封他的叔父为邓侯，建立邓国，故址在今河南邓县（今邓州市）。春秋时，邓国为楚国所灭，其国君的后代有的就用国名‘邓’作自己的姓氏。”两周时期，邓国是周王朝南方较为重要的诸侯国之一，历经西周、春秋，一直延续了有六百多年，后邓况徙居南阳新野。楚灭邓后，楚公子被封到邓陵，后称邓城，在今湖北襄樊市襄城郊区西北，其封邑楚公子的后代，姓“邓陵”。递传到曼公第47代孙禹公，禹公中兴汉室，辅佐汉光武帝刘秀建立东汉王朝，因“云台首功”而受封为“云台二十八将之首”。",
                    "汉和帝刘肇在元兴元年(公元105年)去世，禹公孙女邓绥进入了刘氏东汉王朝权力中心，直至成为中国历史上第一个垂帘听政的皇后。我邓氏家族也成了东汉王朝最具权势的外戚家族。",
                    "禹公世居新野，而新野在东汉时归南阳郡管辖，故我支邓氏在东汉因禹公“云台首功”、“禹公十三子，后世皆可法”被称为南阳郡邓氏。自曼季之后，邓国历、邓晁侯→邓徽侯→邓庆侯→邓恒侯→邓昆侯→邓忠侯→邓辉侯→邓浩侯→邓煦侯→邓杞侯→邓熹侯→邓怡侯→邓沛侯→邓壁侯→邓淳侯→邓衡侯→邓略侯→邓宣侯→邓尚侯→邓粹侯→邓明侯，计二十二代，经六百余年，连续世袭侯爵，这是邓氏先世的鼎盛时期。",
                    "亡国之后的邓侯子孙，为纪念故国便以国名为姓氏，称邓氏，史称邓氏正宗，亦称曼姓邓氏。"
                ]
            },
            {
                "title": "邓姓分布",
                "content": [
                    "邓氏是一个多民族、多源流的古老姓氏，在当今姓氏榜上位居第二十六位，属于超级大姓系列，人口约九百一十万左右（截至2015），占全国人口总数的0.57%左右，并以四川、广东、福建、湖南、江苏、江西、台湾等省最多。"
                ]
            }
        ]
    }
}